[
  {
    "db_id": "cordis_temporary",
    "question": "Count the number of distinct descriptions of activity types carried out by project members whose department is not \"Innovation and Technology\"",
    "sql_query": "select count(distinct activity_types.description) from project_members join activity_types on project_members.activity_type = activity_types.code where project_members.department_name != 'Innovation and Technology'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(2) T(0) C(2) T(0) Filter(3) A(0) Op(0) C(39) T(12) C(39) T(12) V(0)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_description) as ?aggregation_T1_description_104 ) WHERE { ?T1 a dbo:activity_types . ?T2 a dbo:project_members . ?T2 dbo:activity_type ?T1 . ?T1 dbo:description ?T1_description . ?T2 dbo:department_name ?T2_department_name . FILTER(?T2_department_name != 'Innovation && Technology') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "List the eu territorial units that have project members with a Grant Office department",
    "sql_query": "select distinct eu_territorial_units.description from project_members join eu_territorial_units on project_members.geocode_regions_3 = eu_territorial_units.geocode_regions where project_members.department_name = 'Grant Office'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(2) T(5) C(2) T(5) Filter(2) A(0) Op(0) C(39) T(12) C(39) T(12) V(0)",
    "sparql_query": "SELECT DISTINCT ?T1_description WHERE { ?T1 a dbo:eu_territorial_units . ?T2 a dbo:project_members . ?T2 dbo:geocode_regions_3 ?T1 . ?T1 dbo:description ?T1_description . ?T2 dbo:department_name ?T2_department_name . FILTER(?T2_department_name = 'Grant Office') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the total cost of the projects whose acronym is not COELUX and the panel description is Physical and Analytical Chemical sciences?",
    "sql_query": "select sum(projects.total_cost) from project_erc_panels join projects on project_erc_panels.project = projects.unics_id join erc_panels on erc_panels.code = project_erc_panels.panel where erc_panels.description = 'Physical and Analytical Chemical sciences' and projects.acronym != 'COELUX'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(4) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(2) T(3) C(2) T(3) V(0) Filter(3) A(0) Op(0) C(20) T(16) C(20) T(16) V(1)",
    "sparql_query": "SELECT (sum( ?T1_total_cost) as ?aggregation_T1_total_cost_55 ) WHERE { ?T1 a dbo:projects . ?T13 a dbo:project_erc_panels . ?T13 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:description ?T2_description . ?T1 dbo:acronym ?T1_acronym . ?T2 a dbo:erc_panels . ?T13 dbo:panel ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:description ?T2_description . ?T1 dbo:acronym ?T1_acronym . FILTER(?T2_description = 'Physical && Analytical Chemical sciences' && ?T1_acronym != 'COELUX') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the total cost of the projects whose end date is after 2017-12-12 and their panel description is Neurosciences and neural disorders?",
    "sql_query": "select sum(projects.total_cost) from erc_panels join project_erc_panels on erc_panels.code = project_erc_panels.panel join projects on project_erc_panels.project = projects.unics_id where erc_panels.description = 'Neurosciences and neural disorders' and projects.end_date > '2017-12-12'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(4) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(2) T(3) C(2) T(3) V(0) Filter(5) A(0) Op(0) C(51) T(16) C(51) T(16) V(1)",
    "sparql_query": "SELECT (sum( ?T1_total_cost) as ?aggregation_T1_total_cost_89 ) WHERE { ?T1 a dbo:projects . ?T13 a dbo:project_erc_panels . ?T13 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:description ?T2_description . ?T1 dbo:end_date ?T1_end_date . ?T2 a dbo:erc_panels . ?T13 dbo:panel ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:description ?T2_description . ?T1 dbo:end_date ?T1_end_date . FILTER(?T2_description = 'Neurosciences && neural disorders' && ?T1_end_date > '2017-12-12') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "How many subject areas are associated with projects whose start date is not 2014-03-15?",
    "sql_query": "select count(distinct subject_areas.title) from project_subject_areas join subject_areas on project_subject_areas.subject_area = subject_areas.code join projects on projects.unics_id = project_subject_areas.project where projects.start_date != '2014-03-15'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(13) T(17) C(13) T(17) Filter(3) A(0) Op(0) C(50) T(16) C(50) T(16) V(0)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_112 ) WHERE { ?T1 a dbo:subject_areas . ?T13 a dbo:project_subject_areas . ?T13 dbo:subject_area ?T1 . ?T1 dbo:title ?T1_title . ?T2 dbo:start_date ?T2_start_date . ?T2 a dbo:projects . ?T13 dbo:project ?T2 . ?T1 dbo:title ?T1_title . ?T2 dbo:start_date ?T2_start_date . FILTER(?T2_start_date != '2014-03-15') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the average cost of projects whose acronym is not PROX1, their members are located in BG and have territorial unit description Warszawski zachodni?",
    "sql_query": "select avg(projects.total_cost) from eu_territorial_units join project_members on eu_territorial_units.geocode_regions = project_members.geocode_regions_3 join projects on project_members.project = projects.unics_id where eu_territorial_units.description = 'Warszawski zachodni' and project_members.country = 'BG' and projects.acronym != 'PROX1'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(2) T(5) C(2) T(5) V(0) Filter(0) Filter(2) A(0) Op(0) C(31) T(12) C(31) T(12) V(1) Filter(3) A(0) Op(0) C(20) T(16) C(20) T(16) V(2)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_40 ) WHERE { ?T1 a dbo:projects . ?T3 a dbo:project_members . ?T3 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:description ?T2_description . ?T3 dbo:country ?T3_country . ?T1 dbo:acronym ?T1_acronym . ?T2 a dbo:eu_territorial_units . ?T3 dbo:geocode_regions_3 ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:description ?T2_description . ?T3 dbo:country ?T3_country . ?T1 dbo:acronym ?T1_acronym . FILTER(?T2_description = 'Warszawski zachodni' && ?T3_country = 'BG' && ?T1_acronym != 'PROX1') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the total cost of projects with date after 2017-01-01 whose institution's acronym is barcelonabeta ?",
    "sql_query": "select sum(projects.total_cost) from project_members join projects on project_members.project = projects.unics_id join institutions on institutions.unics_id = project_members.institution_id where institutions.acronym = 'barcelonabeta' and projects.end_date > '2017-01-01'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(4) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(20) T(7) C(20) T(7) V(0) Filter(5) A(0) Op(0) C(51) T(16) C(51) T(16) V(1)",
    "sparql_query": "SELECT (sum( ?T1_total_cost) as ?aggregation_T1_total_cost_25 ) WHERE { ?T1 a dbo:projects . ?T13 a dbo:project_members . ?T13 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:acronym ?T2_acronym . ?T1 dbo:end_date ?T1_end_date . ?T2 a dbo:institutions . ?T13 dbo:institution_id ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:acronym ?T2_acronym . ?T1 dbo:end_date ?T1_end_date . FILTER(?T2_acronym = 'barcelonabeta' && ?T1_end_date > '2017-01-01') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the total cost of the projects with title Heritage energy Living Lab onsite and the funding scheme is not CP-Scale of Unit?",
    "sql_query": "select sum(projects.total_cost) from funding_schemes join projects on funding_schemes.code = projects.ec_fund_scheme where funding_schemes.title != 'CP-Scale of Unit' and projects.title = 'Heritage energy Living Lab onsite'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(4) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(3) A(0) Op(0) C(13) T(6) C(13) T(6) V(0) Filter(2) A(0) Op(0) C(13) T(16) C(13) T(16) V(1)",
    "sparql_query": "SELECT (sum( ?T1_total_cost) as ?aggregation_T1_total_cost_155 ) WHERE { ?T1 a dbo:projects . ?T2 a dbo:funding_schemes . ?T1 dbo:ec_fund_scheme ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:title ?T2_title . ?T1 dbo:title ?T1_title . FILTER(?T2_title != 'CP-Scale of Unit' && ?T1_title = 'Heritage energy Living Lab onsite') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "How many different activity types have project members who are not in the city of GEMENOS?",
    "sql_query": "select count(distinct activity_types.description) from project_members join activity_types on project_members.activity_type = activity_types.code where project_members.city != 'GEMENOS'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(2) T(0) C(2) T(0) Filter(3) A(0) Op(0) C(33) T(12) C(33) T(12) V(0)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_description) as ?aggregation_T1_description_22 ) WHERE { ?T1 a dbo:activity_types . ?T2 a dbo:project_members . ?T2 dbo:activity_type ?T1 . ?T1 dbo:description ?T1_description . ?T2 dbo:city ?T2_city . FILTER(?T2_city != 'GEMENOS') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Show the total cost of projects with a starting date equal or greater than 2019-10-30 and where at least one participant is from South Georgia",
    "sql_query": "select sum(projects.total_cost) from project_members join projects on project_members.project = projects.unics_id join institutions on institutions.unics_id = project_members.institution_id join countries on countries.unics_id = institutions.country_id where projects.start_date >= '2019-10-30' and countries.country_name = 'South Georgia'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(4) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(7) A(0) Op(0) C(50) T(16) C(50) T(16) V(0) Filter(2) A(0) Op(0) C(4) T(1) C(4) T(1) V(1)",
    "sparql_query": "SELECT (sum( ?T1_total_cost) as ?aggregation_T1_total_cost_187 ) WHERE { ?T1 a dbo:projects . ?T13 a dbo:project_members . ?T13 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T1 dbo:start_date ?T1_start_date . ?T2 dbo:country_name ?T2_country_name . ?T14 a dbo:institutions . ?T13 dbo:institution_id ?T14 . ?T1 dbo:total_cost ?T1_total_cost . ?T1 dbo:start_date ?T1_start_date . ?T2 dbo:country_name ?T2_country_name . ?T2 a dbo:countries . ?T14 dbo:country_id ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T1 dbo:start_date ?T1_start_date . ?T2 dbo:country_name ?T2_country_name . FILTER(?T1_start_date >= '2019-10-30' && ?T2_country_name = 'South Georgia') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Show the number of subject areas of projects in the programme \"Research in support of international space partnerships\" that have an acronym different than \"PEPCHIPOMICS\"",
    "sql_query": "select count(distinct subject_areas.title) from project_programmes join projects on project_programmes.project = projects.unics_id join programmes on programmes.code = project_programmes.programme join project_subject_areas on projects.unics_id = project_subject_areas.project join subject_areas on project_subject_areas.subject_area = subject_areas.code where projects.acronym != 'PEPCHIPOMICS' and programmes.short_name = 'Research in support of international space partnerships'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(13) T(17) C(13) T(17) Filter(0) Filter(3) A(0) Op(0) C(20) T(16) C(20) T(16) V(0) Filter(2) A(0) Op(0) C(21) T(9) C(21) T(9) V(1)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_66 ) WHERE { ?T1 a dbo:subject_areas . ?T14 a dbo:project_subject_areas . ?T14 dbo:subject_area ?T1 . ?T1 dbo:title ?T1_title . ?T2 dbo:acronym ?T2_acronym . ?T3 dbo:short_name ?T3_short_name . ?T2 a dbo:projects . ?T14 dbo:project ?T2 . ?T1 dbo:title ?T1_title . ?T2 dbo:acronym ?T2_acronym . ?T3 dbo:short_name ?T3_short_name . ?T15 a dbo:project_programmes . ?T15 dbo:project ?T2 . ?T1 dbo:title ?T1_title . ?T2 dbo:acronym ?T2_acronym . ?T3 dbo:short_name ?T3_short_name . ?T3 a dbo:programmes . ?T15 dbo:programme ?T3 . ?T1 dbo:title ?T1_title . ?T2 dbo:acronym ?T2_acronym . ?T3 dbo:short_name ?T3_short_name . FILTER(?T2_acronym != 'PEPCHIPOMICS' && ?T3_short_name = 'Research in support of international space partnerships') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Show the total cost of projects that started after 2008-11-10 and fall into the ERC panel \"Cellular and Developmental Biology\"",
    "sql_query": "select sum(projects.total_cost) from project_erc_panels join projects on project_erc_panels.project = projects.unics_id join erc_panels on erc_panels.code = project_erc_panels.panel where erc_panels.description = 'Cellular and Developmental Biology' and projects.start_date > '2008-11-10'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(4) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(2) T(3) C(2) T(3) V(0) Filter(5) A(0) Op(0) C(50) T(16) C(50) T(16) V(1)",
    "sparql_query": "SELECT (sum( ?T1_total_cost) as ?aggregation_T1_total_cost_104 ) WHERE { ?T1 a dbo:projects . ?T13 a dbo:project_erc_panels . ?T13 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:description ?T2_description . ?T1 dbo:start_date ?T1_start_date . ?T2 a dbo:erc_panels . ?T13 dbo:panel ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:description ?T2_description . ?T1 dbo:start_date ?T1_start_date . FILTER(?T2_description = 'Cellular && Developmental Biology' && ?T1_start_date > '2008-11-10') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Count the number of ERC panels for projects that do not end in 2020",
    "sql_query": "select count(distinct erc_panels.description) from project_erc_panels join erc_panels on project_erc_panels.panel = erc_panels.code join projects on projects.unics_id = project_erc_panels.project where projects.end_year != '2020'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(2) T(3) C(2) T(3) Filter(3) A(0) Op(0) C(53) T(16) C(53) T(16) V(0)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_description) as ?aggregation_T1_description_125 ) WHERE { ?T1 a dbo:erc_panels . ?T13 a dbo:project_erc_panels . ?T13 dbo:panel ?T1 . ?T1 dbo:description ?T1_description . ?T2 dbo:end_year ?T2_end_year . ?T2 a dbo:projects . ?T13 dbo:project ?T2 . ?T1 dbo:description ?T1_description . ?T2 dbo:end_year ?T2_end_year . FILTER(?T2_end_year != 2020) . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Show the average total cost of projects that started in 2010 in which there is an institution involved with an acronym different than \"CEA\"",
    "sql_query": "select avg(projects.total_cost) from project_members join projects on project_members.project = projects.unics_id join institutions on institutions.unics_id = project_members.institution_id where institutions.acronym != 'CEA' and projects.start_year = '2010'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(3) A(0) Op(0) C(20) T(7) C(20) T(7) V(0) Filter(2) A(0) Op(0) C(52) T(16) C(52) T(16) V(1)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_33 ) WHERE { ?T1 a dbo:projects . ?T13 a dbo:project_members . ?T13 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:acronym ?T2_acronym . ?T1 dbo:start_year ?T1_start_year . ?T2 a dbo:institutions . ?T13 dbo:institution_id ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:acronym ?T2_acronym . ?T1 dbo:start_year ?T1_start_year . FILTER(?T2_acronym != 'CEA' && ?T1_start_year = 2010) . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Get country code 2 from country with name Martinique having an institution inside with an acronym different than \"IDIBELL\".",
    "sql_query": "select distinct countries.country_code2 from institutions join countries on institutions.country_id = countries.unics_id where institutions.acronym != 'IDIBELL' and countries.country_name = 'Martinique'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(5) T(1) C(5) T(1) Filter(0) Filter(3) A(0) Op(0) C(20) T(7) C(20) T(7) V(0) Filter(2) A(0) Op(0) C(4) T(1) C(4) T(1) V(1)",
    "sparql_query": "SELECT DISTINCT ?T1_country_code2 WHERE { ?T1 a dbo:countries . ?T2 a dbo:institutions . ?T2 dbo:country_id ?T1 . ?T1 dbo:country_code2 ?T1_country_code2 . ?T2 dbo:acronym ?T2_acronym . ?T1 dbo:country_name ?T1_country_name . FILTER(?T2_acronym != 'IDIBELL' && ?T1_country_name = 'Martinique') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Retrieve the average total cost of projects whose topic title is \"Conversion of lignin-rich streams from biorefineries) and whose acronym is \"LocalOrder\"",
    "sql_query": "select avg(projects.total_cost) from project_topics join projects on project_topics.project = projects.unics_id join topics on topics.code = project_topics.topic where topics.title = 'Conversion of lignin-rich streams from biorefineries' and projects.acronym = 'LocalOrder'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(13) T(18) C(13) T(18) V(0) Filter(2) A(0) Op(0) C(20) T(16) C(20) T(16) V(1)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_98 ) WHERE { ?T1 a dbo:projects . ?T13 a dbo:project_topics . ?T13 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:title ?T2_title . ?T1 dbo:acronym ?T1_acronym . ?T2 a dbo:topics . ?T13 dbo:topic ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:title ?T2_title . ?T1 dbo:acronym ?T1_acronym . FILTER(?T2_title = 'Conversion of lignin-rich streams from biorefineries' && ?T1_acronym = 'LocalOrder') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Select distincct ERC panel descriptions from project ending in 2012",
    "sql_query": "select distinct erc_panels.description from project_erc_panels join erc_panels on project_erc_panels.panel = erc_panels.code join projects on projects.unics_id = project_erc_panels.project where projects.end_year = '2012'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(2) T(3) C(2) T(3) Filter(2) A(0) Op(0) C(53) T(16) C(53) T(16) V(0)",
    "sparql_query": "SELECT DISTINCT ?T1_description WHERE { ?T1 a dbo:erc_panels . ?T13 a dbo:project_erc_panels . ?T13 dbo:panel ?T1 . ?T1 dbo:description ?T1_description . ?T2 dbo:end_year ?T2_end_year . ?T2 a dbo:projects . ?T13 dbo:project ?T2 . ?T1 dbo:description ?T1_description . ?T2 dbo:end_year ?T2_end_year . FILTER(?T2_end_year = 2012) . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Retrieve all the titles of funding schemes for projects whose ending year is != 2019 .",
    "sql_query": "select distinct funding_schemes.title from projects join funding_schemes on projects.ec_fund_scheme = funding_schemes.code where projects.end_year != '2019'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(13) T(6) C(13) T(6) Filter(3) A(0) Op(0) C(53) T(16) C(53) T(16) V(0)",
    "sparql_query": "SELECT DISTINCT ?T1_title WHERE { ?T1 a dbo:funding_schemes . ?T2 a dbo:projects . ?T2 dbo:ec_fund_scheme ?T1 . ?T1 dbo:title ?T1_title . ?T2 dbo:end_year ?T2_end_year . FILTER(?T2_end_year != 2019) . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Retrieve the sum of the projects total costs starting after 2017 and whose panel description is != \"Molecular and Structural Biology and Biochemistry\"",
    "sql_query": "select sum(projects.total_cost) from project_erc_panels join projects on project_erc_panels.project = projects.unics_id join erc_panels on erc_panels.code = project_erc_panels.panel where erc_panels.description != 'Molecular and Structural Biology and Biochemistry' and projects.start_year > '2017'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(4) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(3) A(0) Op(0) C(2) T(3) C(2) T(3) V(0) Filter(5) A(0) Op(0) C(52) T(16) C(52) T(16) V(1)",
    "sparql_query": "SELECT (sum( ?T1_total_cost) as ?aggregation_T1_total_cost_51 ) WHERE { ?T1 a dbo:projects . ?T13 a dbo:project_erc_panels . ?T13 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:description ?T2_description . ?T1 dbo:start_year ?T1_start_year . ?T2 a dbo:erc_panels . ?T13 dbo:panel ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:description ?T2_description . ?T1 dbo:start_year ?T1_start_year . FILTER(?T2_description != 'Molecular && Structural Biology && Biochemistry' && ?T1_start_year > 2017) . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Retrieve the average of projects total costs for projects ending before 2017-02-93 and whose subject areas titles are equal to \"industrial biotech\"",
    "sql_query": "select avg(projects.total_cost) from subject_areas join project_subject_areas on subject_areas.code = project_subject_areas.subject_area join projects on project_subject_areas.project = projects.unics_id where subject_areas.title = 'Industrial biotech' and projects.end_date < '2017-02-03'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(13) T(17) C(13) T(17) V(0) Filter(4) A(0) Op(0) C(51) T(16) C(51) T(16) V(1)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_145 ) WHERE { ?T1 a dbo:projects . ?T13 a dbo:project_subject_areas . ?T13 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:title ?T2_title . ?T1 dbo:end_date ?T1_end_date . ?T2 a dbo:subject_areas . ?T13 dbo:subject_area ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:title ?T2_title . ?T1 dbo:end_date ?T1_end_date . FILTER(?T2_title = 'Industrial biotech' && ?T1_end_date < '2017-02-03') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Count the number of topics titles for projects whose erc panel description is equal to \"The study of the human past\" and whose end date is > \"2021-08-20\"",
    "sql_query": "select count(distinct topics.title) from erc_panels join project_erc_panels on erc_panels.code = project_erc_panels.panel join projects on project_erc_panels.project = projects.unics_id join project_topics on projects.unics_id = project_topics.project join topics on project_topics.topic = topics.code where erc_panels.description = 'The study of the human past' and projects.end_date > '2021-08-20'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(13) T(18) C(13) T(18) Filter(0) Filter(2) A(0) Op(0) C(2) T(3) C(2) T(3) V(0) Filter(5) A(0) Op(0) C(51) T(16) C(51) T(16) V(1)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_198 ) WHERE { ?T1 a dbo:topics . ?T14 a dbo:project_topics . ?T14 dbo:topic ?T1 . ?T1 dbo:title ?T1_title . ?T2 dbo:description ?T2_description . ?T3 dbo:end_date ?T3_end_date . ?T3 a dbo:projects . ?T14 dbo:project ?T3 . ?T1 dbo:title ?T1_title . ?T2 dbo:description ?T2_description . ?T3 dbo:end_date ?T3_end_date . ?T15 a dbo:project_erc_panels . ?T15 dbo:project ?T3 . ?T1 dbo:title ?T1_title . ?T2 dbo:description ?T2_description . ?T3 dbo:end_date ?T3_end_date . ?T2 a dbo:erc_panels . ?T15 dbo:panel ?T2 . ?T1 dbo:title ?T1_title . ?T2 dbo:description ?T2_description . ?T3 dbo:end_date ?T3_end_date . FILTER(?T2_description = 'The study of the human past' && ?T3_end_date > '2021-08-20') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Sum the total costs of projects having title != \"Platform to stimulate the development of breakthrough technologies and concepts enabling step changes in aviation\" and whose start date is != 2012-04-02",
    "sql_query": "select sum(projects.total_cost) from project_topics join projects on project_topics.project = projects.unics_id join topics on topics.code = project_topics.topic where projects.start_date != '2012-04-02' and topics.title != 'Platform to stimulate the development of breakthrough technologies and concepts enabling step changes in aviation'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(4) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(3) A(0) Op(0) C(50) T(16) C(50) T(16) V(0) Filter(3) A(0) Op(0) C(13) T(18) C(13) T(18) V(1)",
    "sparql_query": "SELECT (sum( ?T1_total_cost) as ?aggregation_T1_total_cost_128 ) WHERE { ?T1 a dbo:projects . ?T13 a dbo:project_topics . ?T13 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T1 dbo:start_date ?T1_start_date . ?T2 dbo:title ?T2_title . ?T2 a dbo:topics . ?T13 dbo:topic ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T1 dbo:start_date ?T1_start_date . ?T2 dbo:title ?T2_title . FILTER(?T1_start_date != '2012-04-02' && ?T2_title != 'Platform to stimulate the development of breakthrough technologies && concepts enabling step changes in aviation') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Retrieve EU territorial unit descriptions members whose short name is different from \"QA\", working for a project where the topics title is not \"Space Robotic Technologies\"",
    "sql_query": "select distinct eu_territorial_units.description from projects join project_members on projects.unics_id = project_members.project join project_topics on project_topics.project = projects.unics_id join eu_territorial_units on project_members.geocode_regions_3 = eu_territorial_units.geocode_regions join topics on topics.code = project_topics.topic where topics.title != 'Space Robotics Technologies' and project_members.member_short_name != 'QA'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(2) T(5) C(2) T(5) Filter(0) Filter(3) A(0) Op(0) C(13) T(18) C(13) T(18) V(0) Filter(3) A(0) Op(0) C(38) T(12) C(38) T(12) V(1)",
    "sparql_query": "SELECT DISTINCT ?T1_description WHERE { ?T1 a dbo:eu_territorial_units . ?T3 a dbo:project_members . ?T3 dbo:geocode_regions_3 ?T1 . ?T1 dbo:description ?T1_description . ?T2 dbo:title ?T2_title . ?T3 dbo:member_short_name ?T3_member_short_name . ?T14 a dbo:projects . ?T3 dbo:project ?T14 . ?T1 dbo:description ?T1_description . ?T2 dbo:title ?T2_title . ?T3 dbo:member_short_name ?T3_member_short_name . ?T15 a dbo:project_topics . ?T15 dbo:project ?T14 . ?T1 dbo:description ?T1_description . ?T2 dbo:title ?T2_title . ?T3 dbo:member_short_name ?T3_member_short_name . ?T2 a dbo:topics . ?T15 dbo:topic ?T2 . ?T1 dbo:description ?T1_description . ?T2 dbo:title ?T2_title . ?T3 dbo:member_short_name ?T3_member_short_name . FILTER(?T2_title != 'Space Robotics Technologies' && ?T3_member_short_name != 'QA') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Retrieve the acronyms of projects having a total cost <= 3107350.0 and an institution with geocode region != \"Miasto Warszawa\"",
    "sql_query": "select distinct projects.acronym from project_members join projects on project_members.project = projects.unics_id join institutions on institutions.unics_id = project_members.institution_id join eu_territorial_units on eu_territorial_units.geocode_regions = institutions.geocode_regions_3 where eu_territorial_units.description != 'Miasto Warszawa' and projects.total_cost <= '3107350'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(20) T(16) C(20) T(16) Filter(0) Filter(3) A(0) Op(0) C(2) T(5) C(2) T(5) V(0) Filter(6) A(0) Op(0) C(55) T(16) C(55) T(16) V(1)",
    "sparql_query": "SELECT DISTINCT ?T1_acronym WHERE { ?T1 a dbo:projects . ?T4 a dbo:project_members . ?T4 dbo:project ?T1 . ?T1 dbo:acronym ?T1_acronym . ?T2 dbo:geocode_regions ?T2_geocode_regions . ?T4 dbo:institution_id ?T4_institution_id . ?T2 dbo:description ?T2_description . ?T1 dbo:total_cost ?T1_total_cost . ?T2 a dbo:eu_territorial_units . ?T4 dbo:geocode_regions_3 ?T2 . ?T1 dbo:acronym ?T1_acronym . ?T2 dbo:geocode_regions ?T2_geocode_regions . ?T4 dbo:institution_id ?T4_institution_id . ?T2 dbo:description ?T2_description . ?T1 dbo:total_cost ?T1_total_cost . ?T3 a dbo:institutions . ?T3 dbo:geocode_regions_3 ?T2 . ?T1 dbo:acronym ?T1_acronym . ?T2 dbo:geocode_regions ?T2_geocode_regions . ?T4 dbo:institution_id ?T4_institution_id . ?T2 dbo:description ?T2_description . ?T1 dbo:total_cost ?T1_total_cost . ?T4 a dbo:project_members . ?T4 dbo:institution_id ?T3 . ?T1 dbo:acronym ?T1_acronym . ?T2 dbo:geocode_regions ?T2_geocode_regions . ?T4 dbo:institution_id ?T4_institution_id . ?T2 dbo:description ?T2_description . ?T1 dbo:total_cost ?T1_total_cost . FILTER(?T2_description != 'Miasto Warszawa' && ?T1_total_cost <= 3107350) . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Count the number of distinct full names of people whose department is \"Faculty of Mechanical Engineering and Naval Architecture\", whose activity type is \"Research Organisations\", and who are principal investigators of a project.",
    "sql_query": "select count(distinct people.full_name) from activity_types join project_members on activity_types.code = project_members.activity_type join projects on project_members.project = projects.unics_id join people on projects.principal_investigator = people.unics_id where activity_types.description = 'Research Organisations' and project_members.department_name = 'Faculty of Mechanical Engineering and Naval Architecture'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(23) T(8) C(23) T(8) Filter(0) Filter(2) A(0) Op(0) C(2) T(0) C(2) T(0) V(0) Filter(2) A(0) Op(0) C(39) T(12) C(39) T(12) V(1)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_full_name) as ?aggregation_T1_full_name_109 ) WHERE { ?T1 a dbo:people . ?T14 a dbo:projects . ?T14 dbo:principal_investigator ?T1 . ?T1 dbo:full_name ?T1_full_name . ?T2 dbo:description ?T2_description . ?T3 dbo:department_name ?T3_department_name . ?T3 a dbo:project_members . ?T3 dbo:project ?T14 . ?T1 dbo:full_name ?T1_full_name . ?T2 dbo:description ?T2_description . ?T3 dbo:department_name ?T3_department_name . ?T2 a dbo:activity_types . ?T3 dbo:activity_type ?T2 . ?T1 dbo:full_name ?T1_full_name . ?T2 dbo:description ?T2_description . ?T3 dbo:department_name ?T3_department_name . FILTER(?T2_description = 'Research Organisations' && ?T3_department_name = 'Faculty of Mechanical Engineering && Naval Architecture') . } "
  }
]