[
  {
    "db_id": "cordis_temporary",
    "question": "Show me subject areas associated with a project starting in 2018",
    "sql_query": "select distinct subject_areas.title from projects join project_subject_areas on projects.unics_id = project_subject_areas.project join subject_areas on project_subject_areas.subject_area = subject_areas.code where projects.start_year = '2018'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(13) T(17) C(13) T(17) Filter(2) A(0) Op(0) C(52) T(16) C(52) T(16) V(0)",
    "sparql_query": "SELECT DISTINCT ?T1_title WHERE { ?T1 a dbo:subject_areas . ?T13 a dbo:project_subject_areas . ?T13 dbo:subject_area ?T1 . ?T1 dbo:title ?T1_title . ?T2 dbo:start_year ?T2_start_year . ?T2 a dbo:projects . ?T13 dbo:project ?T2 . ?T1 dbo:title ?T1_title . ?T2 dbo:start_year ?T2_start_year . FILTER(?T2_start_year = 2018) . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Show me the distinct country names of institutions with name different from \u201cCHECKLIGHT LTD\u201d",
    "sql_query": "select distinct countries.country_name from institutions join countries on institutions.country_id = countries.unics_id where institutions.institutions_name != 'CHECKLIGHT LTD'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(4) T(1) C(4) T(1) Filter(3) A(0) Op(0) C(15) T(7) C(15) T(7) V(0)",
    "sparql_query": "SELECT DISTINCT ?T1_country_name WHERE { ?T1 a dbo:countries . ?T2 a dbo:institutions . ?T2 dbo:country_id ?T1 . ?T1 dbo:country_name ?T1_country_name . ?T2 dbo:institutions_name ?T2_institutions_name . FILTER(?T2_institutions_name != 'CHECKLIGHT LTD') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Show me the average project costs of projects having an institution as project member where the institution acronym is \u201cCED\u201d and the institution\u2019s country name \u201cWallis and Futuna\u201d",
    "sql_query": "select avg(projects.total_cost) from eu_territorial_units join project_members on eu_territorial_units.geocode_regions = project_members.geocode_regions_3 join institutions on institutions.geocode_regions_3 = eu_territorial_units.geocode_regions join countries on countries.unics_id = institutions.country_id join projects on project_members.project = projects.unics_id where countries.country_name = 'Wallis and Futuna' and institutions.acronym = 'CED'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(4) T(1) C(4) T(1) V(0) Filter(2) A(0) Op(0) C(20) T(7) C(20) T(7) V(1)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_143 ) WHERE { ?T1 a dbo:projects . ?T4 a dbo:project_members . ?T4 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T5 dbo:country_name ?T5_country_name . ?T2 dbo:acronym ?T2_acronym . ?T2 a dbo:institutions . ?T4 dbo:institution_id ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T5 dbo:country_name ?T5_country_name . ?T2 dbo:acronym ?T2_acronym . ?T3 a dbo:eu_territorial_units . ?T2 dbo:geocode_regions_3 ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T5 dbo:country_name ?T5_country_name . ?T2 dbo:acronym ?T2_acronym . ?T4 a dbo:project_members . ?T4 dbo:geocode_regions_3 ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T5 dbo:country_name ?T5_country_name . ?T2 dbo:acronym ?T2_acronym . ?T5 a dbo:countries . ?T2 dbo:country_id ?T5 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T5 dbo:country_name ?T5_country_name . ?T2 dbo:acronym ?T2_acronym . FILTER(?T5_country_name = 'Wallis && Futuna' && ?T2_acronym = 'CED') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Find title of all projects that started after 2018",
    "sql_query": "SELECT T1.title FROM projects AS T1 where T1.start_year > 2018",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(0) Op(0) C(13) T(16) C(13) T(16) Filter(5) A(0) Op(0) C(52) T(16) C(52) T(16) V(0)",
    "sparql_query": "SELECT    ?title  WHERE {   ?proj a dbo:EC-Project .      ?proj dbo:title ?title .   ?proj dbo:acronym ?projAcronym .   ?proj dbo:ecObjective ?ecObjective .   ?proj dbo:cordisRef ?cordisRef .   ?proj dbo:ecRef ?ecRef .   ?proj dbo:ecFrameworkProgram ?fp .   ?fp dbo:extendedName ?frameworkProgram .   ?proj dbo:startingYear ?startYear .   FILTER (?startYear > 2018)   optional { ?proj dbo:endYear ?endYear . }   ?proj dbo:totalCost ?totalCost .   ?proj dbo:ecMaxContribution ?ecMaxContribution . }"
  },
  {
    "db_id": "cordis_temporary",
    "question": "How many projects does the Toscana region have?",
    "sql_query": "select count(distinct t1.project) from project_members as t1 where t1.region_name='Toscana'",
    "semql_query": "",
    "sparql_query": ""
  },
  {
    "db_id": "cordis_temporary",
    "question": "How many projects does the region with code ITI1 have?",
    "sql_query": "select count(distinct t1.project) from project_members as t1 where t1.region_code='ITI1'",
    "semql_query": "",
    "sparql_query": ""
  }
]