[
  {
    "db_id": "cordis_temporary",
    "question": "Show all activity type descriptions for project members from city BELGRADE-STARI GRAD?",
    "sql_query": "select distinct activity_types.description from project_members join activity_types on project_members.activity_type = activity_types.code where project_members.city = 'BELGRADE-STARI GRAD')",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(2) T(0) C(2) T(0) Filter(2) A(0) Op(0) C(33) T(12) C(33) T(12) V(0)",
    "sparql_query": "SELECT DISTINCT ?T1_description WHERE { ?T1 a dbo:activity_types . ?T2 a dbo:project_members . ?T2 dbo:activity_type ?T1 . ?T1 dbo:description ?T1_description . ?T2 dbo:city ?T2_city . FILTER(?T2_city = 'BELGRADE-STARI GRAD') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Which are the funding scheme titles of projects that ended before 2010?",
    "sql_query": "select distinct funding_schemes.title from projects join funding_schemes on projects.ec_fund_scheme = funding_schemes.code where projects.end_year < '2010'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(13) T(6) C(13) T(6) Filter(4) A(0) Op(0) C(53) T(16) C(53) T(16) V(0)",
    "sparql_query": "SELECT DISTINCT ?T1_title WHERE { ?T1 a dbo:funding_schemes . ?T2 a dbo:projects . ?T2 dbo:ec_fund_scheme ?T1 . ?T1 dbo:title ?T1_title . ?T2 dbo:end_year ?T2_end_year . FILTER(?T2_end_year < 2010) . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Average cost of all bioful projects after 2009",
    "sql_query": "select avg(projects.total_cost) from subject_areas join project_subject_areas on subject_areas.code = project_subject_areas.subject_area join projects on project_subject_areas.project = projects.unics_id where subject_areas.title = 'Biofuels' and projects.end_year >= '2009'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(13) T(17) C(13) T(17) V(0) Filter(7) A(0) Op(0) C(53) T(16) C(53) T(16) V(1)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_124 ) WHERE { ?T1 a dbo:projects . ?T13 a dbo:project_subject_areas . ?T13 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:title ?T2_title . ?T1 dbo:end_year ?T1_end_year . ?T2 a dbo:subject_areas . ?T13 dbo:subject_area ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:title ?T2_title . ?T1 dbo:end_year ?T1_end_year . FILTER(?T2_title = 'Biofuels' && ?T1_end_year >= 2009) . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "How many descriptions are there for European Research Council panels?",
    "sql_query": "select count(distinct erc_panels.description) from project_erc_panels join erc_panels on project_erc_panels.panel = erc_panels.code ",
    "semql_query": "Root1(3) Root(5) Sel(1) N(0) A(3) Op(0) C(2) T(3) C(2) T(3)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_description) as ?aggregation_T1_description_122 ) WHERE { ?T1 a dbo:erc_panels . ?T2 a dbo:project_erc_panels . ?T2 dbo:panel ?T1 . ?T1 dbo:description ?T1_description . ?T1 dbo:code ?T1_code . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "How many project programmes are there, with projects that start in 2020 and members that are not from Catalu\u00f1a?",
    "sql_query": "select count(distinct programmes.title) from eu_territorial_units join project_members on eu_territorial_units.geocode_regions = project_members.geocode_regions_3 join projects on project_members.project = projects.unics_id join project_programmes on projects.unics_id = project_programmes.project join programmes on project_programmes.programme = programmes.code where eu_territorial_units.description != 'Catalu\u00f1a' and projects.start_year = '2020'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(13) T(9) C(13) T(9) Filter(0) Filter(3) A(0) Op(0) C(2) T(5) C(2) T(5) V(0) Filter(2) A(0) Op(0) C(52) T(16) C(52) T(16) V(1)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_38 ) WHERE { ?T1 a dbo:programmes . ?T14 a dbo:project_programmes . ?T14 dbo:programme ?T1 . ?T1 dbo:title ?T1_title . ?T2 dbo:description ?T2_description . ?T3 dbo:start_year ?T3_start_year . ?T3 a dbo:projects . ?T14 dbo:project ?T3 . ?T1 dbo:title ?T1_title . ?T2 dbo:description ?T2_description . ?T3 dbo:start_year ?T3_start_year . ?T15 a dbo:project_members . ?T15 dbo:project ?T3 . ?T1 dbo:title ?T1_title . ?T2 dbo:description ?T2_description . ?T3 dbo:start_year ?T3_start_year . ?T2 a dbo:eu_territorial_units . ?T15 dbo:geocode_regions_3 ?T2 . ?T1 dbo:title ?T1_title . ?T2 dbo:description ?T2_description . ?T3 dbo:start_year ?T3_start_year . FILTER(?T2_description != 'Catalu\u00f1a' && ?T3_start_year = 2020) . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the average total cost of projects where the principal investigator is Jose Luis Mascare\u00f1as Cid and the acronym is not Survive",
    "sql_query": "select avg(projects.total_cost) from people join projects on people.unics_id = projects.principal_investigator where projects.acronym != 'Survive' and people.full_name = 'Jose Luis Mascare\u00f1as Cid'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(3) A(0) Op(0) C(20) T(16) C(20) T(16) V(0) Filter(2) A(0) Op(0) C(23) T(8) C(23) T(8) V(1)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_71 ) WHERE { ?T1 a dbo:projects . ?T2 a dbo:people . ?T1 dbo:principal_investigator ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T1 dbo:acronym ?T1_acronym . ?T2 dbo:full_name ?T2_full_name . FILTER(?T1_acronym != 'Survive' && ?T2_full_name = 'Jose Luis Mascare\u00f1as Cid') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "From which region is the project member whose short name is Spoon?",
    "sql_query": "select distinct eu_territorial_units.description from project_members join eu_territorial_units on project_members.geocode_regions_3 = eu_territorial_units.geocode_regions where project_members.member_short_name = 'Spoon'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(2) T(5) C(2) T(5) Filter(2) A(0) Op(0) C(38) T(12) C(38) T(12) V(0)",
    "sparql_query": "SELECT DISTINCT ?T1_description WHERE { ?T1 a dbo:eu_territorial_units . ?T2 a dbo:project_members . ?T2 dbo:geocode_regions_3 ?T1 . ?T1 dbo:description ?T1_description . ?T2 dbo:member_short_name ?T2_member_short_name . FILTER(?T2_member_short_name = 'Spoon') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the average total cost of all projects that end in 2013 or earlier and a have a member institution whose acronym is UCBL?",
    "sql_query": "select avg(projects.total_cost) from institutions join eu_territorial_units on institutions.geocode_regions_3 = eu_territorial_units.geocode_regions join project_members on eu_territorial_units.geocode_regions = project_members.geocode_regions_3 join projects on project_members.project = projects.unics_id where institutions.acronym = 'UCBL' and projects.end_year <= '2013'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(20) T(7) C(20) T(7) V(0) Filter(6) A(0) Op(0) C(53) T(16) C(53) T(16) V(1)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_100 ) WHERE { ?T1 a dbo:projects . ?T2 a dbo:project_members . ?T2 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T4 dbo:acronym ?T4_acronym . ?T1 dbo:end_year ?T1_end_year . ?T3 a dbo:eu_territorial_units . ?T2 dbo:geocode_regions_3 ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T4 dbo:acronym ?T4_acronym . ?T1 dbo:end_year ?T1_end_year . ?T4 a dbo:institutions . ?T4 dbo:geocode_regions_3 ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T4 dbo:acronym ?T4_acronym . ?T1 dbo:end_year ?T1_end_year . FILTER(?T4_acronym = 'UCBL' && ?T1_end_year <= 2013) . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "How many people are principal investigators in a project named Transforming the hazardous waste of the metallurgical industry into a valuable raw material, in which a member is from LARNE ANTRIM?",
    "sql_query": "select count(distinct people.full_name) from project_members join projects on project_members.project = projects.unics_id join people on projects.principal_investigator = people.unics_id where project_members.city = 'LARNE ANTRIM' and projects.title = 'Transforming the hazardous waste of the metallurgical industry into a valuable raw material'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(23) T(8) C(23) T(8) Filter(0) Filter(2) A(0) Op(0) C(33) T(12) C(33) T(12) V(0) Filter(2) A(0) Op(0) C(13) T(16) C(13) T(16) V(1)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_full_name) as ?aggregation_T1_full_name_159 ) WHERE { ?T1 a dbo:people . ?T3 a dbo:projects . ?T3 dbo:principal_investigator ?T1 . ?T1 dbo:full_name ?T1_full_name . ?T2 dbo:city ?T2_city . ?T3 dbo:title ?T3_title . ?T2 a dbo:project_members . ?T2 dbo:project ?T3 . ?T1 dbo:full_name ?T1_full_name . ?T2 dbo:city ?T2_city . ?T3 dbo:title ?T3_title . FILTER(?T2_city = 'LARNE ANTRIM' && ?T3_title = 'Transforming the hazardous waste of the metallurgical industry into a valuable raw material') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What are the subject areas of projects that start at 2015-04-27 and do not have an institution with the acronym ENSCP as a member?",
    "sql_query": "select distinct subject_areas.title from institutions join project_members on institutions.unics_id = project_members.institution_id join projects on project_members.project = projects.unics_id join project_subject_areas on projects.unics_id = project_subject_areas.project join subject_areas on project_subject_areas.subject_area = subject_areas.code where institutions.acronym != 'ENSCP' and projects.start_date != '2015-04-27'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(13) T(17) C(13) T(17) Filter(0) Filter(3) A(0) Op(0) C(20) T(7) C(20) T(7) V(0) Filter(3) A(0) Op(0) C(50) T(16) C(50) T(16) V(1)",
    "sparql_query": "SELECT DISTINCT ?T1_title WHERE { ?T1 a dbo:subject_areas . ?T14 a dbo:project_subject_areas . ?T14 dbo:subject_area ?T1 . ?T1 dbo:title ?T1_title . ?T2 dbo:acronym ?T2_acronym . ?T3 dbo:start_date ?T3_start_date . ?T3 a dbo:projects . ?T14 dbo:project ?T3 . ?T1 dbo:title ?T1_title . ?T2 dbo:acronym ?T2_acronym . ?T3 dbo:start_date ?T3_start_date . ?T15 a dbo:project_members . ?T15 dbo:project ?T3 . ?T1 dbo:title ?T1_title . ?T2 dbo:acronym ?T2_acronym . ?T3 dbo:start_date ?T3_start_date . ?T2 a dbo:institutions . ?T15 dbo:institution_id ?T2 . ?T1 dbo:title ?T1_title . ?T2 dbo:acronym ?T2_acronym . ?T3 dbo:start_date ?T3_start_date . FILTER(?T2_acronym != 'ENSCP' && ?T3_start_date != '2015-04-27') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "How many project topics are there?",
    "sql_query": "select count(distinct topics.title) from project_topics join topics on project_topics.topic = topics.code ",
    "semql_query": "Root1(3) Root(5) Sel(1) N(0) A(3) Op(0) C(13) T(18) C(13) T(18)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_22 ) WHERE { ?T1 a dbo:topics . ?T2 a dbo:project_topics . ?T2 dbo:topic ?T1 . ?T1 dbo:title ?T1_title . ?T1 dbo:code ?T1_code . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the average total cost of projects that end at 2020-11-18 and have panel about Immunity and infection?",
    "sql_query": "select avg(projects.total_cost) from erc_panels join project_erc_panels on erc_panels.code = project_erc_panels.panel join projects on project_erc_panels.project = projects.unics_id where erc_panels.description = 'Immunity and infection' and projects.end_date != '2020-11-18'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(2) T(3) C(2) T(3) V(0) Filter(3) A(0) Op(0) C(51) T(16) C(51) T(16) V(1)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_136 ) WHERE { ?T1 a dbo:projects . ?T13 a dbo:project_erc_panels . ?T13 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:description ?T2_description . ?T1 dbo:end_date ?T1_end_date . ?T2 a dbo:erc_panels . ?T13 dbo:panel ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:description ?T2_description . ?T1 dbo:end_date ?T1_end_date . FILTER(?T2_description = 'Immunity && infection' && ?T1_end_date != '2020-11-18') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Show me the average costs of projects which did not start on the 25.06.2012 and had a funding scheme title different than 'Cooperation network contracts'",
    "sql_query": "select avg(projects.total_cost) from funding_schemes join projects on funding_schemes.code = projects.ec_fund_scheme where funding_schemes.title != 'Cooperation network contracts' and projects.start_date != '2012-06-25'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(3) A(0) Op(0) C(13) T(6) C(13) T(6) V(0) Filter(3) A(0) Op(0) C(50) T(16) C(50) T(16) V(1)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_199 ) WHERE { ?T1 a dbo:projects . ?T2 a dbo:funding_schemes . ?T1 dbo:ec_fund_scheme ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:title ?T2_title . ?T1 dbo:start_date ?T1_start_date . FILTER(?T2_title != 'Cooperation network contracts' && ?T1_start_date != '2012-06-25') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Display funding schemes for projects that don't have a member from country Monaco and are titled 'Development of the Cephalochordate amphioxus, Branchiostoma lanceolatum, as a new model for regeneration'",
    "sql_query": "select funding_schemes.title from project_members join projects on project_members.project = projects.unics_id join funding_schemes on projects.ec_fund_scheme = funding_schemes.code where projects.title = 'Development of the Cephalochordate amphioxus, Branchiostoma lanceolatum, as a new model for regeneration' and project_members.country != 'MC')",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(0) Op(0) C(13) T(6) C(13) T(6) Filter(0) Filter(2) A(0) Op(0) C(13) T(16) C(13) T(16) V(0) Filter(3) A(0) Op(0) C(31) T(12) C(31) T(12) V(1)",
    "sparql_query": "SELECT ?T1_title WHERE { ?T1 a dbo:funding_schemes . ?T2 a dbo:projects . ?T2 dbo:ec_fund_scheme ?T1 . ?T1 dbo:title ?T1_title . ?T2 dbo:title ?T2_title . ?T3 dbo:country ?T3_country . ?T3 a dbo:project_members . ?T3 dbo:project ?T2 . ?T1 dbo:title ?T1_title . ?T2 dbo:title ?T2_title . ?T3 dbo:country ?T3_country . FILTER(?T2_title = 'Development of the Cephalochordate amphioxus, Branchiostoma lanceolatum, as a new model for regeneration' && ?T3_country != 'MC') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Display titles of projects with a member from KJERRGARDEN that is also in the same region as an institution from Norway?",
    "sql_query": "select distinct projects.title from countries join institutions on countries.unics_id = institutions.country_id join eu_territorial_units on institutions.geocode_regions_3 = eu_territorial_units.geocode_regions join project_members on eu_territorial_units.geocode_regions = project_members.geocode_regions_3 join projects on project_members.project = projects.unics_id where countries.country_code2 = 'NO' and project_members.city = 'KJERRGARDEN')",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(13) T(16) C(13) T(16) Filter(0) Filter(2) A(0) Op(0) C(5) T(1) C(5) T(1) V(0) Filter(2) A(0) Op(0) C(33) T(12) C(33) T(12) V(1)",
    "sparql_query": "SELECT DISTINCT ?T1_title WHERE { ?T1 a dbo:projects . ?T2 a dbo:project_members . ?T2 dbo:project ?T1 . ?T1 dbo:title ?T1_title . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T5 dbo:country_code2 ?T5_country_code2 . ?T2 dbo:city ?T2_city . ?T3 a dbo:eu_territorial_units . ?T2 dbo:geocode_regions_3 ?T3 . ?T1 dbo:title ?T1_title . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T5 dbo:country_code2 ?T5_country_code2 . ?T2 dbo:city ?T2_city . ?T4 a dbo:institutions . ?T4 dbo:geocode_regions_3 ?T3 . ?T1 dbo:title ?T1_title . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T5 dbo:country_code2 ?T5_country_code2 . ?T2 dbo:city ?T2_city . ?T5 a dbo:countries . ?T4 dbo:country_id ?T5 . ?T1 dbo:title ?T1_title . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T5 dbo:country_code2 ?T5_country_code2 . ?T2 dbo:city ?T2_city . FILTER(?T5_country_code2 = 'NO' && ?T2_city = 'KJERRGARDEN') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "How many different end years are there for projects in the subject area of Safety and a total cost of at least 4731647.5?",
    "sql_query": "select count(distinct projects.end_year) from project_subject_areas join projects on project_subject_areas.project = projects.unics_id join subject_areas on subject_areas.code = project_subject_areas.subject_area where projects.total_cost >= '4731647.5' and subject_areas.title = 'Safety'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(53) T(16) C(53) T(16) Filter(0) Filter(7) A(0) Op(0) C(55) T(16) C(55) T(16) V(0) Filter(2) A(0) Op(0) C(13) T(17) C(13) T(17) V(1)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_end_year) as ?aggregation_T1_end_year_162 ) WHERE { ?T1 a dbo:projects . ?T13 a dbo:project_subject_areas . ?T13 dbo:project ?T1 . ?T1 dbo:end_year ?T1_end_year . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:title ?T2_title . ?T2 a dbo:subject_areas . ?T13 dbo:subject_area ?T2 . ?T1 dbo:end_year ?T1_end_year . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:title ?T2_title . FILTER(?T1_total_cost >= 4731647.5 && ?T2_title = 'Safety') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Show me projects that end in 2010 or later and have a panel about Physiology, Pathophysiology and Endocrinology.",
    "sql_query": "select distinct projects.title from project_erc_panels join projects on project_erc_panels.project = projects.unics_id join erc_panels on erc_panels.code = project_erc_panels.panel where erc_panels.description = 'Physiology, Pathophysiology and Endocrinology' and projects.end_year >= '2010'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(13) T(16) C(13) T(16) Filter(0) Filter(2) A(0) Op(0) C(2) T(3) C(2) T(3) V(0) Filter(7) A(0) Op(0) C(53) T(16) C(53) T(16) V(1)",
    "sparql_query": "SELECT DISTINCT ?T1_title WHERE { ?T1 a dbo:projects . ?T13 a dbo:project_erc_panels . ?T13 dbo:project ?T1 . ?T1 dbo:title ?T1_title . ?T2 dbo:description ?T2_description . ?T1 dbo:end_year ?T1_end_year . ?T2 a dbo:erc_panels . ?T13 dbo:panel ?T2 . ?T1 dbo:title ?T1_title . ?T2 dbo:description ?T2_description . ?T1 dbo:end_year ?T1_end_year . FILTER(?T2_description = 'Physiology, Pathophysiology && Endocrinology' && ?T1_end_year >= 2010) . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Show me the funding schemes for projects that end before 2023",
    "sql_query": "select distinct funding_schemes.title from projects join funding_schemes on projects.ec_fund_scheme = funding_schemes.code where projects.end_year < '2023'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(13) T(6) C(13) T(6) Filter(4) A(0) Op(0) C(53) T(16) C(53) T(16) V(0)",
    "sparql_query": "SELECT DISTINCT ?T1_title WHERE { ?T1 a dbo:funding_schemes . ?T2 a dbo:projects . ?T2 dbo:ec_fund_scheme ?T1 . ?T1 dbo:title ?T1_title . ?T2 dbo:end_year ?T2_end_year . FILTER(?T2_end_year < 2023) . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "How many project members from Jersey are there, in projects whose acronym is not iTractor?",
    "sql_query": "select count(distinct project_members.member_short_name) from projects join project_members on projects.unics_id = project_members.project where projects.acronym != 'iTractor' and project_members.country = 'JE'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(38) T(12) C(38) T(12) Filter(0) Filter(3) A(0) Op(0) C(20) T(16) C(20) T(16) V(0) Filter(2) A(0) Op(0) C(31) T(12) C(31) T(12) V(1)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_member_short_name) as ?aggregation_T1_member_short_name_73 ) WHERE { ?T1 a dbo:project_members . ?T2 a dbo:projects . ?T1 dbo:project ?T2 . ?T1 dbo:member_short_name ?T1_member_short_name . ?T2 dbo:acronym ?T2_acronym . ?T1 dbo:country ?T1_country . FILTER(?T2_acronym != 'iTractor' && ?T1_country = 'JE') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What's the average total cost of projects with a start date of 2015-09-21, who don't have a member with the short name TILLID?",
    "sql_query": "select avg(projects.total_cost) from project_members join projects on project_members.project = projects.unics_id where project_members.member_short_name != 'TILLID' and projects.start_date = '2015-09-21'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(3) A(0) Op(0) C(38) T(12) C(38) T(12) V(0) Filter(2) A(0) Op(0) C(50) T(16) C(50) T(16) V(1)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_103 ) WHERE { ?T1 a dbo:projects . ?T2 a dbo:project_members . ?T2 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:member_short_name ?T2_member_short_name . ?T1 dbo:start_date ?T1_start_date . FILTER(?T2_member_short_name != 'TILLID' && ?T1_start_date = '2015-09-21') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the average total cost of projects ending in 2015 or late, that have a member that is not from SESTO SAN GIOVANNI MILANO and an institution not from United States Virgin Islands?",
    "sql_query": "select avg(projects.total_cost) from countries join institutions on countries.unics_id = institutions.country_id join eu_territorial_units on institutions.geocode_regions_3 = eu_territorial_units.geocode_regions join project_members on eu_territorial_units.geocode_regions = project_members.geocode_regions_3 join projects on project_members.project = projects.unics_id where countries.country_name != 'United States Virgin Islands' and projects.end_year >= '2015' and project_members.city != 'SESTO SAN GIOVANNI MILANO'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(3) A(0) Op(0) C(4) T(1) C(4) T(1) V(0) Filter(0) Filter(7) A(0) Op(0) C(53) T(16) C(53) T(16) V(1) Filter(3) A(0) Op(0) C(33) T(12) C(33) T(12) V(2)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_175 ) WHERE { ?T1 a dbo:projects . ?T2 a dbo:project_members . ?T2 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T5 dbo:country_name ?T5_country_name . ?T1 dbo:end_year ?T1_end_year . ?T2 dbo:city ?T2_city . ?T3 a dbo:eu_territorial_units . ?T2 dbo:geocode_regions_3 ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T5 dbo:country_name ?T5_country_name . ?T1 dbo:end_year ?T1_end_year . ?T2 dbo:city ?T2_city . ?T4 a dbo:institutions . ?T4 dbo:geocode_regions_3 ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T5 dbo:country_name ?T5_country_name . ?T1 dbo:end_year ?T1_end_year . ?T2 dbo:city ?T2_city . ?T5 a dbo:countries . ?T4 dbo:country_id ?T5 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T5 dbo:country_name ?T5_country_name . ?T1 dbo:end_year ?T1_end_year . ?T2 dbo:city ?T2_city . FILTER(?T5_country_name != 'United States Virgin Islands' && ?T1_end_year >= 2015 && ?T2_city != 'SESTO SAN GIOVANNI MILANO') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Get all different subject areas with a project whose acronym is LOWCOST-PBI-HTPEMFC?",
    "sql_query": "select distinct subject_areas.title from projects join project_subject_areas on projects.unics_id = project_subject_areas.project join subject_areas on project_subject_areas.subject_area = subject_areas.code where projects.acronym = 'LOWCOST-PBI-HTPEMFC'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(13) T(17) C(13) T(17) Filter(2) A(0) Op(0) C(20) T(16) C(20) T(16) V(0)",
    "sparql_query": "SELECT DISTINCT ?T1_title WHERE { ?T1 a dbo:subject_areas . ?T13 a dbo:project_subject_areas . ?T13 dbo:subject_area ?T1 . ?T1 dbo:title ?T1_title . ?T2 dbo:acronym ?T2_acronym . ?T2 a dbo:projects . ?T13 dbo:project ?T2 . ?T1 dbo:title ?T1_title . ?T2 dbo:acronym ?T2_acronym . FILTER(?T2_acronym = 'LOWCOST-PBI-HTPEMFC') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What are the country codes of institutions with the short name UTT, that are not in Switzerland?",
    "sql_query": "select distinct countries.country_code2 from institutions join countries on institutions.country_id = countries.unics_id where institutions.short_name = 'UTT' and countries.country_name != 'Switzerland'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(5) T(1) C(5) T(1) Filter(0) Filter(2) A(0) Op(0) C(21) T(7) C(21) T(7) V(0) Filter(3) A(0) Op(0) C(4) T(1) C(4) T(1) V(1)",
    "sparql_query": "SELECT DISTINCT ?T1_country_code2 WHERE { ?T1 a dbo:countries . ?T2 a dbo:institutions . ?T2 dbo:country_id ?T1 . ?T1 dbo:country_code2 ?T1_country_code2 . ?T2 dbo:short_name ?T2_short_name . ?T1 dbo:country_name ?T1_country_name . FILTER(?T2_short_name = 'UTT' && ?T1_country_name != 'Switzerland') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "How many panel descriptions are there?",
    "sql_query": "select count(distinct erc_panels.description) from project_erc_panels join erc_panels on project_erc_panels.panel = erc_panels.code ",
    "semql_query": "Root1(3) Root(5) Sel(1) N(0) A(3) Op(0) C(2) T(3) C(2) T(3)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_description) as ?aggregation_T1_description_83 ) WHERE { ?T1 a dbo:erc_panels . ?T2 a dbo:project_erc_panels . ?T2 dbo:panel ?T1 . ?T1 dbo:description ?T1_description . ?T1 dbo:code ?T1_code . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "How many research domains are there with panels about Neurosciences and neural disorders and projects that end before 2014-11-27?",
    "sql_query": "select count(distinct erc_research_domains.description) from projects join project_erc_panels on projects.unics_id = project_erc_panels.project join erc_panels on project_erc_panels.panel = erc_panels.code join erc_research_domains on erc_panels.part_of = erc_research_domains.code where projects.end_date < '2014-11-27' and erc_panels.description = 'Neurosciences and neural disorders'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(2) T(4) C(2) T(4) Filter(0) Filter(4) A(0) Op(0) C(51) T(16) C(51) T(16) V(0) Filter(2) A(0) Op(0) C(2) T(3) C(2) T(3) V(1)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_description) as ?aggregation_T1_description_180 ) WHERE { ?T1 a dbo:erc_research_domains . ?T3 a dbo:erc_panels . ?T3 dbo:part_of ?T1 . ?T1 dbo:description ?T1_description . ?T2 dbo:end_date ?T2_end_date . ?T3 dbo:description ?T3_description . ?T14 a dbo:project_erc_panels . ?T14 dbo:panel ?T3 . ?T1 dbo:description ?T1_description . ?T2 dbo:end_date ?T2_end_date . ?T3 dbo:description ?T3_description . ?T2 a dbo:projects . ?T14 dbo:project ?T2 . ?T1 dbo:description ?T1_description . ?T2 dbo:end_date ?T2_end_date . ?T3 dbo:description ?T3_description . FILTER(?T2_end_date < '2014-11-27' && ?T3_description = 'Neurosciences && neural disorders') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "How many research domain descriptions are there for panels about Applied life sciences and biotechnology?",
    "sql_query": "select count(distinct erc_research_domains.description) from erc_panels join erc_research_domains on erc_panels.part_of = erc_research_domains.code where erc_panels.description = 'Applied life sciences and biotechnology'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(2) T(4) C(2) T(4) Filter(2) A(0) Op(0) C(2) T(3) C(2) T(3) V(0)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_description) as ?aggregation_T1_description_8 ) WHERE { ?T1 a dbo:erc_research_domains . ?T2 a dbo:erc_panels . ?T2 dbo:part_of ?T1 . ?T1 dbo:description ?T1_description . ?T2 dbo:description ?T2_description . FILTER(?T2_description = 'Applied life sciences && biotechnology') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What are the panel descriptions?",
    "sql_query": "select distinct erc_panels.description from project_erc_panels join erc_panels on project_erc_panels.panel = erc_panels.code ",
    "semql_query": "Root1(3) Root(5) Sel(1) N(0) A(0) Op(0) C(2) T(3) C(2) T(3)",
    "sparql_query": "SELECT DISTINCT ?T1_description WHERE { ?T1 a dbo:erc_panels . ?T2 a dbo:project_erc_panels . ?T2 dbo:panel ?T1 . ?T1 dbo:description ?T1_description . ?T1 dbo:code ?T1_code . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "How many programmes are there in the subject area of Biofuels, with projects that end after 2014-01-14?",
    "sql_query": "select count(distinct programmes.title) from projects join project_programmes on projects.unics_id = project_programmes.project join project_subject_areas on project_subject_areas.project = projects.unics_id join programmes on project_programmes.programme = programmes.code join subject_areas on subject_areas.code = project_subject_areas.subject_area where projects.end_date > '2014-01-14' and subject_areas.title = 'Biofuels'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(13) T(9) C(13) T(9) Filter(0) Filter(5) A(0) Op(0) C(51) T(16) C(51) T(16) V(0) Filter(2) A(0) Op(0) C(13) T(17) C(13) T(17) V(1)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_115 ) WHERE { ?T1 a dbo:programmes . ?T14 a dbo:project_programmes . ?T14 dbo:programme ?T1 . ?T1 dbo:title ?T1_title . ?T2 dbo:end_date ?T2_end_date . ?T3 dbo:title ?T3_title . ?T2 a dbo:projects . ?T14 dbo:project ?T2 . ?T1 dbo:title ?T1_title . ?T2 dbo:end_date ?T2_end_date . ?T3 dbo:title ?T3_title . ?T15 a dbo:project_subject_areas . ?T15 dbo:project ?T2 . ?T1 dbo:title ?T1_title . ?T2 dbo:end_date ?T2_end_date . ?T3 dbo:title ?T3_title . ?T3 a dbo:subject_areas . ?T15 dbo:subject_area ?T3 . ?T1 dbo:title ?T1_title . ?T2 dbo:end_date ?T2_end_date . ?T3 dbo:title ?T3_title . FILTER(?T2_end_date > '2014-01-14' && ?T3_title = 'Biofuels') . } "
  }
]