[
  {
    "db_id": "cordis_temporary",
    "question": "Show all of the european research council panel descriptions from projects that started in 2016",
    "sql_query": "select distinct erc_panels.description from projects join project_erc_panels on projects.unics_id = project_erc_panels.project join erc_panels on project_erc_panels.panel = erc_panels.code where projects.start_year = '2016'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(2) T(3) C(2) T(3) Filter(2) A(0) Op(0) C(52) T(16) C(52) T(16) V(0)",
    "sparql_query": "SELECT DISTINCT ?T1_description WHERE { ?T1 a dbo:erc_panels . ?T13 a dbo:project_erc_panels . ?T13 dbo:panel ?T1 . ?T1 dbo:description ?T1_description . ?T2 dbo:start_year ?T2_start_year . ?T2 a dbo:projects . ?T13 dbo:project ?T2 . ?T1 dbo:description ?T1_description . ?T2 dbo:start_year ?T2_start_year . FILTER(?T2_start_year = 2016) . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "How many people that are principal investigators have worked in projects that started in 2016?",
    "sql_query": "select count(distinct people.full_name) from projects join people on projects.principal_investigator = people.unics_id where projects.start_year = '2016'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(23) T(8) C(23) T(8) Filter(2) A(0) Op(0) C(52) T(16) C(52) T(16) V(0)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_full_name) as ?aggregation_T1_full_name_45 ) WHERE { ?T1 a dbo:people . ?T2 a dbo:projects . ?T2 dbo:principal_investigator ?T1 . ?T1 dbo:full_name ?T1_full_name . ?T2 dbo:start_year ?T2_start_year . FILTER(?T2_start_year = 2016) . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "How many european research council panel descriptions are there for projects that do not have the acronym belenus? ",
    "sql_query": "select count(distinct erc_panels.description) from projects join project_erc_panels on projects.unics_id = project_erc_panels.project join erc_panels on project_erc_panels.panel = erc_panels.code where projects.acronym != 'BELENUS'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(2) T(3) C(2) T(3) Filter(3) A(0) Op(0) C(20) T(16) C(20) T(16) V(0)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_description) as ?aggregation_T1_description_24 ) WHERE { ?T1 a dbo:erc_panels . ?T13 a dbo:project_erc_panels . ?T13 dbo:panel ?T1 . ?T1 dbo:description ?T1_description . ?T2 dbo:acronym ?T2_acronym . ?T2 a dbo:projects . ?T13 dbo:project ?T2 . ?T1 dbo:description ?T1_description . ?T2 dbo:acronym ?T2_acronym . FILTER(?T2_acronym != 'BELENUS') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Total number of person participating in projects, whose funding is lower than  2477105.6 euros, from the European Research Council panel \"The Human Mind and its complexity\" in the domain \"Social Sciences And Humanities\".",
    "sql_query": "select count(distinct people.full_name) from erc_panels join project_erc_panels on erc_panels.code = project_erc_panels.panel join projects on project_erc_panels.project = projects.unics_id join erc_research_domains on erc_research_domains.code = erc_panels.part_of join people on projects.principal_investigator = people.unics_id where erc_research_domains.description = 'Social Sciences And Humanities' and erc_panels.description = 'The Human Mind and its complexity' and projects.total_cost < '2477105.6'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(23) T(8) C(23) T(8) Filter(0) Filter(2) A(0) Op(0) C(2) T(4) C(2) T(4) V(0) Filter(0) Filter(2) A(0) Op(0) C(2) T(3) C(2) T(3) V(1) Filter(4) A(0) Op(0) C(55) T(16) C(55) T(16) V(2)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_full_name) as ?aggregation_T1_full_name_100 ) WHERE { ?T1 a dbo:people . ?T4 a dbo:projects . ?T4 dbo:principal_investigator ?T1 . ?T1 dbo:full_name ?T1_full_name . ?T2 dbo:description ?T2_description . ?T3 dbo:description ?T3_description . ?T4 dbo:total_cost ?T4_total_cost . ?T15 a dbo:project_erc_panels . ?T15 dbo:project ?T4 . ?T1 dbo:full_name ?T1_full_name . ?T2 dbo:description ?T2_description . ?T3 dbo:description ?T3_description . ?T4 dbo:total_cost ?T4_total_cost . ?T3 a dbo:erc_panels . ?T15 dbo:panel ?T3 . ?T1 dbo:full_name ?T1_full_name . ?T2 dbo:description ?T2_description . ?T3 dbo:description ?T3_description . ?T4 dbo:total_cost ?T4_total_cost . ?T2 a dbo:erc_research_domains . ?T3 dbo:part_of ?T2 . ?T1 dbo:full_name ?T1_full_name . ?T2 dbo:description ?T2_description . ?T3 dbo:description ?T3_description . ?T4 dbo:total_cost ?T4_total_cost . FILTER(?T2_description = 'Social Sciences And Humanities' && ?T3_description = 'The Human Mind && its complexity' && ?T4_total_cost < 2477105.6) . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "The descriptions of the European Research Council panels who have funded projects whose starting date is after August 13, 2018. ",
    "sql_query": "select distinct erc_panels.description from project_erc_panels join erc_panels on project_erc_panels.panel = erc_panels.code join projects on projects.unics_id = project_erc_panels.project where projects.start_date >= '2018-08-13'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(2) T(3) C(2) T(3) Filter(7) A(0) Op(0) C(50) T(16) C(50) T(16) V(0)",
    "sparql_query": "SELECT DISTINCT ?T1_description WHERE { ?T1 a dbo:erc_panels . ?T13 a dbo:project_erc_panels . ?T13 dbo:panel ?T1 . ?T1 dbo:description ?T1_description . ?T2 dbo:start_date ?T2_start_date . ?T2 a dbo:projects . ?T13 dbo:project ?T2 . ?T1 dbo:description ?T1_description . ?T2 dbo:start_date ?T2_start_date . FILTER(?T2_start_date >= '2018-08-13') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Added total cost of projects with a member from a Medical Engineering department outside the region of Hildburghausen.",
    "sql_query": "select sum(projects.total_cost) from eu_territorial_units join institutions on eu_territorial_units.geocode_regions = institutions.geocode_regions_3 join project_members on institutions.unics_id = project_members.institution_id join projects on project_members.project = projects.unics_id where eu_territorial_units.description != 'Hildburghausen' and project_members.department_name = 'Medical Engineering'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(4) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(3) A(0) Op(0) C(2) T(5) C(2) T(5) V(0) Filter(2) A(0) Op(0) C(39) T(12) C(39) T(12) V(1)",
    "sparql_query": "SELECT (sum( ?T1_total_cost) as ?aggregation_T1_total_cost_71 ) WHERE { ?T1 a dbo:projects . ?T2 a dbo:project_members . ?T2 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:institution_id ?T2_institution_id . ?T4 dbo:geocode_regions ?T4_geocode_regions . ?T4 dbo:description ?T4_description . ?T2 dbo:department_name ?T2_department_name . ?T3 a dbo:institutions . ?T2 dbo:institution_id ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:institution_id ?T2_institution_id . ?T4 dbo:geocode_regions ?T4_geocode_regions . ?T4 dbo:description ?T4_description . ?T2 dbo:department_name ?T2_department_name . ?T4 a dbo:eu_territorial_units . ?T3 dbo:geocode_regions_3 ?T4 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:institution_id ?T2_institution_id . ?T4 dbo:geocode_regions ?T4_geocode_regions . ?T4 dbo:description ?T4_description . ?T2 dbo:department_name ?T2_department_name . FILTER(?T4_description != 'Hildburghausen' && ?T2_department_name = 'Medical Engineering') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Total number of descriptions of European Union territorial units for all countries except Australia and where the OPENLIGHTCOMM LTD company is based.",
    "sql_query": "select count(distinct eu_territorial_units.description) from institutions join eu_territorial_units on institutions.geocode_regions_3 = eu_territorial_units.geocode_regions join countries on countries.unics_id = institutions.country_id where countries.country_code2 != 'AU' and institutions.institutions_name = 'OPENLIGHTCOMM LTD'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(2) T(5) C(2) T(5) Filter(0) Filter(3) A(0) Op(0) C(5) T(1) C(5) T(1) V(0) Filter(2) A(0) Op(0) C(15) T(7) C(15) T(7) V(1)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_description) as ?aggregation_T1_description_93 ) WHERE { ?T1 a dbo:eu_territorial_units . ?T3 a dbo:institutions . ?T3 dbo:geocode_regions_3 ?T1 . ?T1 dbo:description ?T1_description . ?T2 dbo:country_code2 ?T2_country_code2 . ?T3 dbo:institutions_name ?T3_institutions_name . ?T2 a dbo:countries . ?T3 dbo:country_id ?T2 . ?T1 dbo:description ?T1_description . ?T2 dbo:country_code2 ?T2_country_code2 . ?T3 dbo:institutions_name ?T3_institutions_name . FILTER(?T2_country_code2 != 'AU' && ?T3_institutions_name = 'OPENLIGHTCOMM LTD') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Total number of person from the INACEINOX - INDUSTRIA DE EQUIPAMENTOS INOXIDAVEIS SA company in the Svalbard and Jan Mayen country, and who participated in project as principal investigator for the Servizio ricerca USI department.",
    "sql_query": "select count(distinct people.full_name) from countries join institutions on countries.unics_id = institutions.country_id join project_members on institutions.unics_id = project_members.institution_id join projects on project_members.project = projects.unics_id join people on projects.principal_investigator = people.unics_id where institutions.institutions_name = 'INACEINOX - INDUSTRIA DE EQUIPAMENTOS INOXIDAVEIS SA' and countries.country_name = 'Svalbard and Jan Mayen' and project_members.department_name != 'Servizio ricerca USI'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(23) T(8) C(23) T(8) Filter(0) Filter(2) A(0) Op(0) C(15) T(7) C(15) T(7) V(0) Filter(0) Filter(2) A(0) Op(0) C(4) T(1) C(4) T(1) V(1) Filter(3) A(0) Op(0) C(39) T(12) C(39) T(12) V(2)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_full_name) as ?aggregation_T1_full_name_61 ) WHERE { ?T1 a dbo:people . ?T15 a dbo:projects . ?T15 dbo:principal_investigator ?T1 . ?T1 dbo:full_name ?T1_full_name . ?T2 dbo:institutions_name ?T2_institutions_name . ?T3 dbo:country_name ?T3_country_name . ?T4 dbo:department_name ?T4_department_name . ?T4 a dbo:project_members . ?T4 dbo:project ?T15 . ?T1 dbo:full_name ?T1_full_name . ?T2 dbo:institutions_name ?T2_institutions_name . ?T3 dbo:country_name ?T3_country_name . ?T4 dbo:department_name ?T4_department_name . ?T2 a dbo:institutions . ?T4 dbo:institution_id ?T2 . ?T1 dbo:full_name ?T1_full_name . ?T2 dbo:institutions_name ?T2_institutions_name . ?T3 dbo:country_name ?T3_country_name . ?T4 dbo:department_name ?T4_department_name . ?T3 a dbo:countries . ?T2 dbo:country_id ?T3 . ?T1 dbo:full_name ?T1_full_name . ?T2 dbo:institutions_name ?T2_institutions_name . ?T3 dbo:country_name ?T3_country_name . ?T4 dbo:department_name ?T4_department_name . FILTER(?T2_institutions_name = 'INACEINOX - INDUSTRIA DE EQUIPAMENTOS INOXIDAVEIS SA' && ?T3_country_name = 'Svalbard && Jan Mayen' && ?T4_department_name != 'Servizio ricerca USI') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Total number of names of countries not containing Salzburg und Umgebung as territorial unit and where the DAACRO GMBH & CO KG company is placed.",
    "sql_query": "select count(distinct countries.country_name) from project_members join institutions on project_members.institution_id = institutions.unics_id join countries on institutions.country_id = countries.unics_id join eu_territorial_units on eu_territorial_units.geocode_regions = project_members.geocode_regions_3 where eu_territorial_units.description != 'Salzburg und Umgebung' and institutions.institutions_name = 'DAACRO GMBH & CO KG'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(4) T(1) C(4) T(1) Filter(0) Filter(3) A(0) Op(0) C(2) T(5) C(2) T(5) V(0) Filter(2) A(0) Op(0) C(15) T(7) C(15) T(7) V(1)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_country_name) as ?aggregation_T1_country_name_102 ) WHERE { ?T1 a dbo:countries . ?T4 a dbo:institutions . ?T4 dbo:country_id ?T1 . ?T1 dbo:country_name ?T1_country_name . ?T2 dbo:geocode_regions ?T2_geocode_regions . ?T4 dbo:unics_id ?T4_unics_id . ?T2 dbo:description ?T2_description . ?T4 dbo:institutions_name ?T4_institutions_name . ?T2 a dbo:eu_territorial_units . ?T4 dbo:geocode_regions_3 ?T2 . ?T1 dbo:country_name ?T1_country_name . ?T2 dbo:geocode_regions ?T2_geocode_regions . ?T4 dbo:unics_id ?T4_unics_id . ?T2 dbo:description ?T2_description . ?T4 dbo:institutions_name ?T4_institutions_name . ?T3 a dbo:project_members . ?T3 dbo:geocode_regions_3 ?T2 . ?T1 dbo:country_name ?T1_country_name . ?T2 dbo:geocode_regions ?T2_geocode_regions . ?T4 dbo:unics_id ?T4_unics_id . ?T2 dbo:description ?T2_description . ?T4 dbo:institutions_name ?T4_institutions_name . ?T4 a dbo:institutions . ?T3 dbo:institution_id ?T4 . ?T1 dbo:country_name ?T1_country_name . ?T2 dbo:geocode_regions ?T2_geocode_regions . ?T4 dbo:unics_id ?T4_unics_id . ?T2 dbo:description ?T2_description . ?T4 dbo:institutions_name ?T4_institutions_name . FILTER(?T2_description != 'Salzburg und Umgebung' && ?T4_institutions_name = 'DAACRO GMBH & CO KG') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Show me all subject areas of projects whose starting date is after January 15, 2016.",
    "sql_query": "select distinct subject_areas.title from projects join project_subject_areas on projects.unics_id = project_subject_areas.project join subject_areas on project_subject_areas.subject_area = subject_areas.code where projects.start_date >= '2016-01-15'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(13) T(17) C(13) T(17) Filter(7) A(0) Op(0) C(50) T(16) C(50) T(16) V(0)",
    "sparql_query": "SELECT DISTINCT ?T1_title WHERE { ?T1 a dbo:subject_areas . ?T13 a dbo:project_subject_areas . ?T13 dbo:subject_area ?T1 . ?T1 dbo:title ?T1_title . ?T2 dbo:start_date ?T2_start_date . ?T2 a dbo:projects . ?T13 dbo:project ?T2 . ?T1 dbo:title ?T1_title . ?T2 dbo:start_date ?T2_start_date . FILTER(?T2_start_date >= '2016-01-15') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "The activity types of project members, which are not placed in the city of ST ASAPH.",
    "sql_query": "select distinct activity_types.description from project_members join activity_types on project_members.activity_type = activity_types.code where project_members.city != 'ST ASAPH'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(2) T(0) C(2) T(0) Filter(3) A(0) Op(0) C(33) T(12) C(33) T(12) V(0)",
    "sparql_query": "SELECT DISTINCT ?T1_description WHERE { ?T1 a dbo:activity_types . ?T2 a dbo:project_members . ?T2 dbo:activity_type ?T1 . ?T1 dbo:description ?T1_description . ?T2 dbo:city ?T2_city . FILTER(?T2_city != 'ST ASAPH') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "The average funding of projects having the General Secretariat as a member and whose end date is not the March 10, 2018.",
    "sql_query": "select avg(projects.total_cost) from project_members join projects on project_members.project = projects.unics_id where projects.end_date != '2018-03-10' and project_members.department_name = 'General Secretariat'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(3) A(0) Op(0) C(51) T(16) C(51) T(16) V(0) Filter(2) A(0) Op(0) C(39) T(12) C(39) T(12) V(1)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_132 ) WHERE { ?T1 a dbo:projects . ?T2 a dbo:project_members . ?T2 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T1 dbo:end_date ?T1_end_date . ?T2 dbo:department_name ?T2_department_name . FILTER(?T1_end_date != '2018-03-10' && ?T2_department_name = 'General Secretariat') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "The average funding of projects having the General Secretariat as a member and whose end date is not the March 10, 2018.",
    "sql_query": "select avg(projects.total_cost) from project_members join projects on project_members.project = projects.unics_id where projects.end_date != '2018-03-10' and project_members.department_name = 'General Secretariat'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(3) A(0) Op(0) C(51) T(16) C(51) T(16) V(0) Filter(2) A(0) Op(0) C(39) T(12) C(39) T(12) V(1)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_176 ) WHERE { ?T1 a dbo:projects . ?T2 a dbo:project_members . ?T2 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T1 dbo:end_date ?T1_end_date . ?T2 dbo:department_name ?T2_department_name . FILTER(?T1_end_date != '2018-03-10' && ?T2_department_name = 'General Secretariat') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "The average funding of projects in which no institution called ICN2 is a member, whose title is \"Modernisation of Vessels for Inland waterway freight Transport\", and in which the Large Systems Business Unit department participates..",
    "sql_query": "select avg(projects.total_cost) from institutions join project_members on institutions.unics_id = project_members.institution_id join projects on project_members.project = projects.unics_id where institutions.acronym != 'ICN2' and projects.title = 'Modernisation of Vessels for Inland waterway freight Transport' and project_members.department_name = 'Large Systems Business Unit'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(3) A(0) Op(0) C(20) T(7) C(20) T(7) V(0) Filter(0) Filter(2) A(0) Op(0) C(13) T(16) C(13) T(16) V(1) Filter(2) A(0) Op(0) C(39) T(12) C(39) T(12) V(2)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_159 ) WHERE { ?T1 a dbo:projects . ?T3 a dbo:project_members . ?T3 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:acronym ?T2_acronym . ?T1 dbo:title ?T1_title . ?T3 dbo:department_name ?T3_department_name . ?T2 a dbo:institutions . ?T3 dbo:institution_id ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:acronym ?T2_acronym . ?T1 dbo:title ?T1_title . ?T3 dbo:department_name ?T3_department_name . FILTER(?T2_acronym != 'ICN2' && ?T1_title = 'Modernisation of Vessels for Inland waterway freight Transport' && ?T3_department_name = 'Large Systems Business Unit') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the average cost for the project called \"ALFRED\" having principal investigator Luigi Naldini?",
    "sql_query": "select avg(projects.total_cost) from people join projects on people.unics_id = projects.principal_investigator where projects.title = 'ALFRED - Personal Interactive Assistant for Independent Living and Active Ageing' and people.full_name = 'Luigi Naldini'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(13) T(16) C(13) T(16) V(0) Filter(2) A(0) Op(0) C(23) T(8) C(23) T(8) V(1)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_127 ) WHERE { ?T1 a dbo:projects . ?T2 a dbo:people . ?T1 dbo:principal_investigator ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T1 dbo:title ?T1_title . ?T2 dbo:full_name ?T2_full_name . FILTER(?T1_title = 'ALFRED - Personal Interactive Assistant for Independent Living && Active Ageing' && ?T2_full_name = 'Luigi Naldini') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the average total cost for project in automation subject area started before 2018?",
    "sql_query": "select avg(projects.total_cost) from subject_areas join project_subject_areas on subject_areas.code = project_subject_areas.subject_area join projects on project_subject_areas.project = projects.unics_id where projects.start_year < '2018' and subject_areas.title = 'Automation'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(4) A(0) Op(0) C(52) T(16) C(52) T(16) V(0) Filter(2) A(0) Op(0) C(13) T(17) C(13) T(17) V(1)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_14 ) WHERE { ?T1 a dbo:projects . ?T13 a dbo:project_subject_areas . ?T13 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T1 dbo:start_year ?T1_start_year . ?T2 dbo:title ?T2_title . ?T2 a dbo:subject_areas . ?T13 dbo:subject_area ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T1 dbo:start_year ?T1_start_year . ?T2 dbo:title ?T2_title . FILTER(?T1_start_year < 2018 && ?T2_title = 'Automation') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "How many are the topics for projects which have a total cost less than 1337480.94?",
    "sql_query": "select count(distinct topics.title) from projects join project_topics on projects.unics_id = project_topics.project join topics on project_topics.topic = topics.code where projects.total_cost < '1337480.94'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(13) T(18) C(13) T(18) Filter(4) A(0) Op(0) C(55) T(16) C(55) T(16) V(0)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_95 ) WHERE { ?T1 a dbo:topics . ?T13 a dbo:project_topics . ?T13 dbo:topic ?T1 . ?T1 dbo:title ?T1_title . ?T2 dbo:total_cost ?T2_total_cost . ?T2 a dbo:projects . ?T13 dbo:project ?T2 . ?T1 dbo:title ?T1_title . ?T2 dbo:total_cost ?T2_total_cost . FILTER(?T2_total_cost < 1337480.94) . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the average cost for the project with members Optim regarding all projects except the project BILINGUALPLAS?",
    "sql_query": "select avg(projects.total_cost) from project_members join projects on project_members.project = projects.unics_id where project_members.member_short_name = 'Optim' and projects.acronym != 'BILINGUALPLAS'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(38) T(12) C(38) T(12) V(0) Filter(3) A(0) Op(0) C(20) T(16) C(20) T(16) V(1)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_185 ) WHERE { ?T1 a dbo:projects . ?T2 a dbo:project_members . ?T2 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:member_short_name ?T2_member_short_name . ?T1 dbo:acronym ?T1_acronym . FILTER(?T2_member_short_name = 'Optim' && ?T1_acronym != 'BILINGUALPLAS') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the average total score for projects which involve the partecipant EXELIS in a region different than La Gomera?",
    "sql_query": "select avg(projects.total_cost) from eu_territorial_units join institutions on eu_territorial_units.geocode_regions = institutions.geocode_regions_3 join project_members on institutions.unics_id = project_members.institution_id join projects on project_members.project = projects.unics_id where eu_territorial_units.description != 'La Gomera' and project_members.member_short_name = 'EXELIXIS'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(3) A(0) Op(0) C(2) T(5) C(2) T(5) V(0) Filter(2) A(0) Op(0) C(38) T(12) C(38) T(12) V(1)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_130 ) WHERE { ?T1 a dbo:projects . ?T2 a dbo:project_members . ?T2 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:institution_id ?T2_institution_id . ?T4 dbo:geocode_regions ?T4_geocode_regions . ?T4 dbo:description ?T4_description . ?T2 dbo:member_short_name ?T2_member_short_name . ?T3 a dbo:institutions . ?T2 dbo:institution_id ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:institution_id ?T2_institution_id . ?T4 dbo:geocode_regions ?T4_geocode_regions . ?T4 dbo:description ?T4_description . ?T2 dbo:member_short_name ?T2_member_short_name . ?T4 a dbo:eu_territorial_units . ?T3 dbo:geocode_regions_3 ?T4 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:institution_id ?T2_institution_id . ?T4 dbo:geocode_regions ?T4_geocode_regions . ?T4 dbo:description ?T4_description . ?T2 dbo:member_short_name ?T2_member_short_name . FILTER(?T4_description != 'La Gomera' && ?T2_member_short_name = 'EXELIXIS') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "How many are the projects started in Caserta in the QUANTUM ENGINEERING DEPARTMENT started after the 2015?",
    "sql_query": "select count(distinct funding_schemes.title) from eu_territorial_units join institutions on eu_territorial_units.geocode_regions = institutions.geocode_regions_3 join project_members on institutions.unics_id = project_members.institution_id join projects on project_members.project = projects.unics_id join funding_schemes on projects.ec_fund_scheme = funding_schemes.code where eu_territorial_units.description = 'Caserta' and projects.start_year > '2015' and project_members.department_name = 'QUANTUM ENGINEERING DEPARTMENT'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(13) T(6) C(13) T(6) Filter(0) Filter(2) A(0) Op(0) C(2) T(5) C(2) T(5) V(0) Filter(0) Filter(5) A(0) Op(0) C(52) T(16) C(52) T(16) V(1) Filter(2) A(0) Op(0) C(39) T(12) C(39) T(12) V(2)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_104 ) WHERE { ?T1 a dbo:funding_schemes . ?T5 a dbo:projects . ?T5 dbo:ec_fund_scheme ?T1 . ?T1 dbo:title ?T1_title . ?T2 dbo:institution_id ?T2_institution_id . ?T4 dbo:geocode_regions ?T4_geocode_regions . ?T4 dbo:description ?T4_description . ?T5 dbo:start_year ?T5_start_year . ?T2 dbo:department_name ?T2_department_name . ?T2 a dbo:project_members . ?T2 dbo:project ?T5 . ?T1 dbo:title ?T1_title . ?T2 dbo:institution_id ?T2_institution_id . ?T4 dbo:geocode_regions ?T4_geocode_regions . ?T4 dbo:description ?T4_description . ?T5 dbo:start_year ?T5_start_year . ?T2 dbo:department_name ?T2_department_name . ?T3 a dbo:institutions . ?T2 dbo:institution_id ?T3 . ?T1 dbo:title ?T1_title . ?T2 dbo:institution_id ?T2_institution_id . ?T4 dbo:geocode_regions ?T4_geocode_regions . ?T4 dbo:description ?T4_description . ?T5 dbo:start_year ?T5_start_year . ?T2 dbo:department_name ?T2_department_name . ?T4 a dbo:eu_territorial_units . ?T3 dbo:geocode_regions_3 ?T4 . ?T1 dbo:title ?T1_title . ?T2 dbo:institution_id ?T2_institution_id . ?T4 dbo:geocode_regions ?T4_geocode_regions . ?T4 dbo:description ?T4_description . ?T5 dbo:start_year ?T5_start_year . ?T2 dbo:department_name ?T2_department_name . ?T2 a dbo:project_members . ?T2 dbo:geocode_regions_3 ?T4 . ?T1 dbo:title ?T1_title . ?T2 dbo:institution_id ?T2_institution_id . ?T4 dbo:geocode_regions ?T4_geocode_regions . ?T4 dbo:description ?T4_description . ?T5 dbo:start_year ?T5_start_year . ?T2 dbo:department_name ?T2_department_name . FILTER(?T4_description = 'Caserta' && ?T5_start_year > 2015 && ?T2_department_name = 'QUANTUM ENGINEERING DEPARTMENT') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Show the subject areas of all the projects different than MYPACK",
    "sql_query": "select distinct subject_areas.title from projects join project_subject_areas on projects.unics_id = project_subject_areas.project join subject_areas on project_subject_areas.subject_area = subject_areas.code where projects.acronym != 'MYPACK'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(13) T(17) C(13) T(17) Filter(3) A(0) Op(0) C(20) T(16) C(20) T(16) V(0)",
    "sparql_query": "SELECT DISTINCT ?T1_title WHERE { ?T1 a dbo:subject_areas . ?T13 a dbo:project_subject_areas . ?T13 dbo:subject_area ?T1 . ?T1 dbo:title ?T1_title . ?T2 dbo:acronym ?T2_acronym . ?T2 a dbo:projects . ?T13 dbo:project ?T2 . ?T1 dbo:title ?T1_title . ?T2 dbo:acronym ?T2_acronym . FILTER(?T2_acronym != 'MYPACK') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "How many are the funding schemes for projects in Libia for the institution JASZ-NAGYKUN-SZOLNOK MEGYE ESELY SZOCIALIS KOZALAPITVANYA?",
    "sql_query": "select count(distinct funding_schemes.title) from countries join institutions on countries.unics_id = institutions.country_id join project_members on institutions.unics_id = project_members.institution_id join projects on project_members.project = projects.unics_id join funding_schemes on projects.ec_fund_scheme = funding_schemes.code where institutions.institutions_name = 'JASZ-NAGYKUN-SZOLNOK MEGYE ESELY SZOCIALIS KOZALAPITVANYA' and countries.country_name = 'Libya'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(13) T(6) C(13) T(6) Filter(0) Filter(2) A(0) Op(0) C(15) T(7) C(15) T(7) V(0) Filter(2) A(0) Op(0) C(4) T(1) C(4) T(1) V(1)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_87 ) WHERE { ?T1 a dbo:funding_schemes . ?T14 a dbo:projects . ?T14 dbo:ec_fund_scheme ?T1 . ?T1 dbo:title ?T1_title . ?T2 dbo:institutions_name ?T2_institutions_name . ?T3 dbo:country_name ?T3_country_name . ?T15 a dbo:project_members . ?T15 dbo:project ?T14 . ?T1 dbo:title ?T1_title . ?T2 dbo:institutions_name ?T2_institutions_name . ?T3 dbo:country_name ?T3_country_name . ?T2 a dbo:institutions . ?T15 dbo:institution_id ?T2 . ?T1 dbo:title ?T1_title . ?T2 dbo:institutions_name ?T2_institutions_name . ?T3 dbo:country_name ?T3_country_name . ?T3 a dbo:countries . ?T2 dbo:country_id ?T3 . ?T1 dbo:title ?T1_title . ?T2 dbo:institutions_name ?T2_institutions_name . ?T3 dbo:country_name ?T3_country_name . FILTER(?T2_institutions_name = 'JASZ-NAGYKUN-SZOLNOK MEGYE ESELY SZOCIALIS KOZALAPITVANYA' && ?T3_country_name = 'Libya') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the averange cost for the projects which have partecipant called ACIF-CCIM excluding the institution APSIE S.A?",
    "sql_query": "select avg(projects.total_cost) from project_members join projects on project_members.project = projects.unics_id join institutions on institutions.unics_id = project_members.institution_id where project_members.member_short_name = 'ACIF - CCIM' and institutions.institutions_name != 'APSIDE S.A'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(38) T(12) C(38) T(12) V(0) Filter(3) A(0) Op(0) C(15) T(7) C(15) T(7) V(1)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_117 ) WHERE { ?T1 a dbo:projects . ?T2 a dbo:project_members . ?T2 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:member_short_name ?T2_member_short_name . ?T3 dbo:institutions_name ?T3_institutions_name . ?T3 a dbo:institutions . ?T2 dbo:institution_id ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:member_short_name ?T2_member_short_name . ?T3 dbo:institutions_name ?T3_institutions_name . FILTER(?T2_member_short_name = 'ACIF - CCIM' && ?T3_institutions_name != 'APSIDE S.A') . } "
  }
]