[
  {
    "db_id": "cordis_temporary",
    "question": "Count the short names of institutions having name \"MOBYDOC SAS\" of people working for projects whose end year is < 2022.",
    "sql_query": "select count(distinct institutions.short_name) from projects join project_members on projects.unics_id = project_members.project join eu_territorial_units on project_members.geocode_regions_3 = eu_territorial_units.geocode_regions join institutions on eu_territorial_units.geocode_regions = institutions.geocode_regions_3 where projects.end_year < '2022' and institutions.institutions_name = 'MOBYDOC SAS'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(21) T(7) C(21) T(7) Filter(0) Filter(4) A(0) Op(0) C(53) T(16) C(53) T(16) V(0) Filter(2) A(0) Op(0) C(15) T(7) C(15) T(7) V(1)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_short_name) as ?aggregation_T1_short_name_90 ) WHERE { ?T1 a dbo:institutions . ?T2 a dbo:eu_territorial_units . ?T1 dbo:geocode_regions_3 ?T2 . ?T1 dbo:short_name ?T1_short_name . ?T1 dbo:geocode_regions_3 ?T1_geocode_regions_3 . ?T3 dbo:geocode_regions_3 ?T3_geocode_regions_3 . ?T4 dbo:end_year ?T4_end_year . ?T1 dbo:institutions_name ?T1_institutions_name . ?T3 a dbo:project_members . ?T3 dbo:geocode_regions_3 ?T2 . ?T1 dbo:short_name ?T1_short_name . ?T1 dbo:geocode_regions_3 ?T1_geocode_regions_3 . ?T3 dbo:geocode_regions_3 ?T3_geocode_regions_3 . ?T4 dbo:end_year ?T4_end_year . ?T1 dbo:institutions_name ?T1_institutions_name . ?T4 a dbo:projects . ?T3 dbo:project ?T4 . ?T1 dbo:short_name ?T1_short_name . ?T1 dbo:geocode_regions_3 ?T1_geocode_regions_3 . ?T3 dbo:geocode_regions_3 ?T3_geocode_regions_3 . ?T4 dbo:end_year ?T4_end_year . ?T1 dbo:institutions_name ?T1_institutions_name . FILTER(?T4_end_year < 2022 && ?T1_institutions_name = 'MOBYDOC SAS') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Retrieve the average total cost of projects not having among their topics titles \"Ethical/Societal Dimension topic 1: Improving protection of Critical infrastructures from insider threats\" and whose end_date is >= 2020-06-10",
    "sql_query": "select avg(projects.total_cost) from project_topics join projects on project_topics.project = projects.unics_id join topics on topics.code = project_topics.topic where projects.end_date >= '2020-06-10' and topics.title != 'Ethical/Societal Dimension topic 1: Improving protection of Critical infrastructures from insider threats'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(7) A(0) Op(0) C(51) T(16) C(51) T(16) V(0) Filter(3) A(0) Op(0) C(13) T(18) C(13) T(18) V(1)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_158 ) WHERE { ?T1 a dbo:projects . ?T13 a dbo:project_topics . ?T13 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T1 dbo:end_date ?T1_end_date . ?T2 dbo:title ?T2_title . ?T2 a dbo:topics . ?T13 dbo:topic ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T1 dbo:end_date ?T1_end_date . ?T2 dbo:title ?T2_title . FILTER(?T1_end_date >= '2020-06-10' && ?T2_title != 'Ethical/Societal Dimension topic 1: Improving protection of Critical infrastructures from insider threats') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Retrieve the descriptions of ERC research domains relative to ERC panels with description \"Physiology, Pathophysiology and Endocrinology\"",
    "sql_query": "select distinct erc_research_domains.description from erc_panels join erc_research_domains on erc_panels.part_of = erc_research_domains.code where erc_panels.description = 'Physiology, Pathophysiology and Endocrinology'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(2) T(4) C(2) T(4) Filter(2) A(0) Op(0) C(2) T(3) C(2) T(3) V(0)",
    "sparql_query": "SELECT DISTINCT ?T1_description WHERE { ?T1 a dbo:erc_research_domains . ?T2 a dbo:erc_panels . ?T2 dbo:part_of ?T1 . ?T1 dbo:description ?T1_description . ?T2 dbo:description ?T2_description . FILTER(?T2_description = 'Physiology, Pathophysiology && Endocrinology') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Compute the average total cost for projects whose relative ERC panel description equals to \"Computer Science and Informatics\" nad whose arconym equals \"MARBIGEN\"",
    "sql_query": "select avg(projects.total_cost) from erc_panels join project_erc_panels on erc_panels.code = project_erc_panels.panel join projects on project_erc_panels.project = projects.unics_id where erc_panels.description = 'Computer science and informatics' and projects.acronym = 'MARBIGEN'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(2) T(3) C(2) T(3) V(0) Filter(2) A(0) Op(0) C(20) T(16) C(20) T(16) V(1)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_111 ) WHERE { ?T1 a dbo:projects . ?T13 a dbo:project_erc_panels . ?T13 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:description ?T2_description . ?T1 dbo:acronym ?T1_acronym . ?T2 a dbo:erc_panels . ?T13 dbo:panel ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:description ?T2_description . ?T1 dbo:acronym ?T1_acronym . FILTER(?T2_description = 'Computer science && informatics' && ?T1_acronym = 'MARBIGEN') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Retrieve the sum of total costs for projects having at least one member whose geocode region is \"Napoli\" and whose institution country is \"Antarctica\".",
    "sql_query": "select sum(projects.total_cost) from countries join institutions on countries.unics_id = institutions.country_id join eu_territorial_units on institutions.geocode_regions_3 = eu_territorial_units.geocode_regions join project_members on eu_territorial_units.geocode_regions = project_members.geocode_regions_3 join projects on project_members.project = projects.unics_id where countries.country_name = 'Antarctica' and eu_territorial_units.description = 'Napoli'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(4) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(4) T(1) C(4) T(1) V(0) Filter(2) A(0) Op(0) C(2) T(5) C(2) T(5) V(1)",
    "sparql_query": "SELECT (sum( ?T1_total_cost) as ?aggregation_T1_total_cost_120 ) WHERE { ?T1 a dbo:projects . ?T14 a dbo:project_members . ?T14 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:country_name ?T2_country_name . ?T3 dbo:description ?T3_description . ?T15 a dbo:institutions . ?T14 dbo:institution_id ?T15 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:country_name ?T2_country_name . ?T3 dbo:description ?T3_description . ?T2 a dbo:countries . ?T15 dbo:country_id ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:country_name ?T2_country_name . ?T3 dbo:description ?T3_description . ?T3 a dbo:eu_territorial_units . ?T15 dbo:geocode_regions_3 ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:country_name ?T2_country_name . ?T3 dbo:description ?T3_description . FILTER(?T2_country_name = 'Antarctica' && ?T3_description = 'Napoli') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Compute the sum of total  costs for projects ending after 2019 and whose ERC panel description is \"Evolutionary, population and environmental biology\"",
    "sql_query": "select sum(projects.total_cost) from erc_panels join project_erc_panels on erc_panels.code = project_erc_panels.panel join projects on project_erc_panels.project = projects.unics_id where erc_panels.description = 'Evolutionary, population and environmental biology' and projects.end_year > '2019'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(4) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(2) T(3) C(2) T(3) V(0) Filter(5) A(0) Op(0) C(53) T(16) C(53) T(16) V(1)",
    "sparql_query": "SELECT (sum( ?T1_total_cost) as ?aggregation_T1_total_cost_70 ) WHERE { ?T1 a dbo:projects . ?T13 a dbo:project_erc_panels . ?T13 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:description ?T2_description . ?T1 dbo:end_year ?T1_end_year . ?T2 a dbo:erc_panels . ?T13 dbo:panel ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:description ?T2_description . ?T1 dbo:end_year ?T1_end_year . FILTER(?T2_description = 'Evolutionary, population && environmental biology' && ?T1_end_year > 2019) . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Compute the sum of the total costs fo projects whose both institutions and institutions members are in the country \"Falkland Islands\", and whose institutions have acronym \"UPDV\".",
    "sql_query": "select sum(projects.total_cost) from institutions join eu_territorial_units on institutions.geocode_regions_3 = eu_territorial_units.geocode_regions join countries on countries.unics_id = institutions.country_id join project_members on eu_territorial_units.geocode_regions = project_members.geocode_regions_3 join projects on project_members.project = projects.unics_id where countries.country_name = 'Falkland Islands' and institutions.acronym = 'UPVD'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(4) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(4) T(1) C(4) T(1) V(0) Filter(2) A(0) Op(0) C(20) T(7) C(20) T(7) V(1)",
    "sparql_query": "SELECT (sum( ?T1_total_cost) as ?aggregation_T1_total_cost_123 ) WHERE { ?T1 a dbo:projects . ?T2 a dbo:project_members . ?T2 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T5 dbo:country_name ?T5_country_name . ?T4 dbo:acronym ?T4_acronym . ?T3 a dbo:eu_territorial_units . ?T2 dbo:geocode_regions_3 ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T5 dbo:country_name ?T5_country_name . ?T4 dbo:acronym ?T4_acronym . ?T4 a dbo:institutions . ?T4 dbo:geocode_regions_3 ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T5 dbo:country_name ?T5_country_name . ?T4 dbo:acronym ?T4_acronym . ?T5 a dbo:countries . ?T4 dbo:country_id ?T5 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T5 dbo:country_name ?T5_country_name . ?T4 dbo:acronym ?T4_acronym . FILTER(?T5_country_name = 'Falkland Islands' && ?T4_acronym = 'UPVD') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Retrieve the sum of total costs of projects whose institutions are in \"Zollernalbkreis\" and institutions acronyms are != \"INSA\"",
    "sql_query": "select sum(projects.total_cost) from eu_territorial_units join project_members on eu_territorial_units.geocode_regions = project_members.geocode_regions_3 join institutions on institutions.geocode_regions_3 = eu_territorial_units.geocode_regions join projects on project_members.project = projects.unics_id where institutions.acronym != 'INSA' and eu_territorial_units.description = 'Zollernalbkreis'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(4) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(3) A(0) Op(0) C(20) T(7) C(20) T(7) V(0) Filter(2) A(0) Op(0) C(2) T(5) C(2) T(5) V(1)",
    "sparql_query": "SELECT (sum( ?T1_total_cost) as ?aggregation_T1_total_cost_45 ) WHERE { ?T1 a dbo:projects . ?T14 a dbo:project_members . ?T14 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:acronym ?T2_acronym . ?T3 dbo:description ?T3_description . ?T2 a dbo:institutions . ?T14 dbo:institution_id ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:acronym ?T2_acronym . ?T3 dbo:description ?T3_description . ?T3 a dbo:eu_territorial_units . ?T2 dbo:geocode_regions_3 ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:acronym ?T2_acronym . ?T3 dbo:description ?T3_description . FILTER(?T2_acronym != 'INSA' && ?T3_description = 'Zollernalbkreis') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Retrieve the short names of institutions having a project member whose city is != \"KINGSTON ON SOAR NOTTINGHAM\" and acronym \"ICEC\"",
    "sql_query": "select distinct institutions.short_name from project_members join institutions on project_members.institution_id = institutions.unics_id where institutions.acronym = 'ICEC' and project_members.city != 'KINGSTON ON SOAR NOTTINGHAM'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(21) T(7) C(21) T(7) Filter(0) Filter(2) A(0) Op(0) C(20) T(7) C(20) T(7) V(0) Filter(3) A(0) Op(0) C(33) T(12) C(33) T(12) V(1)",
    "sparql_query": "SELECT DISTINCT ?T1_short_name WHERE { ?T1 a dbo:institutions . ?T2 a dbo:project_members . ?T2 dbo:institution_id ?T1 . ?T1 dbo:short_name ?T1_short_name . ?T1 dbo:acronym ?T1_acronym . ?T2 dbo:city ?T2_city . FILTER(?T1_acronym = 'ICEC' && ?T2_city != 'KINGSTON ON SOAR NOTTINGHAM') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the average cost of projects associated with institutions located in Benin with an acronym that is not ICRA?",
    "sql_query": "select avg(projects.total_cost) from institutions join eu_territorial_units on institutions.geocode_regions_3 = eu_territorial_units.geocode_regions join project_members on eu_territorial_units.geocode_regions = project_members.geocode_regions_3 join projects on project_members.project = projects.unics_id join countries on countries.unics_id = institutions.country_id where countries.country_name != 'Benin' and institutions.acronym != 'ICRA'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(3) A(0) Op(0) C(4) T(1) C(4) T(1) V(0) Filter(3) A(0) Op(0) C(20) T(7) C(20) T(7) V(1)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_129 ) WHERE { ?T1 a dbo:projects . ?T2 a dbo:project_members . ?T2 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T5 dbo:country_name ?T5_country_name . ?T4 dbo:acronym ?T4_acronym . ?T3 a dbo:eu_territorial_units . ?T2 dbo:geocode_regions_3 ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T5 dbo:country_name ?T5_country_name . ?T4 dbo:acronym ?T4_acronym . ?T4 a dbo:institutions . ?T4 dbo:geocode_regions_3 ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T5 dbo:country_name ?T5_country_name . ?T4 dbo:acronym ?T4_acronym . ?T5 a dbo:countries . ?T4 dbo:country_id ?T5 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T5 dbo:country_name ?T5_country_name . ?T4 dbo:acronym ?T4_acronym . FILTER(?T5_country_name != 'Benin' && ?T4_acronym != 'ICRA') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Get the vat number of project members whose department name is not GENERAL SECRETARY and the country of the institution is not Mauritania?",
    "sql_query": "select project_members.vat_number from project_members join institutions on project_members.institution_id = institutions.unics_id join countries on institutions.country_id = countries.unics_id where project_members.department_name != 'GENERAL SECRETARY' and countries.country_name != 'Mauritania')",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(0) Op(0) C(40) T(12) C(40) T(12) Filter(0) Filter(3) A(0) Op(0) C(39) T(12) C(39) T(12) V(0) Filter(3) A(0) Op(0) C(4) T(1) C(4) T(1) V(1)",
    "sparql_query": "SELECT ?T1_vat_number WHERE { ?T1 a dbo:project_members . ?T13 a dbo:institutions . ?T1 dbo:institution_id ?T13 . ?T1 dbo:vat_number ?T1_vat_number . ?T1 dbo:department_name ?T1_department_name . ?T2 dbo:country_name ?T2_country_name . ?T2 a dbo:countries . ?T13 dbo:country_id ?T2 . ?T1 dbo:vat_number ?T1_vat_number . ?T1 dbo:department_name ?T1_department_name . ?T2 dbo:country_name ?T2_country_name . FILTER(?T1_department_name != 'GENERAL SECRETARY' && ?T2_country_name != 'Mauritania') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the total cost of the projects whose members are in the country LY and their institution location is the country of Republic of the Congo?",
    "sql_query": "select sum(projects.total_cost) from eu_territorial_units join project_members on eu_territorial_units.geocode_regions = project_members.geocode_regions_3 join projects on project_members.project = projects.unics_id join institutions on institutions.geocode_regions_3 = eu_territorial_units.geocode_regions join countries on countries.unics_id = institutions.country_id where countries.country_name = 'Republic of the Congo' and project_members.country = 'LY'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(4) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(4) T(1) C(4) T(1) V(0) Filter(2) A(0) Op(0) C(31) T(12) C(31) T(12) V(1)",
    "sparql_query": "SELECT (sum( ?T1_total_cost) as ?aggregation_T1_total_cost_127 ) WHERE { ?T1 a dbo:projects . ?T4 a dbo:project_members . ?T4 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T5 dbo:country_name ?T5_country_name . ?T4 dbo:country ?T4_country . ?T2 a dbo:institutions . ?T4 dbo:institution_id ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T5 dbo:country_name ?T5_country_name . ?T4 dbo:country ?T4_country . ?T3 a dbo:eu_territorial_units . ?T2 dbo:geocode_regions_3 ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T5 dbo:country_name ?T5_country_name . ?T4 dbo:country ?T4_country . ?T4 a dbo:project_members . ?T4 dbo:geocode_regions_3 ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T5 dbo:country_name ?T5_country_name . ?T4 dbo:country ?T4_country . ?T5 a dbo:countries . ?T2 dbo:country_id ?T5 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T5 dbo:country_name ?T5_country_name . ?T4 dbo:country ?T4_country . FILTER(?T5_country_name = 'Republic of the Congo' && ?T4_country = 'LY') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Retrieve the funding scheme title of the project \"Eradication of tumors by targeting dsRNA selectively to cancer cells and recruitment of the innate immune system\" having a project member with short name FILTRA?",
    "sql_query": "select distinct funding_schemes.title from project_members join projects on project_members.project = projects.unics_id join funding_schemes on projects.ec_fund_scheme = funding_schemes.code where project_members.member_short_name = 'FILTRA' and projects.title != 'Eradication of tumors by targeting dsRNA selectively to cancer cells and recruitment of the innate immune system')",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(13) T(6) C(13) T(6) Filter(0) Filter(2) A(0) Op(0) C(38) T(12) C(38) T(12) V(0) Filter(3) A(0) Op(0) C(13) T(16) C(13) T(16) V(1)",
    "sparql_query": "SELECT DISTINCT ?T1_title WHERE { ?T1 a dbo:funding_schemes . ?T3 a dbo:projects . ?T3 dbo:ec_fund_scheme ?T1 . ?T1 dbo:title ?T1_title . ?T2 dbo:member_short_name ?T2_member_short_name . ?T3 dbo:title ?T3_title . ?T2 a dbo:project_members . ?T2 dbo:project ?T3 . ?T1 dbo:title ?T1_title . ?T2 dbo:member_short_name ?T2_member_short_name . ?T3 dbo:title ?T3_title . FILTER(?T2_member_short_name = 'FILTRA' && ?T3_title != 'Eradication of tumors by targeting dsRNA selectively to cancer cells && recruitment of the innate immune system') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Show me the acronym of projects whose principal investigator is Geoffrey Bodenhausen, the project's end date is 2011-01-19 and the projects are assigned to members with a department name Information Society Section.",
    "sql_query": "select projects.acronym from people join projects on people.unics_id = projects.principal_investigator join project_members on projects.unics_id = project_members.project where people.full_name = 'Geoffrey Bodenhausen' and projects.end_date = '2011-01-19' and project_members.department_name = 'Information Society Section')",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(0) Op(0) C(20) T(16) C(20) T(16) Filter(0) Filter(2) A(0) Op(0) C(23) T(8) C(23) T(8) V(0) Filter(0) Filter(2) A(0) Op(0) C(51) T(16) C(51) T(16) V(1) Filter(2) A(0) Op(0) C(39) T(12) C(39) T(12) V(2)",
    "sparql_query": "SELECT ?T1_acronym WHERE { ?T1 a dbo:projects . ?T2 a dbo:people . ?T1 dbo:principal_investigator ?T2 . ?T1 dbo:acronym ?T1_acronym . ?T2 dbo:full_name ?T2_full_name . ?T1 dbo:end_date ?T1_end_date . ?T3 dbo:department_name ?T3_department_name . ?T3 a dbo:project_members . ?T3 dbo:project ?T1 . ?T1 dbo:acronym ?T1_acronym . ?T2 dbo:full_name ?T2_full_name . ?T1 dbo:end_date ?T1_end_date . ?T3 dbo:department_name ?T3_department_name . FILTER(?T2_full_name = 'Geoffrey Bodenhausen' && ?T1_end_date = '2011-01-19' && ?T3_department_name = 'Information Society Section') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What are the distinct titles of the project topics?",
    "sql_query": "select distinct topics.title from project_topics join topics on project_topics.topic = topics.code ",
    "semql_query": "Root1(3) Root(5) Sel(1) N(0) A(0) Op(0) C(13) T(18) C(13) T(18)",
    "sparql_query": "SELECT DISTINCT ?T1_title WHERE { ?T1 a dbo:topics . ?T2 a dbo:project_topics . ?T2 dbo:topic ?T1 . ?T1 dbo:title ?T1_title . ?T1 dbo:code ?T1_code . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the average cost of projects started in 2019, assigned to institutions located in Ivory Coast with eu territorial unit description Heinsberg?",
    "sql_query": "select avg(projects.total_cost) from countries join institutions on countries.unics_id = institutions.country_id join eu_territorial_units on institutions.geocode_regions_3 = eu_territorial_units.geocode_regions join project_members on eu_territorial_units.geocode_regions = project_members.geocode_regions_3 join projects on project_members.project = projects.unics_id where countries.country_name = 'Ivory Coast' and eu_territorial_units.description = 'Heinsberg' and projects.start_year = '2019'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(4) T(1) C(4) T(1) V(0) Filter(0) Filter(2) A(0) Op(0) C(2) T(5) C(2) T(5) V(1) Filter(2) A(0) Op(0) C(52) T(16) C(52) T(16) V(2)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_131 ) WHERE { ?T1 a dbo:projects . ?T14 a dbo:project_members . ?T14 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:country_name ?T2_country_name . ?T3 dbo:description ?T3_description . ?T1 dbo:start_year ?T1_start_year . ?T15 a dbo:institutions . ?T14 dbo:institution_id ?T15 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:country_name ?T2_country_name . ?T3 dbo:description ?T3_description . ?T1 dbo:start_year ?T1_start_year . ?T2 a dbo:countries . ?T15 dbo:country_id ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:country_name ?T2_country_name . ?T3 dbo:description ?T3_description . ?T1 dbo:start_year ?T1_start_year . ?T3 a dbo:eu_territorial_units . ?T15 dbo:geocode_regions_3 ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:country_name ?T2_country_name . ?T3 dbo:description ?T3_description . ?T1 dbo:start_year ?T1_start_year . FILTER(?T2_country_name = 'Ivory Coast' && ?T3_description = 'Heinsberg' && ?T1_start_year = 2019) . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the average cost of the projects that don't have the acronym RustBelt and the project's subject area is Industrial Manufacture?",
    "sql_query": "select avg(projects.total_cost) from subject_areas join project_subject_areas on subject_areas.code = project_subject_areas.subject_area join projects on project_subject_areas.project = projects.unics_id where subject_areas.title = 'Industrial Manufacture' and projects.acronym != 'RustBelt'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(13) T(17) C(13) T(17) V(0) Filter(3) A(0) Op(0) C(20) T(16) C(20) T(16) V(1)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_110 ) WHERE { ?T1 a dbo:projects . ?T13 a dbo:project_subject_areas . ?T13 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:title ?T2_title . ?T1 dbo:acronym ?T1_acronym . ?T2 a dbo:subject_areas . ?T13 dbo:subject_area ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:title ?T2_title . ?T1 dbo:acronym ?T1_acronym . FILTER(?T2_title = 'Industrial Manufacture' && ?T1_acronym != 'RustBelt') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Show topics that belong to a project with title 'The effects of agronomic practices conducive to organic agriculture on the diversity and function of arbuscular mycorrhizal fungi'.",
    "sql_query": "select distinct topics.title from project_topics join topics on project_topics.topic = topics.code join projects on projects.unics_id = project_topics.project where projects.title = 'The effects of agronomic practices conducive to organic agriculture on the diversity and function of arbuscular mycorrhizal fungi')",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(13) T(18) C(13) T(18) Filter(2) A(0) Op(0) C(13) T(16) C(13) T(16) V(0)",
    "sparql_query": "SELECT DISTINCT ?T1_title WHERE { ?T1 a dbo:topics . ?T13 a dbo:project_topics . ?T13 dbo:topic ?T1 . ?T1 dbo:title ?T1_title . ?T2 dbo:title ?T2_title . ?T2 a dbo:projects . ?T13 dbo:project ?T2 . ?T1 dbo:title ?T1_title . ?T2 dbo:title ?T2_title . FILTER(?T2_title = 'The effects of agronomic practices conducive to organic agriculture on the diversity && function of arbuscular mycorrhizal fungi') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the total cost of projects with erc panels description Earth System Science and erc research domains Social Sciences And Humanities?",
    "sql_query": "select sum(projects.total_cost) from erc_research_domains join erc_panels on erc_research_domains.code = erc_panels.part_of join project_erc_panels on erc_panels.code = project_erc_panels.panel join projects on project_erc_panels.project = projects.unics_id where erc_research_domains.description = 'Social Sciences And Humanities' and erc_panels.description != 'Earth System Science'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(4) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(2) T(4) C(2) T(4) V(0) Filter(3) A(0) Op(0) C(2) T(3) C(2) T(3) V(1)",
    "sparql_query": "SELECT (sum( ?T1_total_cost) as ?aggregation_T1_total_cost_22 ) WHERE { ?T1 a dbo:projects . ?T14 a dbo:project_erc_panels . ?T14 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:description ?T2_description . ?T3 dbo:description ?T3_description . ?T3 a dbo:erc_panels . ?T14 dbo:panel ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:description ?T2_description . ?T3 dbo:description ?T3_description . ?T2 a dbo:erc_research_domains . ?T3 dbo:part_of ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:description ?T2_description . ?T3 dbo:description ?T3_description . FILTER(?T2_description = 'Social Sciences And Humanities' && ?T3_description != 'Earth System Science') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the average cost of projects started in 2018-02-01 with members in OVIEDO ASTURIAS?",
    "sql_query": "select avg(projects.total_cost) from project_members join projects on project_members.project = projects.unics_id where project_members.city = 'OVIEDO ASTURIAS' and projects.start_date <= '2018-02-01'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(33) T(12) C(33) T(12) V(0) Filter(6) A(0) Op(0) C(50) T(16) C(50) T(16) V(1)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_63 ) WHERE { ?T1 a dbo:projects . ?T2 a dbo:project_members . ?T2 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:city ?T2_city . ?T1 dbo:start_date ?T1_start_date . FILTER(?T2_city = 'OVIEDO ASTURIAS' && ?T1_start_date <= '2018-02-01') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the total cost of projects assigned to the institution with short name UTBM for all the departments except Civiele bescherming?",
    "sql_query": "select sum(projects.total_cost) from eu_territorial_units join project_members on eu_territorial_units.geocode_regions = project_members.geocode_regions_3 join institutions on institutions.geocode_regions_3 = eu_territorial_units.geocode_regions join projects on project_members.project = projects.unics_id where project_members.department_name != 'Civiele bescherming' and institutions.short_name = 'UTBM'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(4) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(3) A(0) Op(0) C(39) T(12) C(39) T(12) V(0) Filter(2) A(0) Op(0) C(21) T(7) C(21) T(7) V(1)",
    "sparql_query": "SELECT (sum( ?T1_total_cost) as ?aggregation_T1_total_cost_13 ) WHERE { ?T1 a dbo:projects . ?T4 a dbo:project_members . ?T4 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T4 dbo:department_name ?T4_department_name . ?T2 dbo:short_name ?T2_short_name . ?T2 a dbo:institutions . ?T4 dbo:institution_id ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T4 dbo:department_name ?T4_department_name . ?T2 dbo:short_name ?T2_short_name . ?T3 a dbo:eu_territorial_units . ?T2 dbo:geocode_regions_3 ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T4 dbo:department_name ?T4_department_name . ?T2 dbo:short_name ?T2_short_name . ?T4 a dbo:project_members . ?T4 dbo:geocode_regions_3 ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T4 dbo:department_name ?T4_department_name . ?T2 dbo:short_name ?T2_short_name . FILTER(?T4_department_name != 'Civiele bescherming' && ?T2_short_name = 'UTBM') . } "
  }
]