[
  {
    "db_id": "cordis_temporary",
    "question": "How many institutions are with territorial unit, located in CZ, with acronym IEEC and associated with projects which their principal investigators are James Fawcett?",
    "sql_query": "select count(distinct eu_territorial_units.description) from people join projects on people.unics_id = projects.principal_investigator join project_members on projects.unics_id = project_members.project join institutions on project_members.institution_id = institutions.unics_id join eu_territorial_units on institutions.geocode_regions_3 = eu_territorial_units.geocode_regions where project_members.country = 'CZ' and people.full_name = 'James Fawcett' and institutions.acronym = 'IEEC'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(2) T(5) C(2) T(5) Filter(0) Filter(2) A(0) Op(0) C(31) T(12) C(31) T(12) V(0) Filter(0) Filter(2) A(0) Op(0) C(23) T(8) C(23) T(8) V(1) Filter(2) A(0) Op(0) C(20) T(7) C(20) T(7) V(2)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_description) as ?aggregation_T1_description_179 ) WHERE { ?T1 a dbo:eu_territorial_units . ?T2 a dbo:project_members . ?T2 dbo:geocode_regions_3 ?T1 . ?T1 dbo:description ?T1_description . ?T2 dbo:country ?T2_country . ?T3 dbo:full_name ?T3_full_name . ?T4 dbo:acronym ?T4_acronym . ?T15 a dbo:projects . ?T2 dbo:project ?T15 . ?T1 dbo:description ?T1_description . ?T2 dbo:country ?T2_country . ?T3 dbo:full_name ?T3_full_name . ?T4 dbo:acronym ?T4_acronym . ?T3 a dbo:people . ?T15 dbo:principal_investigator ?T3 . ?T1 dbo:description ?T1_description . ?T2 dbo:country ?T2_country . ?T3 dbo:full_name ?T3_full_name . ?T4 dbo:acronym ?T4_acronym . ?T4 a dbo:institutions . ?T2 dbo:institution_id ?T4 . ?T1 dbo:description ?T1_description . ?T2 dbo:country ?T2_country . ?T3 dbo:full_name ?T3_full_name . ?T4 dbo:acronym ?T4_acronym . FILTER(?T2_country = 'CZ' && ?T3_full_name = 'James Fawcett' && ?T4_acronym = 'IEEC') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the average cost of projects assigned to CAMBRIDGE DESIGN PARTNERSHIP LLP institution, located in Wallis and Futuna with territorial unit description \u0421\u0435\u0432\u0435\u0440\u043e\u0437\u0430\u043f\u0430\u0434\u0435\u043d?",
    "sql_query": "select avg(projects.total_cost) from project_members join projects on project_members.project = projects.unics_id join eu_territorial_units on eu_territorial_units.geocode_regions = project_members.geocode_regions_3 join institutions on institutions.geocode_regions_3 = eu_territorial_units.geocode_regions join countries on countries.unics_id = institutions.country_id where countries.country_name = 'Wallis and Futuna' and eu_territorial_units.description != '\u0421\u0435\u0432\u0435\u0440\u043e\u0437\u0430\u043f\u0430\u0434\u0435\u043d' and institutions.institutions_name = 'CAMBRIDGE DESIGN PARTNERSHIP LLP'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(4) T(1) C(4) T(1) V(0) Filter(0) Filter(3) A(0) Op(0) C(2) T(5) C(2) T(5) V(1) Filter(2) A(0) Op(0) C(15) T(7) C(15) T(7) V(2)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_102 ) WHERE { ?T1 a dbo:projects . ?T15 a dbo:project_members . ?T15 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:country_name ?T2_country_name . ?T3 dbo:description ?T3_description . ?T4 dbo:institutions_name ?T4_institutions_name . ?T4 a dbo:institutions . ?T15 dbo:institution_id ?T4 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:country_name ?T2_country_name . ?T3 dbo:description ?T3_description . ?T4 dbo:institutions_name ?T4_institutions_name . ?T2 a dbo:countries . ?T4 dbo:country_id ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:country_name ?T2_country_name . ?T3 dbo:description ?T3_description . ?T4 dbo:institutions_name ?T4_institutions_name . ?T3 a dbo:eu_territorial_units . ?T4 dbo:geocode_regions_3 ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:country_name ?T2_country_name . ?T3 dbo:description ?T3_description . ?T4 dbo:institutions_name ?T4_institutions_name . FILTER(?T2_country_name = 'Wallis && Futuna' && ?T3_description != '\u0421\u0435\u0432\u0435\u0440\u043e\u0437\u0430\u043f\u0430\u0434\u0435\u043d' && ?T4_institutions_name = 'CAMBRIDGE DESIGN PARTNERSHIP LLP') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the average cost of projects that started after or during 2008-06-25 and have the funding scheme Transfer of Knowledge-Industry?",
    "sql_query": "select avg(projects.total_cost) from funding_schemes join projects on funding_schemes.code = projects.ec_fund_scheme where funding_schemes.title = 'Transfer of Knowledge-Industry' and projects.start_date >= '2008-06-25'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(13) T(6) C(13) T(6) V(0) Filter(7) A(0) Op(0) C(50) T(16) C(50) T(16) V(1)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_166 ) WHERE { ?T1 a dbo:projects . ?T2 a dbo:funding_schemes . ?T1 dbo:ec_fund_scheme ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:title ?T2_title . ?T1 dbo:start_date ?T1_start_date . FILTER(?T2_title = 'Transfer of Knowledge-Industry' && ?T1_start_date >= '2008-06-25') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What are the activity types of institutions located in UY?",
    "sql_query": "select distinct activity_types.description from project_members join activity_types on project_members.activity_type = activity_types.code where project_members.country = 'UY'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(2) T(0) C(2) T(0) Filter(2) A(0) Op(0) C(31) T(12) C(31) T(12) V(0)",
    "sparql_query": "SELECT DISTINCT ?T1_description WHERE { ?T1 a dbo:activity_types . ?T2 a dbo:project_members . ?T2 dbo:activity_type ?T1 . ?T1 dbo:description ?T1_description . ?T2 dbo:country ?T2_country . FILTER(?T2_country = 'UY') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What are the erc panels descriptions of projects in the erc research domain of Social Sciences And Humanities?",
    "sql_query": "select distinct erc_panels.description from erc_research_domains join erc_panels on erc_research_domains.code = erc_panels.part_of where erc_research_domains.description = 'Social Sciences And Humanities'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(2) T(3) C(2) T(3) Filter(2) A(0) Op(0) C(2) T(4) C(2) T(4) V(0)",
    "sparql_query": "SELECT DISTINCT ?T1_description WHERE { ?T1 a dbo:erc_panels . ?T2 a dbo:erc_research_domains . ?T1 dbo:part_of ?T2 . ?T1 dbo:description ?T1_description . ?T2 dbo:description ?T2_description . FILTER(?T2_description = 'Social Sciences And Humanities') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Show project members short name for projects that didn't start in 2015, are associated with the panel description 'Applied life sciences and biotechnology' and are not associated with research domains that have the description 'Physical Sciences And Engineering'.",
    "sql_query": "select project_members.member_short_name from erc_panels join project_erc_panels on erc_panels.code = project_erc_panels.panel join projects on project_erc_panels.project = projects.unics_id join erc_research_domains on erc_research_domains.code = erc_panels.part_of join project_members on projects.unics_id = project_members.project where erc_panels.description = 'Applied life sciences and biotechnology' and erc_research_domains.description != 'Physical Sciences And Engineering' and projects.start_year != '2015'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(0) Op(0) C(38) T(12) C(38) T(12) Filter(0) Filter(2) A(0) Op(0) C(2) T(3) C(2) T(3) V(0) Filter(0) Filter(3) A(0) Op(0) C(2) T(4) C(2) T(4) V(1) Filter(3) A(0) Op(0) C(52) T(16) C(52) T(16) V(2)",
    "sparql_query": "SELECT ?T1_member_short_name WHERE { ?T1 a dbo:project_members . ?T4 a dbo:projects . ?T1 dbo:project ?T4 . ?T1 dbo:member_short_name ?T1_member_short_name . ?T2 dbo:description ?T2_description . ?T3 dbo:description ?T3_description . ?T4 dbo:start_year ?T4_start_year . ?T15 a dbo:project_erc_panels . ?T15 dbo:project ?T4 . ?T1 dbo:member_short_name ?T1_member_short_name . ?T2 dbo:description ?T2_description . ?T3 dbo:description ?T3_description . ?T4 dbo:start_year ?T4_start_year . ?T2 a dbo:erc_panels . ?T15 dbo:panel ?T2 . ?T1 dbo:member_short_name ?T1_member_short_name . ?T2 dbo:description ?T2_description . ?T3 dbo:description ?T3_description . ?T4 dbo:start_year ?T4_start_year . ?T3 a dbo:erc_research_domains . ?T2 dbo:part_of ?T3 . ?T1 dbo:member_short_name ?T1_member_short_name . ?T2 dbo:description ?T2_description . ?T3 dbo:description ?T3_description . ?T4 dbo:start_year ?T4_start_year . FILTER(?T2_description = 'Applied life sciences && biotechnology' && ?T3_description != 'Physical Sciences And Engineering' && ?T4_start_year != 2015) . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the total cost of projects started after 2009 with erc research domain description Interdisciplinary?",
    "sql_query": "select sum(projects.total_cost) from erc_research_domains join erc_panels on erc_research_domains.code = erc_panels.part_of join project_erc_panels on erc_panels.code = project_erc_panels.panel join projects on project_erc_panels.project = projects.unics_id where erc_research_domains.description = 'Interdisciplinary' and projects.start_year > '2009'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(4) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(2) T(4) C(2) T(4) V(0) Filter(5) A(0) Op(0) C(52) T(16) C(52) T(16) V(1)",
    "sparql_query": "SELECT (sum( ?T1_total_cost) as ?aggregation_T1_total_cost_148 ) WHERE { ?T1 a dbo:projects . ?T13 a dbo:project_erc_panels . ?T13 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:description ?T2_description . ?T1 dbo:start_year ?T1_start_year . ?T14 a dbo:erc_panels . ?T13 dbo:panel ?T14 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:description ?T2_description . ?T1 dbo:start_year ?T1_start_year . ?T2 a dbo:erc_research_domains . ?T14 dbo:part_of ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:description ?T2_description . ?T1 dbo:start_year ?T1_start_year . FILTER(?T2_description = 'Interdisciplinary' && ?T1_start_year > 2009) . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What are the different panel descriptions associated with projects that didn't start in 2011?",
    "sql_query": "select distinct erc_panels.description from project_erc_panels join erc_panels on project_erc_panels.panel = erc_panels.code join projects on projects.unics_id = project_erc_panels.project where projects.start_year != '2011'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(2) T(3) C(2) T(3) Filter(3) A(0) Op(0) C(52) T(16) C(52) T(16) V(0)",
    "sparql_query": "SELECT DISTINCT ?T1_description WHERE { ?T1 a dbo:erc_panels . ?T13 a dbo:project_erc_panels . ?T13 dbo:panel ?T1 . ?T1 dbo:description ?T1_description . ?T2 dbo:start_year ?T2_start_year . ?T2 a dbo:projects . ?T13 dbo:project ?T2 . ?T1 dbo:description ?T1_description . ?T2 dbo:start_year ?T2_start_year . FILTER(?T2_start_year != 2011) . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the total cost of projects with erc research domain description Interdisciplinary and erc panels description Universe sciences?",
    "sql_query": "select sum(projects.total_cost) from erc_research_domains join erc_panels on erc_research_domains.code = erc_panels.part_of join project_erc_panels on erc_panels.code = project_erc_panels.panel join projects on project_erc_panels.project = projects.unics_id where erc_research_domains.description != 'Interdisciplinary' and erc_panels.description != 'Universe sciences'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(4) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(3) A(0) Op(0) C(2) T(4) C(2) T(4) V(0) Filter(3) A(0) Op(0) C(2) T(3) C(2) T(3) V(1)",
    "sparql_query": "SELECT (sum( ?T1_total_cost) as ?aggregation_T1_total_cost_159 ) WHERE { ?T1 a dbo:projects . ?T14 a dbo:project_erc_panels . ?T14 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:description ?T2_description . ?T3 dbo:description ?T3_description . ?T3 a dbo:erc_panels . ?T14 dbo:panel ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:description ?T2_description . ?T3 dbo:description ?T3_description . ?T2 a dbo:erc_research_domains . ?T3 dbo:part_of ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:description ?T2_description . ?T3 dbo:description ?T3_description . FILTER(?T2_description != 'Interdisciplinary' && ?T3_description != 'Universe sciences') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the total cost of projects that ended before 2022 and have the topic Valorisation of cellulose into new added value products?",
    "sql_query": "select sum(projects.total_cost) from project_topics join projects on project_topics.project = projects.unics_id join topics on topics.code = project_topics.topic where topics.title = 'Valorisation of cellulose into new added value products' and projects.end_year < '2022'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(4) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(13) T(18) C(13) T(18) V(0) Filter(4) A(0) Op(0) C(53) T(16) C(53) T(16) V(1)",
    "sparql_query": "SELECT (sum( ?T1_total_cost) as ?aggregation_T1_total_cost_23 ) WHERE { ?T1 a dbo:projects . ?T13 a dbo:project_topics . ?T13 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:title ?T2_title . ?T1 dbo:end_year ?T1_end_year . ?T2 a dbo:topics . ?T13 dbo:topic ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:title ?T2_title . ?T1 dbo:end_year ?T1_end_year . FILTER(?T2_title = 'Valorisation of cellulose into new added value products' && ?T1_end_year < 2022) . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "How many projects have total cost 1941144 and are assigned to members whose short name is ZZZS with territorial unit description Is\u00e8re?",
    "sql_query": "select count(distinct projects.end_year) from eu_territorial_units join project_members on eu_territorial_units.geocode_regions = project_members.geocode_regions_3 join projects on project_members.project = projects.unics_id where eu_territorial_units.description = 'Is\u00e8re' and project_members.member_short_name = 'ZZZS' and projects.total_cost = '1941144'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(53) T(16) C(53) T(16) Filter(0) Filter(2) A(0) Op(0) C(2) T(5) C(2) T(5) V(0) Filter(0) Filter(2) A(0) Op(0) C(38) T(12) C(38) T(12) V(1) Filter(2) A(0) Op(0) C(55) T(16) C(55) T(16) V(2)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_end_year) as ?aggregation_T1_end_year_4 ) WHERE { ?T1 a dbo:projects . ?T3 a dbo:project_members . ?T3 dbo:project ?T1 . ?T1 dbo:end_year ?T1_end_year . ?T2 dbo:description ?T2_description . ?T3 dbo:member_short_name ?T3_member_short_name . ?T1 dbo:total_cost ?T1_total_cost . ?T2 a dbo:eu_territorial_units . ?T3 dbo:geocode_regions_3 ?T2 . ?T1 dbo:end_year ?T1_end_year . ?T2 dbo:description ?T2_description . ?T3 dbo:member_short_name ?T3_member_short_name . ?T1 dbo:total_cost ?T1_total_cost . FILTER(?T2_description = 'Is\u00e8re' && ?T3_member_short_name = 'ZZZS' && ?T1_total_cost = 1941144) . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Display activity types associated with project members from the country VN.",
    "sql_query": "select distinct activity_types.description from project_members join activity_types on project_members.activity_type = activity_types.code where project_members.country = 'VN'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(2) T(0) C(2) T(0) Filter(2) A(0) Op(0) C(31) T(12) C(31) T(12) V(0)",
    "sparql_query": "SELECT DISTINCT ?T1_description WHERE { ?T1 a dbo:activity_types . ?T2 a dbo:project_members . ?T2 dbo:activity_type ?T1 . ?T1 dbo:description ?T1_description . ?T2 dbo:country ?T2_country . FILTER(?T2_country = 'VN') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the total cost of projects started after or during 2015 in the subject area of Water resources and management?",
    "sql_query": "select sum(projects.total_cost) from subject_areas join project_subject_areas on subject_areas.code = project_subject_areas.subject_area join projects on project_subject_areas.project = projects.unics_id where projects.start_year >= '2015' and subject_areas.title = 'Water resources and management'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(4) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(7) A(0) Op(0) C(52) T(16) C(52) T(16) V(0) Filter(2) A(0) Op(0) C(13) T(17) C(13) T(17) V(1)",
    "sparql_query": "SELECT (sum( ?T1_total_cost) as ?aggregation_T1_total_cost_130 ) WHERE { ?T1 a dbo:projects . ?T13 a dbo:project_subject_areas . ?T13 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T1 dbo:start_year ?T1_start_year . ?T2 dbo:title ?T2_title . ?T2 a dbo:subject_areas . ?T13 dbo:subject_area ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T1 dbo:start_year ?T1_start_year . ?T2 dbo:title ?T2_title . FILTER(?T1_start_year >= 2015 && ?T2_title = 'Water resources && management') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the average cost of projects assigned to the institution with short name Ensad and its not located in a country with code IN?",
    "sql_query": "select avg(projects.total_cost) from project_members join projects on project_members.project = projects.unics_id join eu_territorial_units on eu_territorial_units.geocode_regions = project_members.geocode_regions_3 join institutions on institutions.geocode_regions_3 = eu_territorial_units.geocode_regions join countries on countries.unics_id = institutions.country_id where institutions.short_name = 'Ensad' and countries.country_code2 != 'IN'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(21) T(7) C(21) T(7) V(0) Filter(3) A(0) Op(0) C(5) T(1) C(5) T(1) V(1)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_179 ) WHERE { ?T1 a dbo:projects . ?T4 a dbo:project_members . ?T4 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T2 dbo:short_name ?T2_short_name . ?T5 dbo:country_code2 ?T5_country_code2 . ?T2 a dbo:institutions . ?T4 dbo:institution_id ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T2 dbo:short_name ?T2_short_name . ?T5 dbo:country_code2 ?T5_country_code2 . ?T3 a dbo:eu_territorial_units . ?T2 dbo:geocode_regions_3 ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T2 dbo:short_name ?T2_short_name . ?T5 dbo:country_code2 ?T5_country_code2 . ?T4 a dbo:project_members . ?T4 dbo:geocode_regions_3 ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T2 dbo:short_name ?T2_short_name . ?T5 dbo:country_code2 ?T5_country_code2 . ?T5 a dbo:countries . ?T2 dbo:country_id ?T5 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T2 dbo:short_name ?T2_short_name . ?T5 dbo:country_code2 ?T5_country_code2 . FILTER(?T2_short_name = 'Ensad' && ?T5_country_code2 != 'IN') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Show all institutions with territorial unit and activity type Higher or Secondary Education Establishments, located in ZW.",
    "sql_query": "select distinct institutions.institutions_name from activity_types join project_members on activity_types.code = project_members.activity_type join eu_territorial_units on project_members.geocode_regions_3 = eu_territorial_units.geocode_regions where project_members.country = 'ZW' and activity_types.description = 'Higher or Secondary Education Establishments'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(15) T(7) C(15) T(7) Filter(0) Filter(2) A(0) Op(0) C(31) T(12) C(31) T(12) V(0) Filter(2) A(0) Op(0) C(2) T(0) C(2) T(0) V(1)",
    "sparql_query": "SELECT DISTINCT ?T1_institutions_name WHERE { ?T1 a dbo:institutions . ?T2 a dbo:project_members . ?T2 dbo:institution_id ?T1 . ?T1 dbo:institutions_name ?T1_institutions_name . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T2 dbo:country ?T2_country . ?T4 dbo:description ?T4_description . ?T3 a dbo:eu_territorial_units . ?T2 dbo:geocode_regions_3 ?T3 . ?T1 dbo:institutions_name ?T1_institutions_name . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T2 dbo:country ?T2_country . ?T4 dbo:description ?T4_description . ?T4 a dbo:activity_types . ?T2 dbo:activity_type ?T4 . ?T1 dbo:institutions_name ?T1_institutions_name . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T2 dbo:country ?T2_country . ?T4 dbo:description ?T4_description . FILTER(?T2_country = 'ZW' && ?T4_description = 'Higher || Secondary Education Establishments') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What are the different panel descriptions that have a project?",
    "sql_query": "select distinct erc_panels.description from project_erc_panels join erc_panels on project_erc_panels.panel = erc_panels.code ",
    "semql_query": "Root1(3) Root(5) Sel(1) N(0) A(0) Op(0) C(2) T(3) C(2) T(3)",
    "sparql_query": "SELECT DISTINCT ?T1_description WHERE { ?T1 a dbo:erc_panels . ?T2 a dbo:project_erc_panels . ?T2 dbo:panel ?T1 . ?T1 dbo:description ?T1_description . ?T1 dbo:code ?T1_code . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What are the subject areas of projects ended in 2011-06-09?",
    "sql_query": "select distinct subject_areas.title from project_subject_areas join subject_areas on project_subject_areas.subject_area = subject_areas.code join projects on projects.unics_id = project_subject_areas.project where projects.end_date = '2011-06-09'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(13) T(17) C(13) T(17) Filter(2) A(0) Op(0) C(51) T(16) C(51) T(16) V(0)",
    "sparql_query": "SELECT DISTINCT ?T1_title WHERE { ?T1 a dbo:subject_areas . ?T13 a dbo:project_subject_areas . ?T13 dbo:subject_area ?T1 . ?T1 dbo:title ?T1_title . ?T2 dbo:end_date ?T2_end_date . ?T2 a dbo:projects . ?T13 dbo:project ?T2 . ?T1 dbo:title ?T1_title . ?T2 dbo:end_date ?T2_end_date . FILTER(?T2_end_date = '2011-06-09') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Return project members assigned to projects that started after 2009-02-16 and don't have the topic A European concerted effort on RFID.",
    "sql_query": "select distinct project_members.member_short_name from topics join project_topics on topics.code = project_topics.topic join projects on project_topics.project = projects.unics_id join project_members on projects.unics_id = project_members.project where projects.start_date > '2009-02-16' and topics.title != 'A European concerted effort on RFID'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(38) T(12) C(38) T(12) Filter(0) Filter(5) A(0) Op(0) C(50) T(16) C(50) T(16) V(0) Filter(3) A(0) Op(0) C(13) T(18) C(13) T(18) V(1)",
    "sparql_query": "SELECT DISTINCT ?T1_member_short_name WHERE { ?T1 a dbo:project_members . ?T2 a dbo:projects . ?T1 dbo:project ?T2 . ?T1 dbo:member_short_name ?T1_member_short_name . ?T2 dbo:start_date ?T2_start_date . ?T3 dbo:title ?T3_title . ?T14 a dbo:project_topics . ?T14 dbo:project ?T2 . ?T1 dbo:member_short_name ?T1_member_short_name . ?T2 dbo:start_date ?T2_start_date . ?T3 dbo:title ?T3_title . ?T3 a dbo:topics . ?T14 dbo:topic ?T3 . ?T1 dbo:member_short_name ?T1_member_short_name . ?T2 dbo:start_date ?T2_start_date . ?T3 dbo:title ?T3_title . FILTER(?T2_start_date > '2009-02-16' && ?T3_title != 'A European concerted effort on RFID') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the full name of principal investigators of projects that didn't end in 2020 ?",
    "sql_query": "select distinct people.full_name from projects join people on projects.principal_investigator = people.unics_id where projects.end_year != '2020'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(23) T(8) C(23) T(8) Filter(3) A(0) Op(0) C(53) T(16) C(53) T(16) V(0)",
    "sparql_query": "SELECT DISTINCT ?T1_full_name WHERE { ?T1 a dbo:people . ?T2 a dbo:projects . ?T2 dbo:principal_investigator ?T1 . ?T1 dbo:full_name ?T1_full_name . ?T2 dbo:end_year ?T2_end_year . FILTER(?T2_end_year != 2020) . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the average cost of projects that didn't end in 2018-03-10 and are assigned to the department General Secretariat?",
    "sql_query": "select avg(projects.total_cost) from project_members join projects on project_members.project = projects.unics_id where projects.end_date != '2018-03-10' and project_members.department_name = 'General Secretariat'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(3) A(0) Op(0) C(51) T(16) C(51) T(16) V(0) Filter(2) A(0) Op(0) C(39) T(12) C(39) T(12) V(1)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_156 ) WHERE { ?T1 a dbo:projects . ?T2 a dbo:project_members . ?T2 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T1 dbo:end_date ?T1_end_date . ?T2 dbo:department_name ?T2_department_name . FILTER(?T1_end_date != '2018-03-10' && ?T2_department_name = 'General Secretariat') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Retrieve country code 2 of countries associated with the institution UCA, located in Belize with members in EL.",
    "sql_query": "select distinct countries.country_code2 from project_members join institutions on project_members.institution_id = institutions.unics_id join countries on institutions.country_id = countries.unics_id where project_members.country = 'EL' and institutions.short_name = 'UCA' and countries.country_name = 'Belize'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(5) T(1) C(5) T(1) Filter(0) Filter(2) A(0) Op(0) C(31) T(12) C(31) T(12) V(0) Filter(0) Filter(2) A(0) Op(0) C(21) T(7) C(21) T(7) V(1) Filter(2) A(0) Op(0) C(4) T(1) C(4) T(1) V(2)",
    "sparql_query": "SELECT DISTINCT ?T1_country_code2 WHERE { ?T1 a dbo:countries . ?T3 a dbo:institutions . ?T3 dbo:country_id ?T1 . ?T1 dbo:country_code2 ?T1_country_code2 . ?T2 dbo:country ?T2_country . ?T3 dbo:short_name ?T3_short_name . ?T1 dbo:country_name ?T1_country_name . ?T2 a dbo:project_members . ?T2 dbo:institution_id ?T3 . ?T1 dbo:country_code2 ?T1_country_code2 . ?T2 dbo:country ?T2_country . ?T3 dbo:short_name ?T3_short_name . ?T1 dbo:country_name ?T1_country_name . FILTER(?T2_country = 'EL' && ?T3_short_name = 'UCA' && ?T1_country_name = 'Belize') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Show me topics associated with projects that ended before 2013 and have the principal investigator Michael Ingleson",
    "sql_query": "select distinct topics.title from people join projects on people.unics_id = projects.principal_investigator join project_topics on projects.unics_id = project_topics.project join topics on project_topics.topic = topics.code where projects.end_year < '2013' and people.full_name = 'Michael Ingleson')",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(13) T(18) C(13) T(18) Filter(0) Filter(4) A(0) Op(0) C(53) T(16) C(53) T(16) V(0) Filter(2) A(0) Op(0) C(23) T(8) C(23) T(8) V(1)",
    "sparql_query": "SELECT DISTINCT ?T1_title WHERE { ?T1 a dbo:topics . ?T14 a dbo:project_topics . ?T14 dbo:topic ?T1 . ?T1 dbo:title ?T1_title . ?T2 dbo:end_year ?T2_end_year . ?T3 dbo:full_name ?T3_full_name . ?T2 a dbo:projects . ?T14 dbo:project ?T2 . ?T1 dbo:title ?T1_title . ?T2 dbo:end_year ?T2_end_year . ?T3 dbo:full_name ?T3_full_name . ?T3 a dbo:people . ?T2 dbo:principal_investigator ?T3 . ?T1 dbo:title ?T1_title . ?T2 dbo:end_year ?T2_end_year . ?T3 dbo:full_name ?T3_full_name . FILTER(?T2_end_year < 2013 && ?T3_full_name = 'Michael Ingleson') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the average cost of projects whose members are located in countries with code ID and have the territorial unit description Etel\u00e4-Karjala?",
    "sql_query": "select avg(projects.total_cost) from project_members join projects on project_members.project = projects.unics_id join eu_territorial_units on eu_territorial_units.geocode_regions = project_members.geocode_regions_3 join institutions on institutions.geocode_regions_3 = eu_territorial_units.geocode_regions join countries on countries.unics_id = institutions.country_id where countries.country_code2 = 'ID' and eu_territorial_units.description = 'Etel\u00e4-Karjala'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(5) T(1) C(5) T(1) V(0) Filter(2) A(0) Op(0) C(2) T(5) C(2) T(5) V(1)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_59 ) WHERE { ?T1 a dbo:projects . ?T14 a dbo:project_members . ?T14 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:country_code2 ?T2_country_code2 . ?T3 dbo:description ?T3_description . ?T15 a dbo:institutions . ?T14 dbo:institution_id ?T15 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:country_code2 ?T2_country_code2 . ?T3 dbo:description ?T3_description . ?T2 a dbo:countries . ?T15 dbo:country_id ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:country_code2 ?T2_country_code2 . ?T3 dbo:description ?T3_description . ?T3 a dbo:eu_territorial_units . ?T15 dbo:geocode_regions_3 ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:country_code2 ?T2_country_code2 . ?T3 dbo:description ?T3_description . FILTER(?T2_country_code2 = 'ID' && ?T3_description = 'Etel\u00e4-Karjala') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "How many countries of institutions which are not located in AMSTERDAM have as principal investigator J\u00e9r\u00f4me Waser?",
    "sql_query": "select count(distinct project_members.country) from projects join project_members on projects.unics_id = project_members.project join people on people.unics_id = projects.principal_investigator where project_members.city != 'ASMTERDAM' and people.full_name = 'J\u00e9r\u00f4me Waser'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(31) T(12) C(31) T(12) Filter(0) Filter(3) A(0) Op(0) C(33) T(12) C(33) T(12) V(0) Filter(2) A(0) Op(0) C(23) T(8) C(23) T(8) V(1)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_country) as ?aggregation_T1_country_142 ) WHERE { ?T1 a dbo:project_members . ?T13 a dbo:projects . ?T1 dbo:project ?T13 . ?T1 dbo:country ?T1_country . ?T1 dbo:city ?T1_city . ?T2 dbo:full_name ?T2_full_name . ?T2 a dbo:people . ?T13 dbo:principal_investigator ?T2 . ?T1 dbo:country ?T1_country . ?T1 dbo:city ?T1_city . ?T2 dbo:full_name ?T2_full_name . FILTER(?T1_city != 'ASMTERDAM' && ?T2_full_name = 'J\u00e9r\u00f4me Waser') . } "
  }
]