[
  {
    "db_id": "cordis_temporary",
    "question": "What is the total cost of projects whose end year is after 2009 and are assigned to institutions in countries that don't have the country code GW?",
    "sql_query": "select sum(projects.total_cost) from institutions join eu_territorial_units on institutions.geocode_regions_3 = eu_territorial_units.geocode_regions join countries on countries.unics_id = institutions.country_id join project_members on eu_territorial_units.geocode_regions = project_members.geocode_regions_3 join projects on project_members.project = projects.unics_id where countries.country_code2 != 'GW' and projects.end_year > '2009'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(4) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(3) A(0) Op(0) C(5) T(1) C(5) T(1) V(0) Filter(5) A(0) Op(0) C(53) T(16) C(53) T(16) V(1)",
    "sparql_query": "SELECT (sum( ?T1_total_cost) as ?aggregation_T1_total_cost_183 ) WHERE { ?T1 a dbo:projects . ?T2 a dbo:project_members . ?T2 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T5 dbo:country_code2 ?T5_country_code2 . ?T1 dbo:end_year ?T1_end_year . ?T3 a dbo:eu_territorial_units . ?T2 dbo:geocode_regions_3 ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T5 dbo:country_code2 ?T5_country_code2 . ?T1 dbo:end_year ?T1_end_year . ?T4 a dbo:institutions . ?T4 dbo:geocode_regions_3 ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T5 dbo:country_code2 ?T5_country_code2 . ?T1 dbo:end_year ?T1_end_year . ?T5 a dbo:countries . ?T4 dbo:country_id ?T5 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T5 dbo:country_code2 ?T5_country_code2 . ?T1 dbo:end_year ?T1_end_year . FILTER(?T5_country_code2 != 'GW' && ?T1_end_year > 2009) . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the cost of Rapid Analysis and Spatialisation Of Risk (RASOR) project assigned to institutions with country code LT and eu territorial unit description Pays de la Loire?",
    "sql_query": "select sum(projects.total_cost) from countries join institutions on countries.unics_id = institutions.country_id join eu_territorial_units on institutions.geocode_regions_3 = eu_territorial_units.geocode_regions join project_members on eu_territorial_units.geocode_regions = project_members.geocode_regions_3 join projects on project_members.project = projects.unics_id where eu_territorial_units.description = 'Pays de la Loire' and projects.title != 'Rapid Analysis and Spatialisation Of Risk (RASOR)' and countries.country_code2 = 'LT'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(4) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(2) T(5) C(2) T(5) V(0) Filter(0) Filter(3) A(0) Op(0) C(13) T(16) C(13) T(16) V(1) Filter(2) A(0) Op(0) C(5) T(1) C(5) T(1) V(2)",
    "sparql_query": "SELECT (sum( ?T1_total_cost) as ?aggregation_T1_total_cost_148 ) WHERE { ?T1 a dbo:projects . ?T14 a dbo:project_members . ?T14 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:description ?T2_description . ?T1 dbo:title ?T1_title . ?T3 dbo:country_code2 ?T3_country_code2 . ?T2 a dbo:eu_territorial_units . ?T14 dbo:geocode_regions_3 ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:description ?T2_description . ?T1 dbo:title ?T1_title . ?T3 dbo:country_code2 ?T3_country_code2 . ?T15 a dbo:institutions . ?T15 dbo:geocode_regions_3 ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:description ?T2_description . ?T1 dbo:title ?T1_title . ?T3 dbo:country_code2 ?T3_country_code2 . ?T3 a dbo:countries . ?T15 dbo:country_id ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:description ?T2_description . ?T1 dbo:title ?T1_title . ?T3 dbo:country_code2 ?T3_country_code2 . FILTER(?T2_description = 'Pays de la Loire' && ?T1_title != 'Rapid Analysis && Spatialisation Of Risk (RASOR)' && ?T3_country_code2 = 'LT') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the average cost of projects assigned to the institute with acronym EURECAT located in Mauritius?",
    "sql_query": "select avg(projects.total_cost) from countries join institutions on countries.unics_id = institutions.country_id join project_members on institutions.unics_id = project_members.institution_id join projects on project_members.project = projects.unics_id where countries.country_name = 'Mauritius' and institutions.acronym = 'EURECAT'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(4) T(1) C(4) T(1) V(0) Filter(2) A(0) Op(0) C(20) T(7) C(20) T(7) V(1)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_187 ) WHERE { ?T1 a dbo:projects . ?T14 a dbo:project_members . ?T14 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:country_name ?T2_country_name . ?T3 dbo:acronym ?T3_acronym . ?T3 a dbo:institutions . ?T14 dbo:institution_id ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:country_name ?T2_country_name . ?T3 dbo:acronym ?T3_acronym . ?T2 a dbo:countries . ?T3 dbo:country_id ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:country_name ?T2_country_name . ?T3 dbo:acronym ?T3_acronym . FILTER(?T2_country_name = 'Mauritius' && ?T3_acronym = 'EURECAT') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the total cost of projects started in 2020 in the subject area of Physical sciences and engineering?",
    "sql_query": "select sum(projects.total_cost) from subject_areas join project_subject_areas on subject_areas.code = project_subject_areas.subject_area join projects on project_subject_areas.project = projects.unics_id where subject_areas.title = 'Physical sciences and engineering' and projects.start_year <= '2020'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(4) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(13) T(17) C(13) T(17) V(0) Filter(6) A(0) Op(0) C(52) T(16) C(52) T(16) V(1)",
    "sparql_query": "SELECT (sum( ?T1_total_cost) as ?aggregation_T1_total_cost_51 ) WHERE { ?T1 a dbo:projects . ?T13 a dbo:project_subject_areas . ?T13 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:title ?T2_title . ?T1 dbo:start_year ?T1_start_year . ?T2 a dbo:subject_areas . ?T13 dbo:subject_area ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:title ?T2_title . ?T1 dbo:start_year ?T1_start_year . FILTER(?T2_title = 'Physical sciences && engineering' && ?T1_start_year <= 2020) . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the total cost of projects that started by 2015 and are not assigned to the department of NXP Semiconductors Netherlands BV?",
    "sql_query": "select sum(projects.total_cost) from project_members join projects on project_members.project = projects.unics_id where project_members.department_name != 'NXP Semiconductors Netherlands BV' and projects.start_year <= '2015'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(4) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(3) A(0) Op(0) C(39) T(12) C(39) T(12) V(0) Filter(6) A(0) Op(0) C(52) T(16) C(52) T(16) V(1)",
    "sparql_query": "SELECT (sum( ?T1_total_cost) as ?aggregation_T1_total_cost_113 ) WHERE { ?T1 a dbo:projects . ?T2 a dbo:project_members . ?T2 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:department_name ?T2_department_name . ?T1 dbo:start_year ?T1_start_year . FILTER(?T2_department_name != 'NXP Semiconductors Netherlands BV' && ?T1_start_year <= 2015) . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Retrieve activity types description of projects members in projects started in 2008 having the topic 'Interaction between people, oceans and seas: a strategic approach towards healthcare and well-being' and the member's department is THE SVEDBERG LABORATORY (TSL).",
    "sql_query": "select activity_types.description from topics join project_topics on topics.code = project_topics.topic join projects on project_topics.project = projects.unics_id join project_members on projects.unics_id = project_members.project join activity_types on project_members.activity_type = activity_types.code where projects.start_year != '2008' and project_members.department_name != 'THE SVEDBERG LABORATORY (TSL)' and topics.title != 'Interaction between people, oceans and seas: a strategic approach towards healthcare and well-being'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(0) Op(0) C(2) T(0) C(2) T(0) Filter(0) Filter(3) A(0) Op(0) C(52) T(16) C(52) T(16) V(0) Filter(0) Filter(3) A(0) Op(0) C(39) T(12) C(39) T(12) V(1) Filter(3) A(0) Op(0) C(13) T(18) C(13) T(18) V(2)",
    "sparql_query": "SELECT ?T1_description WHERE { ?T1 a dbo:activity_types . ?T3 a dbo:project_members . ?T3 dbo:activity_type ?T1 . ?T1 dbo:description ?T1_description . ?T2 dbo:start_year ?T2_start_year . ?T3 dbo:department_name ?T3_department_name . ?T4 dbo:title ?T4_title . ?T2 a dbo:projects . ?T3 dbo:project ?T2 . ?T1 dbo:description ?T1_description . ?T2 dbo:start_year ?T2_start_year . ?T3 dbo:department_name ?T3_department_name . ?T4 dbo:title ?T4_title . ?T15 a dbo:project_topics . ?T15 dbo:project ?T2 . ?T1 dbo:description ?T1_description . ?T2 dbo:start_year ?T2_start_year . ?T3 dbo:department_name ?T3_department_name . ?T4 dbo:title ?T4_title . ?T4 a dbo:topics . ?T15 dbo:topic ?T4 . ?T1 dbo:description ?T1_description . ?T2 dbo:start_year ?T2_start_year . ?T3 dbo:department_name ?T3_department_name . ?T4 dbo:title ?T4_title . FILTER(?T2_start_year != 2008 && ?T3_department_name != 'THE SVEDBERG LABORATORY (TSL)' && ?T4_title != 'Interaction between people, oceans && seas: a strategic approach towards healthcare && well-being') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the average cost of projects with title Modernisation of Vessels for Inland waterway freight Transport that are not assigned to the institution with acronym ICN2 and department Large Systems Business Unit?",
    "sql_query": "select avg(projects.total_cost) from institutions join project_members on institutions.unics_id = project_members.institution_id join projects on project_members.project = projects.unics_id where institutions.acronym != 'ICN2' and projects.title = 'Modernisation of Vessels for Inland waterway freight Transport' and project_members.department_name = 'Large Systems Business Unit'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(3) A(0) Op(0) C(20) T(7) C(20) T(7) V(0) Filter(0) Filter(2) A(0) Op(0) C(13) T(16) C(13) T(16) V(1) Filter(2) A(0) Op(0) C(39) T(12) C(39) T(12) V(2)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_165 ) WHERE { ?T1 a dbo:projects . ?T3 a dbo:project_members . ?T3 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:acronym ?T2_acronym . ?T1 dbo:title ?T1_title . ?T3 dbo:department_name ?T3_department_name . ?T2 a dbo:institutions . ?T3 dbo:institution_id ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:acronym ?T2_acronym . ?T1 dbo:title ?T1_title . ?T3 dbo:department_name ?T3_department_name . FILTER(?T2_acronym != 'ICN2' && ?T1_title = 'Modernisation of Vessels for Inland waterway freight Transport' && ?T3_department_name = 'Large Systems Business Unit') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the average cost of projects assigned to institutions with the acronym EHESS, located in Somalia in the city DUNSTABLE?",
    "sql_query": "select avg(projects.total_cost) from institutions join eu_territorial_units on institutions.geocode_regions_3 = eu_territorial_units.geocode_regions join countries on countries.unics_id = institutions.country_id join project_members on eu_territorial_units.geocode_regions = project_members.geocode_regions_3 join projects on project_members.project = projects.unics_id where countries.country_name = 'Somalia' and project_members.city = 'DUNSTABLE' and institutions.acronym != 'EHESS'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(4) T(1) C(4) T(1) V(0) Filter(0) Filter(2) A(0) Op(0) C(33) T(12) C(33) T(12) V(1) Filter(3) A(0) Op(0) C(20) T(7) C(20) T(7) V(2)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_159 ) WHERE { ?T1 a dbo:projects . ?T2 a dbo:project_members . ?T2 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T5 dbo:country_name ?T5_country_name . ?T2 dbo:city ?T2_city . ?T4 dbo:acronym ?T4_acronym . ?T3 a dbo:eu_territorial_units . ?T2 dbo:geocode_regions_3 ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T5 dbo:country_name ?T5_country_name . ?T2 dbo:city ?T2_city . ?T4 dbo:acronym ?T4_acronym . ?T4 a dbo:institutions . ?T4 dbo:geocode_regions_3 ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T5 dbo:country_name ?T5_country_name . ?T2 dbo:city ?T2_city . ?T4 dbo:acronym ?T4_acronym . ?T5 a dbo:countries . ?T4 dbo:country_id ?T5 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T5 dbo:country_name ?T5_country_name . ?T2 dbo:city ?T2_city . ?T4 dbo:acronym ?T4_acronym . FILTER(?T5_country_name = 'Somalia' && ?T2_city = 'DUNSTABLE' && ?T4_acronym != 'EHESS') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the average cost of projects whose members short name is MIMTech and are not assigned to the institution LIGHTSENSE TECHNOLOGIES LTD?",
    "sql_query": "select avg(projects.total_cost) from eu_territorial_units join project_members on eu_territorial_units.geocode_regions = project_members.geocode_regions_3 join projects on project_members.project = projects.unics_id join institutions on institutions.geocode_regions_3 = eu_territorial_units.geocode_regions where institutions.institutions_name != 'LIGHTSENSE TECHNOLOGIES LTD' and project_members.member_short_name = 'MIMTech'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(3) A(0) Op(0) C(15) T(7) C(15) T(7) V(0) Filter(2) A(0) Op(0) C(38) T(12) C(38) T(12) V(1)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_65 ) WHERE { ?T1 a dbo:projects . ?T4 a dbo:project_members . ?T4 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T2 dbo:institutions_name ?T2_institutions_name . ?T4 dbo:member_short_name ?T4_member_short_name . ?T2 a dbo:institutions . ?T4 dbo:institution_id ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T2 dbo:institutions_name ?T2_institutions_name . ?T4 dbo:member_short_name ?T4_member_short_name . ?T3 a dbo:eu_territorial_units . ?T2 dbo:geocode_regions_3 ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T2 dbo:institutions_name ?T2_institutions_name . ?T4 dbo:member_short_name ?T4_member_short_name . ?T4 a dbo:project_members . ?T4 dbo:geocode_regions_3 ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T2 dbo:institutions_name ?T2_institutions_name . ?T4 dbo:member_short_name ?T4_member_short_name . FILTER(?T2_institutions_name != 'LIGHTSENSE TECHNOLOGIES LTD' && ?T4_member_short_name = 'MIMTech') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "display all panels that have a project whose start year is not 2010.",
    "sql_query": "select erc_panels.description from projects join project_erc_panels on projects.unics_id = project_erc_panels.project join erc_panels on project_erc_panels.panel = erc_panels.code where projects.start_year != '2010'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(0) Op(0) C(2) T(3) C(2) T(3) Filter(3) A(0) Op(0) C(52) T(16) C(52) T(16) V(0)",
    "sparql_query": "SELECT ?T1_description WHERE { ?T1 a dbo:erc_panels . ?T13 a dbo:project_erc_panels . ?T13 dbo:panel ?T1 . ?T1 dbo:description ?T1_description . ?T2 dbo:start_year ?T2_start_year . ?T2 a dbo:projects . ?T13 dbo:project ?T2 . ?T1 dbo:description ?T1_description . ?T2 dbo:start_year ?T2_start_year . FILTER(?T2_start_year != 2010) . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "How many principal investigators are in institutions located in HT with activity type Private for-profit entities (excluding Higher or Secondary Education Establishments)?",
    "sql_query": "select count(distinct people.full_name) from project_members join projects on project_members.project = projects.unics_id join people on projects.principal_investigator = people.unics_id join activity_types on activity_types.code = project_members.activity_type where project_members.country = 'HT' and activity_types.description != 'Private for-profit entities (excluding Higher or Secondary Education Establishments)'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(23) T(8) C(23) T(8) Filter(0) Filter(2) A(0) Op(0) C(31) T(12) C(31) T(12) V(0) Filter(3) A(0) Op(0) C(2) T(0) C(2) T(0) V(1)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_full_name) as ?aggregation_T1_full_name_165 ) WHERE { ?T1 a dbo:people . ?T14 a dbo:projects . ?T14 dbo:principal_investigator ?T1 . ?T1 dbo:full_name ?T1_full_name . ?T2 dbo:country ?T2_country . ?T3 dbo:description ?T3_description . ?T2 a dbo:project_members . ?T2 dbo:project ?T14 . ?T1 dbo:full_name ?T1_full_name . ?T2 dbo:country ?T2_country . ?T3 dbo:description ?T3_description . ?T3 a dbo:activity_types . ?T2 dbo:activity_type ?T3 . ?T1 dbo:full_name ?T1_full_name . ?T2 dbo:country ?T2_country . ?T3 dbo:description ?T3_description . FILTER(?T2_country = 'HT' && ?T3_description != 'Private for-profit entities (excluding Higher || Secondary Education Establishments)') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the total cost of projects started in 2016-11-14 with erc panels description Computer science and informatics?",
    "sql_query": "select sum(projects.total_cost) from erc_panels join project_erc_panels on erc_panels.code = project_erc_panels.panel join projects on project_erc_panels.project = projects.unics_id where projects.start_date > '2016-11-14' and erc_panels.description != 'Computer science and informatics'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(4) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(5) A(0) Op(0) C(50) T(16) C(50) T(16) V(0) Filter(3) A(0) Op(0) C(2) T(3) C(2) T(3) V(1)",
    "sparql_query": "SELECT (sum( ?T1_total_cost) as ?aggregation_T1_total_cost_151 ) WHERE { ?T1 a dbo:projects . ?T13 a dbo:project_erc_panels . ?T13 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T1 dbo:start_date ?T1_start_date . ?T2 dbo:description ?T2_description . ?T2 a dbo:erc_panels . ?T13 dbo:panel ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T1 dbo:start_date ?T1_start_date . ?T2 dbo:description ?T2_description . FILTER(?T1_start_date > '2016-11-14' && ?T2_description != 'Computer science && informatics') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the average cost of projects with title Using Zebrafish as a novel tool to Improve the Diagnosis and Outcome of Marfan Syndrome and have the funding scheme ERANETplus?",
    "sql_query": "select avg(projects.total_cost) from funding_schemes join projects on funding_schemes.code = projects.ec_fund_scheme where funding_schemes.title = 'ERANETplus' and projects.title = 'Using Zebrafish as a novel tool to Improve the Diagnosis and Outcome of Marfan Syndrome'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(13) T(6) C(13) T(6) V(0) Filter(2) A(0) Op(0) C(13) T(16) C(13) T(16) V(1)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_66 ) WHERE { ?T1 a dbo:projects . ?T2 a dbo:funding_schemes . ?T1 dbo:ec_fund_scheme ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:title ?T2_title . ?T1 dbo:title ?T1_title . FILTER(?T2_title = 'ERANETplus' && ?T1_title = 'Using Zebrafish as a novel tool to Improve the Diagnosis && Outcome of Marfan Syndrome') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the average cost of projects started in 2008-09-08, assigned to institutions with country code TR and territorial unit description Buskerud?",
    "sql_query": "select avg(projects.total_cost) from countries join institutions on countries.unics_id = institutions.country_id join eu_territorial_units on institutions.geocode_regions_3 = eu_territorial_units.geocode_regions join project_members on eu_territorial_units.geocode_regions = project_members.geocode_regions_3 join projects on project_members.project = projects.unics_id where countries.country_code2 != 'TR' and eu_territorial_units.description = 'Buskerud' and projects.start_date = '2008-09-08'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(3) A(0) Op(0) C(5) T(1) C(5) T(1) V(0) Filter(0) Filter(2) A(0) Op(0) C(2) T(5) C(2) T(5) V(1) Filter(2) A(0) Op(0) C(50) T(16) C(50) T(16) V(2)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_196 ) WHERE { ?T1 a dbo:projects . ?T14 a dbo:project_members . ?T14 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:country_code2 ?T2_country_code2 . ?T3 dbo:description ?T3_description . ?T1 dbo:start_date ?T1_start_date . ?T15 a dbo:institutions . ?T14 dbo:institution_id ?T15 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:country_code2 ?T2_country_code2 . ?T3 dbo:description ?T3_description . ?T1 dbo:start_date ?T1_start_date . ?T2 a dbo:countries . ?T15 dbo:country_id ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:country_code2 ?T2_country_code2 . ?T3 dbo:description ?T3_description . ?T1 dbo:start_date ?T1_start_date . ?T3 a dbo:eu_territorial_units . ?T15 dbo:geocode_regions_3 ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:country_code2 ?T2_country_code2 . ?T3 dbo:description ?T3_description . ?T1 dbo:start_date ?T1_start_date . FILTER(?T2_country_code2 != 'TR' && ?T3_description = 'Buskerud' && ?T1_start_date = '2008-09-08') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the average cost of projects assigned to institutions located in United States Virgin Islands with territorial unit description Leszczy\u0144ski?",
    "sql_query": "select avg(projects.total_cost) from institutions join eu_territorial_units on institutions.geocode_regions_3 = eu_territorial_units.geocode_regions join project_members on eu_territorial_units.geocode_regions = project_members.geocode_regions_3 join countries on countries.unics_id = institutions.country_id join projects on project_members.project = projects.unics_id where countries.country_name != 'United States Virgin Islands' and eu_territorial_units.description = 'Leszczy\u0144ski'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(3) A(0) Op(0) C(4) T(1) C(4) T(1) V(0) Filter(2) A(0) Op(0) C(2) T(5) C(2) T(5) V(1)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_111 ) WHERE { ?T1 a dbo:projects . ?T14 a dbo:project_members . ?T14 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:country_name ?T2_country_name . ?T3 dbo:description ?T3_description . ?T15 a dbo:institutions . ?T14 dbo:institution_id ?T15 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:country_name ?T2_country_name . ?T3 dbo:description ?T3_description . ?T2 a dbo:countries . ?T15 dbo:country_id ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:country_name ?T2_country_name . ?T3 dbo:description ?T3_description . ?T3 a dbo:eu_territorial_units . ?T15 dbo:geocode_regions_3 ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:country_name ?T2_country_name . ?T3 dbo:description ?T3_description . FILTER(?T2_country_name != 'United States Virgin Islands' && ?T3_description = 'Leszczy\u0144ski') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the total cost of projects that ended before 2007 and don't have a programme with short name Reducing energy consumption and carbon footprint?",
    "sql_query": "select sum(projects.total_cost) from programmes join project_programmes on programmes.code = project_programmes.programme join projects on project_programmes.project = projects.unics_id where programmes.short_name != 'Reducing energy consumption and carbon footprint' and projects.end_year < '2007'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(4) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(3) A(0) Op(0) C(21) T(9) C(21) T(9) V(0) Filter(4) A(0) Op(0) C(53) T(16) C(53) T(16) V(1)",
    "sparql_query": "SELECT (sum( ?T1_total_cost) as ?aggregation_T1_total_cost_62 ) WHERE { ?T1 a dbo:projects . ?T13 a dbo:project_programmes . ?T13 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:short_name ?T2_short_name . ?T1 dbo:end_year ?T1_end_year . ?T2 a dbo:programmes . ?T13 dbo:programme ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:short_name ?T2_short_name . ?T1 dbo:end_year ?T1_end_year . FILTER(?T2_short_name != 'Reducing energy consumption && carbon footprint' && ?T1_end_year < 2007) . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "How many different panels have a project with acronym REFREEPERMAG assigned to the institute ECTRL SOLUTIONS SRL in the city of TROIA?",
    "sql_query": "select count(distinct erc_panels.description) from institutions join project_members on institutions.unics_id = project_members.institution_id join projects on project_members.project = projects.unics_id join project_erc_panels on projects.unics_id = project_erc_panels.project join erc_panels on project_erc_panels.panel = erc_panels.code where project_members.city = 'TROIA' and institutions.institutions_name = 'ECTRL SOLUTIONS SRL' and projects.acronym = 'REFREEPERMAG'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(2) T(3) C(2) T(3) Filter(0) Filter(2) A(0) Op(0) C(33) T(12) C(33) T(12) V(0) Filter(0) Filter(2) A(0) Op(0) C(15) T(7) C(15) T(7) V(1) Filter(2) A(0) Op(0) C(20) T(16) C(20) T(16) V(2)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_description) as ?aggregation_T1_description_8 ) WHERE { ?T1 a dbo:erc_panels . ?T15 a dbo:project_erc_panels . ?T15 dbo:panel ?T1 . ?T1 dbo:description ?T1_description . ?T2 dbo:city ?T2_city . ?T3 dbo:institutions_name ?T3_institutions_name . ?T4 dbo:acronym ?T4_acronym . ?T4 a dbo:projects . ?T15 dbo:project ?T4 . ?T1 dbo:description ?T1_description . ?T2 dbo:city ?T2_city . ?T3 dbo:institutions_name ?T3_institutions_name . ?T4 dbo:acronym ?T4_acronym . ?T2 a dbo:project_members . ?T2 dbo:project ?T4 . ?T1 dbo:description ?T1_description . ?T2 dbo:city ?T2_city . ?T3 dbo:institutions_name ?T3_institutions_name . ?T4 dbo:acronym ?T4_acronym . ?T3 a dbo:institutions . ?T2 dbo:institution_id ?T3 . ?T1 dbo:description ?T1_description . ?T2 dbo:city ?T2_city . ?T3 dbo:institutions_name ?T3_institutions_name . ?T4 dbo:acronym ?T4_acronym . FILTER(?T2_city = 'TROIA' && ?T3_institutions_name = 'ECTRL SOLUTIONS SRL' && ?T4_acronym = 'REFREEPERMAG') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the total cost of projects which belong in the Any research topic covered by the EC FP7 (EC/EP Decision No 1982/2006/EC of 18 December 2006, published in the Official Journal 30.12.2006 L 412) programme and ended before 2014-07-15?",
    "sql_query": "select sum(projects.total_cost) from project_programmes join projects on project_programmes.project = projects.unics_id join programmes on programmes.code = project_programmes.programme where programmes.title = 'Any research topic covered by the EC FP7 (EC/EP Decision No 1982/2006/EC of 18 December 2006, published in the Official Journal 30.12.2006 L 412)' and projects.end_date < '2014-07-15'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(4) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(13) T(9) C(13) T(9) V(0) Filter(4) A(0) Op(0) C(51) T(16) C(51) T(16) V(1)",
    "sparql_query": "SELECT (sum( ?T1_total_cost) as ?aggregation_T1_total_cost_115 ) WHERE { ?T1 a dbo:projects . ?T13 a dbo:project_programmes . ?T13 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:title ?T2_title . ?T1 dbo:end_date ?T1_end_date . ?T2 a dbo:programmes . ?T13 dbo:programme ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:title ?T2_title . ?T1 dbo:end_date ?T1_end_date . FILTER(?T2_title = 'Any research topic covered by the EC FP7 (EC/EP Decision No 1982/2006/EC of 18 December 2006, published in the Official Journal 30.12.2006 L 412)' && ?T1_end_date < '2014-07-15') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the average cost of projects with acronym MONTEX for members in the country BW?",
    "sql_query": "select avg(projects.total_cost) from project_members join projects on project_members.project = projects.unics_id where projects.acronym = 'MONTEX' and project_members.country = 'BW'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(20) T(16) C(20) T(16) V(0) Filter(2) A(0) Op(0) C(31) T(12) C(31) T(12) V(1)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_9 ) WHERE { ?T1 a dbo:projects . ?T2 a dbo:project_members . ?T2 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T1 dbo:acronym ?T1_acronym . ?T2 dbo:country ?T2_country . FILTER(?T1_acronym = 'MONTEX' && ?T2_country = 'BW') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Retrieve all subject areas assigned to projects with a total cost more than 1492828 having the topic \"Bioactive compounds from meso-organism's bioconversion\"?",
    "sql_query": "select distinct subject_areas.title from topics join project_topics on topics.code = project_topics.topic join projects on project_topics.project = projects.unics_id join project_subject_areas on projects.unics_id = project_subject_areas.project join subject_areas on project_subject_areas.subject_area = subject_areas.code where projects.total_cost > '1492828' and topics.title = 'Bioactive compounds from meso-organisms bioconversion'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(13) T(17) C(13) T(17) Filter(0) Filter(5) A(0) Op(0) C(55) T(16) C(55) T(16) V(0) Filter(2) A(0) Op(0) C(13) T(18) C(13) T(18) V(1)",
    "sparql_query": "SELECT DISTINCT ?T1_title WHERE { ?T1 a dbo:subject_areas . ?T14 a dbo:project_subject_areas . ?T14 dbo:subject_area ?T1 . ?T1 dbo:title ?T1_title . ?T2 dbo:total_cost ?T2_total_cost . ?T3 dbo:title ?T3_title . ?T2 a dbo:projects . ?T14 dbo:project ?T2 . ?T1 dbo:title ?T1_title . ?T2 dbo:total_cost ?T2_total_cost . ?T3 dbo:title ?T3_title . ?T15 a dbo:project_topics . ?T15 dbo:project ?T2 . ?T1 dbo:title ?T1_title . ?T2 dbo:total_cost ?T2_total_cost . ?T3 dbo:title ?T3_title . ?T3 a dbo:topics . ?T15 dbo:topic ?T3 . ?T1 dbo:title ?T1_title . ?T2 dbo:total_cost ?T2_total_cost . ?T3 dbo:title ?T3_title . FILTER(?T2_total_cost > 1492828 && ?T3_title = 'Bioactive compounds from meso-organisms bioconversion') . } "
  }
]