[
  {
    "db_id": "cordis_temporary",
    "question": "Count the title of funding schema from Palau with project title \"Monitoring cancer heterogeneity based on the dynamic assessment of the Warburg effect under metabolic perturbation\"",
    "sql_query": "select count(distinct funding_schemes.title) from countries join institutions on countries.unics_id = institutions.country_id join project_members on institutions.unics_id = project_members.institution_id join projects on project_members.project = projects.unics_id join funding_schemes on projects.ec_fund_scheme = funding_schemes.code where countries.country_name = 'Palau' and projects.title = 'Monitoring cancer heterogeneity based on the dynamic assessment of the Warburg effect under metabolic perturbation'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(13) T(6) C(13) T(6) Filter(0) Filter(2) A(0) Op(0) C(4) T(1) C(4) T(1) V(0) Filter(2) A(0) Op(0) C(13) T(16) C(13) T(16) V(1)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_43 ) WHERE { ?T1 a dbo:funding_schemes . ?T3 a dbo:projects . ?T3 dbo:ec_fund_scheme ?T1 . ?T1 dbo:title ?T1_title . ?T2 dbo:country_name ?T2_country_name . ?T3 dbo:title ?T3_title . ?T14 a dbo:project_members . ?T14 dbo:project ?T3 . ?T1 dbo:title ?T1_title . ?T2 dbo:country_name ?T2_country_name . ?T3 dbo:title ?T3_title . ?T15 a dbo:institutions . ?T14 dbo:institution_id ?T15 . ?T1 dbo:title ?T1_title . ?T2 dbo:country_name ?T2_country_name . ?T3 dbo:title ?T3_title . ?T2 a dbo:countries . ?T15 dbo:country_id ?T2 . ?T1 dbo:title ?T1_title . ?T2 dbo:country_name ?T2_country_name . ?T3 dbo:title ?T3_title . FILTER(?T2_country_name = 'Palau' && ?T3_title = 'Monitoring cancer heterogeneity based on the dynamic assessment of the Warburg effect under metabolic perturbation') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Count the number of countries where the institution is ACOBIOM and the country code is AS",
    "sql_query": "select count(distinct countries.country_name) from institutions join countries on institutions.country_id = countries.unics_id where countries.country_code2 = 'AS' and institutions.institutions_name = 'ACOBIOM'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(4) T(1) C(4) T(1) Filter(0) Filter(2) A(0) Op(0) C(5) T(1) C(5) T(1) V(0) Filter(2) A(0) Op(0) C(15) T(7) C(15) T(7) V(1)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_country_name) as ?aggregation_T1_country_name_114 ) WHERE { ?T1 a dbo:countries . ?T2 a dbo:institutions . ?T2 dbo:country_id ?T1 . ?T1 dbo:country_name ?T1_country_name . ?T1 dbo:country_code2 ?T1_country_code2 . ?T2 dbo:institutions_name ?T2_institutions_name . FILTER(?T1_country_code2 = 'AS' && ?T2_institutions_name = 'ACOBIOM') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the total cost of projects that are not in Western Sahara but in Riga and started before 2015-10-07",
    "sql_query": "select count(distinct projects.total_cost) from countries join institutions on countries.unics_id = institutions.country_id join eu_territorial_units on institutions.geocode_regions_3 = eu_territorial_units.geocode_regions join project_members on eu_territorial_units.geocode_regions = project_members.geocode_regions_3 join projects on project_members.project = projects.unics_id where countries.country_name != 'Western Sahara' and eu_territorial_units.description = 'R\u012bga' and projects.start_date <= '2015-10-07'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(3) A(0) Op(0) C(4) T(1) C(4) T(1) V(0) Filter(0) Filter(2) A(0) Op(0) C(2) T(5) C(2) T(5) V(1) Filter(6) A(0) Op(0) C(50) T(16) C(50) T(16) V(2)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_total_cost) as ?aggregation_T1_total_cost_20 ) WHERE { ?T1 a dbo:projects . ?T14 a dbo:project_members . ?T14 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:country_name ?T2_country_name . ?T3 dbo:description ?T3_description . ?T1 dbo:start_date ?T1_start_date . ?T15 a dbo:institutions . ?T14 dbo:institution_id ?T15 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:country_name ?T2_country_name . ?T3 dbo:description ?T3_description . ?T1 dbo:start_date ?T1_start_date . ?T2 a dbo:countries . ?T15 dbo:country_id ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:country_name ?T2_country_name . ?T3 dbo:description ?T3_description . ?T1 dbo:start_date ?T1_start_date . ?T3 a dbo:eu_territorial_units . ?T15 dbo:geocode_regions_3 ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:country_name ?T2_country_name . ?T3 dbo:description ?T3_description . ?T1 dbo:start_date ?T1_start_date . FILTER(?T2_country_name != 'Western Sahara' && ?T3_description = 'R\u012bga' && ?T1_start_date <= '2015-10-07') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Count the panel descriptions of project with total cost greater than 210446 that are not part of the program Specific RTD programme in the field of telematics applications",
    "sql_query": "select count(distinct erc_panels.description) from programmes join project_programmes on programmes.code = project_programmes.programme join projects on project_programmes.project = projects.unics_id join project_erc_panels on projects.unics_id = project_erc_panels.project join erc_panels on project_erc_panels.panel = erc_panels.code where projects.total_cost >= '210446' and programmes.short_name != 'Specific RTD programme in the field of telematics applications'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(2) T(3) C(2) T(3) Filter(0) Filter(7) A(0) Op(0) C(55) T(16) C(55) T(16) V(0) Filter(3) A(0) Op(0) C(21) T(9) C(21) T(9) V(1)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_description) as ?aggregation_T1_description_10 ) WHERE { ?T1 a dbo:erc_panels . ?T14 a dbo:project_erc_panels . ?T14 dbo:panel ?T1 . ?T1 dbo:description ?T1_description . ?T2 dbo:total_cost ?T2_total_cost . ?T3 dbo:short_name ?T3_short_name . ?T2 a dbo:projects . ?T14 dbo:project ?T2 . ?T1 dbo:description ?T1_description . ?T2 dbo:total_cost ?T2_total_cost . ?T3 dbo:short_name ?T3_short_name . ?T15 a dbo:project_programmes . ?T15 dbo:project ?T2 . ?T1 dbo:description ?T1_description . ?T2 dbo:total_cost ?T2_total_cost . ?T3 dbo:short_name ?T3_short_name . ?T3 a dbo:programmes . ?T15 dbo:programme ?T3 . ?T1 dbo:description ?T1_description . ?T2 dbo:total_cost ?T2_total_cost . ?T3 dbo:short_name ?T3_short_name . FILTER(?T2_total_cost >= 210446 && ?T3_short_name != 'Specific RTD programme in the field of telematics applications') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Show me the average cost of all projects with country code BT that started after 2007",
    "sql_query": "select avg(projects.total_cost) from countries join institutions on countries.unics_id = institutions.country_id join eu_territorial_units on institutions.geocode_regions_3 = eu_territorial_units.geocode_regions join project_members on eu_territorial_units.geocode_regions = project_members.geocode_regions_3 join projects on project_members.project = projects.unics_id where countries.country_code2 = 'BT' and projects.start_year > '2007'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(5) T(1) C(5) T(1) V(0) Filter(5) A(0) Op(0) C(52) T(16) C(52) T(16) V(1)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_148 ) WHERE { ?T1 a dbo:projects . ?T2 a dbo:project_members . ?T2 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T5 dbo:country_code2 ?T5_country_code2 . ?T1 dbo:start_year ?T1_start_year . ?T3 a dbo:eu_territorial_units . ?T2 dbo:geocode_regions_3 ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T5 dbo:country_code2 ?T5_country_code2 . ?T1 dbo:start_year ?T1_start_year . ?T4 a dbo:institutions . ?T4 dbo:geocode_regions_3 ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T5 dbo:country_code2 ?T5_country_code2 . ?T1 dbo:start_year ?T1_start_year . ?T5 a dbo:countries . ?T4 dbo:country_id ?T5 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T5 dbo:country_code2 ?T5_country_code2 . ?T1 dbo:start_year ?T1_start_year . FILTER(?T5_country_code2 = 'BT' && ?T1_start_year > 2007) . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What are the title of funding schemes from the institution USJ in the area of Vienna that ended after 2015-02-03",
    "sql_query": "select distinct funding_schemes.title from institutions join project_members on institutions.unics_id = project_members.institution_id join eu_territorial_units on eu_territorial_units.geocode_regions = institutions.geocode_regions_3 join projects on project_members.project = projects.unics_id join funding_schemes on projects.ec_fund_scheme = funding_schemes.code where institutions.acronym = 'USJ' and eu_territorial_units.description = 'Vienne' and projects.end_date >= '2015-02-03'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(13) T(6) C(13) T(6) Filter(0) Filter(2) A(0) Op(0) C(20) T(7) C(20) T(7) V(0) Filter(0) Filter(2) A(0) Op(0) C(2) T(5) C(2) T(5) V(1) Filter(7) A(0) Op(0) C(51) T(16) C(51) T(16) V(2)",
    "sparql_query": "SELECT DISTINCT ?T1_title WHERE { ?T1 a dbo:funding_schemes . ?T4 a dbo:projects . ?T4 dbo:ec_fund_scheme ?T1 . ?T1 dbo:title ?T1_title . ?T2 dbo:acronym ?T2_acronym . ?T3 dbo:description ?T3_description . ?T4 dbo:end_date ?T4_end_date . ?T15 a dbo:project_members . ?T15 dbo:project ?T4 . ?T1 dbo:title ?T1_title . ?T2 dbo:acronym ?T2_acronym . ?T3 dbo:description ?T3_description . ?T4 dbo:end_date ?T4_end_date . ?T2 a dbo:institutions . ?T15 dbo:institution_id ?T2 . ?T1 dbo:title ?T1_title . ?T2 dbo:acronym ?T2_acronym . ?T3 dbo:description ?T3_description . ?T4 dbo:end_date ?T4_end_date . ?T3 a dbo:eu_territorial_units . ?T2 dbo:geocode_regions_3 ?T3 . ?T1 dbo:title ?T1_title . ?T2 dbo:acronym ?T2_acronym . ?T3 dbo:description ?T3_description . ?T4 dbo:end_date ?T4_end_date . ?T15 a dbo:project_members . ?T15 dbo:geocode_regions_3 ?T3 . ?T1 dbo:title ?T1_title . ?T2 dbo:acronym ?T2_acronym . ?T3 dbo:description ?T3_description . ?T4 dbo:end_date ?T4_end_date . FILTER(?T2_acronym = 'USJ' && ?T3_description = 'Vienne' && ?T4_end_date >= '2015-02-03') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Count the title of funding schema in the area of \"Innovation and Technology Transfer\" that did not start on Dec 21, 2011",
    "sql_query": "select count(distinct funding_schemes.title) from project_subject_areas join projects on project_subject_areas.project = projects.unics_id join subject_areas on subject_areas.code = project_subject_areas.subject_area join funding_schemes on projects.ec_fund_scheme = funding_schemes.code where subject_areas.title = 'Innovation and Technology Transfer' and projects.start_date != '2011-12-21'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(13) T(6) C(13) T(6) Filter(0) Filter(2) A(0) Op(0) C(13) T(17) C(13) T(17) V(0) Filter(3) A(0) Op(0) C(50) T(16) C(50) T(16) V(1)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_41 ) WHERE { ?T1 a dbo:funding_schemes . ?T3 a dbo:projects . ?T3 dbo:ec_fund_scheme ?T1 . ?T1 dbo:title ?T1_title . ?T2 dbo:title ?T2_title . ?T3 dbo:start_date ?T3_start_date . ?T14 a dbo:project_subject_areas . ?T14 dbo:project ?T3 . ?T1 dbo:title ?T1_title . ?T2 dbo:title ?T2_title . ?T3 dbo:start_date ?T3_start_date . ?T2 a dbo:subject_areas . ?T14 dbo:subject_area ?T2 . ?T1 dbo:title ?T1_title . ?T2 dbo:title ?T2_title . ?T3 dbo:start_date ?T3_start_date . FILTER(?T2_title = 'Innovation && Technology Transfer' && ?T3_start_date != '2011-12-21') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the average cost of projects from Fundaci\u00f3 Pau Costa in TV and LU",
    "sql_query": "select avg(projects.total_cost) from countries join institutions on countries.unics_id = institutions.country_id join eu_territorial_units on institutions.geocode_regions_3 = eu_territorial_units.geocode_regions join project_members on eu_territorial_units.geocode_regions = project_members.geocode_regions_3 join projects on project_members.project = projects.unics_id where institutions.short_name = 'Fundaci\u00f3 Pau Costa' and countries.country_code2 = 'TV' and project_members.country = 'LU'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(21) T(7) C(21) T(7) V(0) Filter(0) Filter(2) A(0) Op(0) C(5) T(1) C(5) T(1) V(1) Filter(2) A(0) Op(0) C(31) T(12) C(31) T(12) V(2)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_158 ) WHERE { ?T1 a dbo:projects . ?T2 a dbo:project_members . ?T2 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T4 dbo:short_name ?T4_short_name . ?T5 dbo:country_code2 ?T5_country_code2 . ?T2 dbo:country ?T2_country . ?T3 a dbo:eu_territorial_units . ?T2 dbo:geocode_regions_3 ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T4 dbo:short_name ?T4_short_name . ?T5 dbo:country_code2 ?T5_country_code2 . ?T2 dbo:country ?T2_country . ?T4 a dbo:institutions . ?T4 dbo:geocode_regions_3 ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T4 dbo:short_name ?T4_short_name . ?T5 dbo:country_code2 ?T5_country_code2 . ?T2 dbo:country ?T2_country . ?T5 a dbo:countries . ?T4 dbo:country_id ?T5 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T4 dbo:short_name ?T4_short_name . ?T5 dbo:country_code2 ?T5_country_code2 . ?T2 dbo:country ?T2_country . FILTER(?T4_short_name = 'Fundaci\u00f3 Pau Costa' && ?T5_country_code2 = 'TV' && ?T2_country = 'LU') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Show the title of topics in projects with funding scheme 'Large-scale integrating project' that don't have the project acronym MUNDUS",
    "sql_query": "select distinct topics.title from funding_schemes join projects on funding_schemes.code = projects.ec_fund_scheme join project_topics on projects.unics_id = project_topics.project join topics on project_topics.topic = topics.code where funding_schemes.title = 'Large-scale integrating project' and projects.acronym != 'MUNDUS')",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(13) T(18) C(13) T(18) Filter(0) Filter(2) A(0) Op(0) C(13) T(6) C(13) T(6) V(0) Filter(3) A(0) Op(0) C(20) T(16) C(20) T(16) V(1)",
    "sparql_query": "SELECT DISTINCT ?T1_title WHERE { ?T1 a dbo:topics . ?T14 a dbo:project_topics . ?T14 dbo:topic ?T1 . ?T1 dbo:title ?T1_title . ?T2 dbo:title ?T2_title . ?T3 dbo:acronym ?T3_acronym . ?T3 a dbo:projects . ?T14 dbo:project ?T3 . ?T1 dbo:title ?T1_title . ?T2 dbo:title ?T2_title . ?T3 dbo:acronym ?T3_acronym . ?T2 a dbo:funding_schemes . ?T3 dbo:ec_fund_scheme ?T2 . ?T1 dbo:title ?T1_title . ?T2 dbo:title ?T2_title . ?T3 dbo:acronym ?T3_acronym . FILTER(?T2_title = 'Large-scale integrating project' && ?T3_acronym != 'MUNDUS') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the cost of all projects with title Space and satellite research that have the acronym ABSREF",
    "sql_query": "select sum(projects.total_cost) from project_subject_areas join projects on project_subject_areas.project = projects.unics_id join subject_areas on subject_areas.code = project_subject_areas.subject_area where subject_areas.title = 'Space and satellite research' and projects.acronym = 'ABSREF'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(4) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(13) T(17) C(13) T(17) V(0) Filter(2) A(0) Op(0) C(20) T(16) C(20) T(16) V(1)",
    "sparql_query": "SELECT (sum( ?T1_total_cost) as ?aggregation_T1_total_cost_69 ) WHERE { ?T1 a dbo:projects . ?T13 a dbo:project_subject_areas . ?T13 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:title ?T2_title . ?T1 dbo:acronym ?T1_acronym . ?T2 a dbo:subject_areas . ?T13 dbo:subject_area ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:title ?T2_title . ?T1 dbo:acronym ?T1_acronym . FILTER(?T2_title = 'Space && satellite research' && ?T1_acronym = 'ABSREF') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the total cost of all projects that do not have the country code TT with members from Newtec Belgium but are not from \u041b\u043e\u0432\u0435\u0447",
    "sql_query": "select sum(projects.total_cost) from project_members join projects on project_members.project = projects.unics_id join eu_territorial_units on eu_territorial_units.geocode_regions = project_members.geocode_regions_3 join institutions on institutions.geocode_regions_3 = eu_territorial_units.geocode_regions join countries on countries.unics_id = institutions.country_id where countries.country_code2 != 'TT' and project_members.member_short_name != 'Newtec Belgium' and eu_territorial_units.description != '\u041b\u043e\u0432\u0435\u0447'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(4) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(3) A(0) Op(0) C(5) T(1) C(5) T(1) V(0) Filter(0) Filter(3) A(0) Op(0) C(38) T(12) C(38) T(12) V(1) Filter(3) A(0) Op(0) C(2) T(5) C(2) T(5) V(2)",
    "sparql_query": "SELECT (sum( ?T1_total_cost) as ?aggregation_T1_total_cost_141 ) WHERE { ?T1 a dbo:projects . ?T3 a dbo:project_members . ?T3 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:country_code2 ?T2_country_code2 . ?T3 dbo:member_short_name ?T3_member_short_name . ?T4 dbo:description ?T4_description . ?T15 a dbo:institutions . ?T3 dbo:institution_id ?T15 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:country_code2 ?T2_country_code2 . ?T3 dbo:member_short_name ?T3_member_short_name . ?T4 dbo:description ?T4_description . ?T2 a dbo:countries . ?T15 dbo:country_id ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:country_code2 ?T2_country_code2 . ?T3 dbo:member_short_name ?T3_member_short_name . ?T4 dbo:description ?T4_description . ?T4 a dbo:eu_territorial_units . ?T3 dbo:geocode_regions_3 ?T4 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:country_code2 ?T2_country_code2 . ?T3 dbo:member_short_name ?T3_member_short_name . ?T4 dbo:description ?T4_description . FILTER(?T2_country_code2 != 'TT' && ?T3_member_short_name != 'Newtec Belgium' && ?T4_description != '\u041b\u043e\u0432\u0435\u0447') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Show the different country name of projects from the city Schrobenhausen of KLINIKUM AUGSBURG KOMMUNALUNTERNEHMEN with country code NU",
    "sql_query": "select distinct countries.country_name from project_members join institutions on project_members.institution_id = institutions.unics_id join countries on institutions.country_id = countries.unics_id where project_members.city = 'Schrobenhausen' and institutions.institutions_name = 'KLINIKUM AUGSBURG KOMMUNALUNTERNEHMEN' and countries.country_code2 = 'NU'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(4) T(1) C(4) T(1) Filter(0) Filter(2) A(0) Op(0) C(33) T(12) C(33) T(12) V(0) Filter(0) Filter(2) A(0) Op(0) C(15) T(7) C(15) T(7) V(1) Filter(2) A(0) Op(0) C(5) T(1) C(5) T(1) V(2)",
    "sparql_query": "SELECT DISTINCT ?T1_country_name WHERE { ?T1 a dbo:countries . ?T3 a dbo:institutions . ?T3 dbo:country_id ?T1 . ?T1 dbo:country_name ?T1_country_name . ?T2 dbo:city ?T2_city . ?T3 dbo:institutions_name ?T3_institutions_name . ?T1 dbo:country_code2 ?T1_country_code2 . ?T2 a dbo:project_members . ?T2 dbo:institution_id ?T3 . ?T1 dbo:country_name ?T1_country_name . ?T2 dbo:city ?T2_city . ?T3 dbo:institutions_name ?T3_institutions_name . ?T1 dbo:country_code2 ?T1_country_code2 . FILTER(?T2_city = 'Schrobenhausen' && ?T3_institutions_name = 'KLINIKUM AUGSBURG KOMMUNALUNTERNEHMEN' && ?T1_country_code2 = 'NU') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Show the names of people with projects whose acronym is ARETE and whose programme is not in Food, agriculture, forestry, marine research and bioeconomy",
    "sql_query": "select count(distinct people.full_name) from programmes join project_programmes on programmes.code = project_programmes.programme join projects on project_programmes.project = projects.unics_id join people on projects.principal_investigator = people.unics_id where projects.acronym = 'ARETE' and programmes.short_name != 'Food, agriculture, forestry, marine research and bioeconomy'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(23) T(8) C(23) T(8) Filter(0) Filter(2) A(0) Op(0) C(20) T(16) C(20) T(16) V(0) Filter(3) A(0) Op(0) C(21) T(9) C(21) T(9) V(1)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_full_name) as ?aggregation_T1_full_name_53 ) WHERE { ?T1 a dbo:people . ?T2 a dbo:projects . ?T2 dbo:principal_investigator ?T1 . ?T1 dbo:full_name ?T1_full_name . ?T2 dbo:acronym ?T2_acronym . ?T3 dbo:short_name ?T3_short_name . ?T14 a dbo:project_programmes . ?T14 dbo:project ?T2 . ?T1 dbo:full_name ?T1_full_name . ?T2 dbo:acronym ?T2_acronym . ?T3 dbo:short_name ?T3_short_name . ?T3 a dbo:programmes . ?T14 dbo:programme ?T3 . ?T1 dbo:full_name ?T1_full_name . ?T2 dbo:acronym ?T2_acronym . ?T3 dbo:short_name ?T3_short_name . FILTER(?T2_acronym = 'ARETE' && ?T3_short_name != 'Food, agriculture, forestry, marine research && bioeconomy') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Show me the subject area of projects from CENTAR ZA KULTURU VELA LUKA that did not start in 2011 in ROSCOFF",
    "sql_query": "select distinct subject_areas.title from project_members join projects on project_members.project = projects.unics_id join project_subject_areas on projects.unics_id = project_subject_areas.project join subject_areas on project_subject_areas.subject_area = subject_areas.code join institutions on institutions.unics_id = project_members.institution_id where projects.start_year != '2011' and project_members.city = 'ROSCOFF' and institutions.institutions_name = 'CENTAR ZA KULTURU VELA LUKA'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(13) T(17) C(13) T(17) Filter(0) Filter(3) A(0) Op(0) C(52) T(16) C(52) T(16) V(0) Filter(0) Filter(2) A(0) Op(0) C(33) T(12) C(33) T(12) V(1) Filter(2) A(0) Op(0) C(15) T(7) C(15) T(7) V(2)",
    "sparql_query": "SELECT DISTINCT ?T1_title WHERE { ?T1 a dbo:subject_areas . ?T15 a dbo:project_subject_areas . ?T15 dbo:subject_area ?T1 . ?T1 dbo:title ?T1_title . ?T2 dbo:start_year ?T2_start_year . ?T3 dbo:city ?T3_city . ?T4 dbo:institutions_name ?T4_institutions_name . ?T2 a dbo:projects . ?T15 dbo:project ?T2 . ?T1 dbo:title ?T1_title . ?T2 dbo:start_year ?T2_start_year . ?T3 dbo:city ?T3_city . ?T4 dbo:institutions_name ?T4_institutions_name . ?T3 a dbo:project_members . ?T3 dbo:project ?T2 . ?T1 dbo:title ?T1_title . ?T2 dbo:start_year ?T2_start_year . ?T3 dbo:city ?T3_city . ?T4 dbo:institutions_name ?T4_institutions_name . ?T4 a dbo:institutions . ?T3 dbo:institution_id ?T4 . ?T1 dbo:title ?T1_title . ?T2 dbo:start_year ?T2_start_year . ?T3 dbo:city ?T3_city . ?T4 dbo:institutions_name ?T4_institutions_name . FILTER(?T2_start_year != 2011 && ?T3_city = 'ROSCOFF' && ?T4_institutions_name = 'CENTAR ZA KULTURU VELA LUKA') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the average cost of all projects of countries with code IE and territorial unit Bad Kreuznach",
    "sql_query": "select avg(projects.total_cost) from project_members join projects on project_members.project = projects.unics_id join eu_territorial_units on eu_territorial_units.geocode_regions = project_members.geocode_regions_3 where eu_territorial_units.description = 'Bad Kreuznach' and project_members.country = 'IE'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(2) T(5) C(2) T(5) V(0) Filter(2) A(0) Op(0) C(31) T(12) C(31) T(12) V(1)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_167 ) WHERE { ?T1 a dbo:projects . ?T3 a dbo:project_members . ?T3 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:description ?T2_description . ?T3 dbo:country ?T3_country . ?T2 a dbo:eu_territorial_units . ?T3 dbo:geocode_regions_3 ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:description ?T2_description . ?T3 dbo:country ?T3_country . FILTER(?T2_description = 'Bad Kreuznach' && ?T3_country = 'IE') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Show me the average costs of projects with projects members from the EU territorial unit \"Sheffield\". The projects I am looking for a should have ended latest by 17.11.2010 and the project member should not be from department \"Agrotechnology and Food Science Group\"",
    "sql_query": "select avg(projects.total_cost) from eu_territorial_units join project_members on eu_territorial_units.geocode_regions = project_members.geocode_regions_3 join projects on project_members.project = projects.unics_id where eu_territorial_units.description = 'Sheffield' and project_members.department_name != 'Agrotechnology and Food Science Group' and projects.end_date <= '2010-11-17'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(2) T(5) C(2) T(5) V(0) Filter(0) Filter(3) A(0) Op(0) C(39) T(12) C(39) T(12) V(1) Filter(6) A(0) Op(0) C(51) T(16) C(51) T(16) V(2)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_11 ) WHERE { ?T1 a dbo:projects . ?T3 a dbo:project_members . ?T3 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:description ?T2_description . ?T3 dbo:department_name ?T3_department_name . ?T1 dbo:end_date ?T1_end_date . ?T2 a dbo:eu_territorial_units . ?T3 dbo:geocode_regions_3 ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:description ?T2_description . ?T3 dbo:department_name ?T3_department_name . ?T1 dbo:end_date ?T1_end_date . FILTER(?T2_description = 'Sheffield' && ?T3_department_name != 'Agrotechnology && Food Science Group' && ?T1_end_date <= '2010-11-17') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Count all distinct (by their full name) people which are principal investigators in a project with subject area \u201cClean coal technologies\u201d. The project acronym shall further not be CorticALS.",
    "sql_query": "select count(distinct people.full_name) from subject_areas join project_subject_areas on subject_areas.code = project_subject_areas.subject_area join projects on project_subject_areas.project = projects.unics_id join people on projects.principal_investigator = people.unics_id where projects.acronym != 'CorticALS' and subject_areas.title = 'Clean coal technologies'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(23) T(8) C(23) T(8) Filter(0) Filter(3) A(0) Op(0) C(20) T(16) C(20) T(16) V(0) Filter(2) A(0) Op(0) C(13) T(17) C(13) T(17) V(1)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_full_name) as ?aggregation_T1_full_name_9 ) WHERE { ?T1 a dbo:people . ?T2 a dbo:projects . ?T2 dbo:principal_investigator ?T1 . ?T1 dbo:full_name ?T1_full_name . ?T2 dbo:acronym ?T2_acronym . ?T3 dbo:title ?T3_title . ?T14 a dbo:project_subject_areas . ?T14 dbo:project ?T2 . ?T1 dbo:full_name ?T1_full_name . ?T2 dbo:acronym ?T2_acronym . ?T3 dbo:title ?T3_title . ?T3 a dbo:subject_areas . ?T14 dbo:subject_area ?T3 . ?T1 dbo:full_name ?T1_full_name . ?T2 dbo:acronym ?T2_acronym . ?T3 dbo:title ?T3_title . FILTER(?T2_acronym != 'CorticALS' && ?T3_title = 'Clean coal technologies') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Show me the sum of all costs from projects with subject area \u201cFood\u201d and project title \u201cInnovative plasma based transformation of food waste into high value graphitic carbon and renewable hydrogen\u201d",
    "sql_query": "select sum(projects.total_cost) from subject_areas join project_subject_areas on subject_areas.code = project_subject_areas.subject_area join projects on project_subject_areas.project = projects.unics_id where subject_areas.title = 'Food' and projects.title = 'Innovative plasma based transformation of food waste into high value graphitic carbon and renewable hydrogen'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(4) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(13) T(17) C(13) T(17) V(0) Filter(2) A(0) Op(0) C(13) T(16) C(13) T(16) V(1)",
    "sparql_query": "SELECT (sum( ?T1_total_cost) as ?aggregation_T1_total_cost_137 ) WHERE { ?T1 a dbo:projects . ?T13 a dbo:project_subject_areas . ?T13 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:title ?T2_title . ?T1 dbo:title ?T1_title . ?T2 a dbo:subject_areas . ?T13 dbo:subject_area ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:title ?T2_title . ?T1 dbo:title ?T1_title . FILTER(?T2_title = 'Food' && ?T1_title = 'Innovative plasma based transformation of food waste into high value graphitic carbon && renewable hydrogen') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Show me the name of principal investigators in a project having a project member with activity type description different from \u201cPublic bodies (excluding Research Organisations and Secondary or Higher Education Establishments)\u201d and a project end year different from 2017.",
    "sql_query": "select distinct people.full_name from project_members join projects on project_members.project = projects.unics_id join activity_types on activity_types.code = project_members.activity_type join people on projects.principal_investigator = people.unics_id where activity_types.description != 'Public bodies (excluding Research Organisations and Secondary or Higher Education Establishments)' and projects.end_year != '2017'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(23) T(8) C(23) T(8) Filter(0) Filter(3) A(0) Op(0) C(2) T(0) C(2) T(0) V(0) Filter(3) A(0) Op(0) C(53) T(16) C(53) T(16) V(1)",
    "sparql_query": "SELECT DISTINCT ?T1_full_name WHERE { ?T1 a dbo:people . ?T3 a dbo:projects . ?T3 dbo:principal_investigator ?T1 . ?T1 dbo:full_name ?T1_full_name . ?T2 dbo:description ?T2_description . ?T3 dbo:end_year ?T3_end_year . ?T14 a dbo:project_members . ?T14 dbo:project ?T3 . ?T1 dbo:full_name ?T1_full_name . ?T2 dbo:description ?T2_description . ?T3 dbo:end_year ?T3_end_year . ?T2 a dbo:activity_types . ?T14 dbo:activity_type ?T2 . ?T1 dbo:full_name ?T1_full_name . ?T2 dbo:description ?T2_description . ?T3 dbo:end_year ?T3_end_year . FILTER(?T2_description != 'Public bodies (excluding Research Organisations && Secondary || Higher Education Establishments)' && ?T3_end_year != 2017) . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Count all distinct titles of topics used in projects.",
    "sql_query": "select count(distinct topics.title) from project_topics join topics on project_topics.topic = topics.code ",
    "semql_query": "Root1(3) Root(5) Sel(1) N(0) A(3) Op(0) C(13) T(18) C(13) T(18)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_158 ) WHERE { ?T1 a dbo:topics . ?T2 a dbo:project_topics . ?T2 dbo:topic ?T1 . ?T1 dbo:title ?T1_title . ?T1 dbo:code ?T1_code . } "
  }
]