[
  {
    "db_id": "cordis_temporary",
    "question": "Show the total cost of projects in which participates an insitutions named UTC and located in Nepal",
    "sql_query": "select sum(projects.total_cost) from project_members join projects on project_members.project = projects.unics_id join institutions on institutions.unics_id = project_members.institution_id join countries on countries.unics_id = institutions.country_id where countries.country_name = 'Nepal' and institutions.short_name = 'UTC'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(4) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(4) T(1) C(4) T(1) V(0) Filter(2) A(0) Op(0) C(21) T(7) C(21) T(7) V(1)",
    "sparql_query": "SELECT (sum( ?T1_total_cost) as ?aggregation_T1_total_cost_164 ) WHERE { ?T1 a dbo:projects . ?T14 a dbo:project_members . ?T14 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:country_name ?T2_country_name . ?T3 dbo:short_name ?T3_short_name . ?T3 a dbo:institutions . ?T14 dbo:institution_id ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:country_name ?T2_country_name . ?T3 dbo:short_name ?T3_short_name . ?T2 a dbo:countries . ?T3 dbo:country_id ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:country_name ?T2_country_name . ?T3 dbo:short_name ?T3_short_name . FILTER(?T2_country_name = 'Nepal' && ?T3_short_name = 'UTC') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Show the total cost of projects that end on \"2017-07-13\" and have a participant located in \"Wilhelmshaven, Kreisfreie Stadt\"",
    "sql_query": "select sum(projects.total_cost) from institutions join project_members on institutions.unics_id = project_members.institution_id join eu_territorial_units on eu_territorial_units.geocode_regions = institutions.geocode_regions_3 join projects on project_members.project = projects.unics_id where eu_territorial_units.description = 'Wilhelmshaven, Kreisfreie Stadt' and projects.end_date = '2017-07-13'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(4) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(2) T(5) C(2) T(5) V(0) Filter(2) A(0) Op(0) C(51) T(16) C(51) T(16) V(1)",
    "sparql_query": "SELECT (sum( ?T1_total_cost) as ?aggregation_T1_total_cost_21 ) WHERE { ?T1 a dbo:projects . ?T4 a dbo:project_members . ?T4 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions ?T2_geocode_regions . ?T4 dbo:institution_id ?T4_institution_id . ?T2 dbo:description ?T2_description . ?T1 dbo:end_date ?T1_end_date . ?T2 a dbo:eu_territorial_units . ?T4 dbo:geocode_regions_3 ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions ?T2_geocode_regions . ?T4 dbo:institution_id ?T4_institution_id . ?T2 dbo:description ?T2_description . ?T1 dbo:end_date ?T1_end_date . ?T3 a dbo:institutions . ?T3 dbo:geocode_regions_3 ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions ?T2_geocode_regions . ?T4 dbo:institution_id ?T4_institution_id . ?T2 dbo:description ?T2_description . ?T1 dbo:end_date ?T1_end_date . ?T4 a dbo:project_members . ?T4 dbo:institution_id ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions ?T2_geocode_regions . ?T4 dbo:institution_id ?T4_institution_id . ?T2 dbo:description ?T2_description . ?T1 dbo:end_date ?T1_end_date . FILTER(?T2_description = 'Wilhelmshaven, Kreisfreie Stadt' && ?T1_end_date = '2017-07-13') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Select topics for ERC projects that end after \"2018-12-01\" and fall under the panel \"Applied life sciences and biotechnology\"",
    "sql_query": "select topics.title from projects join project_topics on projects.unics_id = project_topics.project join project_erc_panels on project_erc_panels.project = projects.unics_id join topics on project_topics.topic = topics.code join erc_panels on erc_panels.code = project_erc_panels.panel where erc_panels.description = 'Applied life sciences and biotechnology' and projects.end_date > '2018-12-01'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(0) Op(0) C(13) T(18) C(13) T(18) Filter(0) Filter(2) A(0) Op(0) C(2) T(3) C(2) T(3) V(0) Filter(5) A(0) Op(0) C(51) T(16) C(51) T(16) V(1)",
    "sparql_query": "SELECT ?T1_title WHERE { ?T1 a dbo:topics . ?T14 a dbo:project_topics . ?T14 dbo:topic ?T1 . ?T1 dbo:title ?T1_title . ?T2 dbo:description ?T2_description . ?T3 dbo:end_date ?T3_end_date . ?T3 a dbo:projects . ?T14 dbo:project ?T3 . ?T1 dbo:title ?T1_title . ?T2 dbo:description ?T2_description . ?T3 dbo:end_date ?T3_end_date . ?T15 a dbo:project_erc_panels . ?T15 dbo:project ?T3 . ?T1 dbo:title ?T1_title . ?T2 dbo:description ?T2_description . ?T3 dbo:end_date ?T3_end_date . ?T2 a dbo:erc_panels . ?T15 dbo:panel ?T2 . ?T1 dbo:title ?T1_title . ?T2 dbo:description ?T2_description . ?T3 dbo:end_date ?T3_end_date . FILTER(?T2_description = 'Applied life sciences && biotechnology' && ?T3_end_date > '2018-12-01') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Show the total cost of projects within the topic \"Integrated approach to lowering aircraft external noise\" that ended before 2018",
    "sql_query": "select sum(projects.total_cost) from topics join project_topics on topics.code = project_topics.topic join projects on project_topics.project = projects.unics_id where topics.title != 'Integrated approach to lowering aircraft external noise' and projects.end_year < '2018'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(4) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(3) A(0) Op(0) C(13) T(18) C(13) T(18) V(0) Filter(4) A(0) Op(0) C(53) T(16) C(53) T(16) V(1)",
    "sparql_query": "SELECT (sum( ?T1_total_cost) as ?aggregation_T1_total_cost_113 ) WHERE { ?T1 a dbo:projects . ?T13 a dbo:project_topics . ?T13 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:title ?T2_title . ?T1 dbo:end_year ?T1_end_year . ?T2 a dbo:topics . ?T13 dbo:topic ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:title ?T2_title . ?T1 dbo:end_year ?T1_end_year . FILTER(?T2_title != 'Integrated approach to lowering aircraft external noise' && ?T1_end_year < 2018) . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Show the countries that participate in projects that end in or after 2007 and have a funding scheme different from \"Integrating activities implemented as Integrated Infrastructure Initiatives\"",
    "sql_query": "select distinct countries.country_name from projects join project_members on projects.unics_id = project_members.project join funding_schemes on funding_schemes.code = projects.ec_fund_scheme join institutions on project_members.institution_id = institutions.unics_id join countries on institutions.country_id = countries.unics_id where projects.end_year >= '2007' and funding_schemes.title != 'Integrating activities implemented as Integrated Infrastructure Initiatives'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(4) T(1) C(4) T(1) Filter(0) Filter(7) A(0) Op(0) C(53) T(16) C(53) T(16) V(0) Filter(3) A(0) Op(0) C(13) T(6) C(13) T(6) V(1)",
    "sparql_query": "SELECT DISTINCT ?T1_country_name WHERE { ?T1 a dbo:countries . ?T14 a dbo:institutions . ?T14 dbo:country_id ?T1 . ?T1 dbo:country_name ?T1_country_name . ?T2 dbo:end_year ?T2_end_year . ?T3 dbo:title ?T3_title . ?T15 a dbo:project_members . ?T15 dbo:institution_id ?T14 . ?T1 dbo:country_name ?T1_country_name . ?T2 dbo:end_year ?T2_end_year . ?T3 dbo:title ?T3_title . ?T2 a dbo:projects . ?T15 dbo:project ?T2 . ?T1 dbo:country_name ?T1_country_name . ?T2 dbo:end_year ?T2_end_year . ?T3 dbo:title ?T3_title . ?T3 a dbo:funding_schemes . ?T2 dbo:ec_fund_scheme ?T3 . ?T1 dbo:country_name ?T1_country_name . ?T2 dbo:end_year ?T2_end_year . ?T3 dbo:title ?T3_title . FILTER(?T2_end_year >= 2007 && ?T3_title != 'Integrating activities implemented as Integrated Infrastructure Initiatives') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Show the starting year of projects that end in or after 2007 and correspond to the subject area \"Other Technology\"",
    "sql_query": "select distinct projects.start_year from project_subject_areas join projects on project_subject_areas.project = projects.unics_id join subject_areas on subject_areas.code = project_subject_areas.subject_area where subject_areas.title = 'Other Technology' and projects.end_year >= '2007'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(52) T(16) C(52) T(16) Filter(0) Filter(2) A(0) Op(0) C(13) T(17) C(13) T(17) V(0) Filter(7) A(0) Op(0) C(53) T(16) C(53) T(16) V(1)",
    "sparql_query": "SELECT DISTINCT ?T1_start_year WHERE { ?T1 a dbo:projects . ?T13 a dbo:project_subject_areas . ?T13 dbo:project ?T1 . ?T1 dbo:start_year ?T1_start_year . ?T2 dbo:title ?T2_title . ?T1 dbo:end_year ?T1_end_year . ?T2 a dbo:subject_areas . ?T13 dbo:subject_area ?T2 . ?T1 dbo:start_year ?T1_start_year . ?T2 dbo:title ?T2_title . ?T1 dbo:end_year ?T1_end_year . FILTER(?T2_title = 'Other Technology' && ?T1_end_year >= 2007) . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Show the average total cost of ERC projects that started after 2013 and fall under a panel different from \"Mathematical foundations\"",
    "sql_query": "select avg(projects.total_cost) from project_erc_panels join projects on project_erc_panels.project = projects.unics_id join erc_panels on erc_panels.code = project_erc_panels.panel where erc_panels.description != 'Mathematical foundations' and projects.start_year > '2013'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(3) A(0) Op(0) C(2) T(3) C(2) T(3) V(0) Filter(5) A(0) Op(0) C(52) T(16) C(52) T(16) V(1)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_71 ) WHERE { ?T1 a dbo:projects . ?T13 a dbo:project_erc_panels . ?T13 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:description ?T2_description . ?T1 dbo:start_year ?T1_start_year . ?T2 a dbo:erc_panels . ?T13 dbo:panel ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:description ?T2_description . ?T1 dbo:start_year ?T1_start_year . FILTER(?T2_description != 'Mathematical foundations' && ?T1_start_year > 2013) . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Show the number of distinct topics of projects with a total cost of 498750 euros whose principal investigator is \"Matthias Schneider\"",
    "sql_query": "select count(distinct topics.title) from projects join project_topics on projects.unics_id = project_topics.project join people on people.unics_id = projects.principal_investigator join topics on project_topics.topic = topics.code where people.full_name = 'Matthias Schneider' and projects.total_cost = '498750'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(13) T(18) C(13) T(18) Filter(0) Filter(2) A(0) Op(0) C(23) T(8) C(23) T(8) V(0) Filter(2) A(0) Op(0) C(55) T(16) C(55) T(16) V(1)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_110 ) WHERE { ?T1 a dbo:topics . ?T14 a dbo:project_topics . ?T14 dbo:topic ?T1 . ?T1 dbo:title ?T1_title . ?T2 dbo:full_name ?T2_full_name . ?T3 dbo:total_cost ?T3_total_cost . ?T3 a dbo:projects . ?T14 dbo:project ?T3 . ?T1 dbo:title ?T1_title . ?T2 dbo:full_name ?T2_full_name . ?T3 dbo:total_cost ?T3_total_cost . ?T2 a dbo:people . ?T3 dbo:principal_investigator ?T2 . ?T1 dbo:title ?T1_title . ?T2 dbo:full_name ?T2_full_name . ?T3 dbo:total_cost ?T3_total_cost . FILTER(?T2_full_name = 'Matthias Schneider' && ?T3_total_cost = 498750) . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Get subject areas of projects that ended in or before \"2014-08-18\" and have a participant from a city named \"BOVA\" in a region different from \"Vulkaneifel\" ",
    "sql_query": "select subject_areas.title from project_members join projects on project_members.project = projects.unics_id join project_subject_areas on projects.unics_id = project_subject_areas.project join eu_territorial_units on eu_territorial_units.geocode_regions = project_members.geocode_regions_3 join subject_areas on project_subject_areas.subject_area = subject_areas.code where project_members.city = 'BOVA' and eu_territorial_units.description != 'Vulkaneifel' and projects.end_date <= '2014-08-18'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(0) Op(0) C(13) T(17) C(13) T(17) Filter(0) Filter(2) A(0) Op(0) C(33) T(12) C(33) T(12) V(0) Filter(0) Filter(3) A(0) Op(0) C(2) T(5) C(2) T(5) V(1) Filter(6) A(0) Op(0) C(51) T(16) C(51) T(16) V(2)",
    "sparql_query": "SELECT ?T1_title WHERE { ?T1 a dbo:subject_areas . ?T15 a dbo:project_subject_areas . ?T15 dbo:subject_area ?T1 . ?T1 dbo:title ?T1_title . ?T2 dbo:city ?T2_city . ?T3 dbo:description ?T3_description . ?T4 dbo:end_date ?T4_end_date . ?T4 a dbo:projects . ?T15 dbo:project ?T4 . ?T1 dbo:title ?T1_title . ?T2 dbo:city ?T2_city . ?T3 dbo:description ?T3_description . ?T4 dbo:end_date ?T4_end_date . ?T2 a dbo:project_members . ?T2 dbo:project ?T4 . ?T1 dbo:title ?T1_title . ?T2 dbo:city ?T2_city . ?T3 dbo:description ?T3_description . ?T4 dbo:end_date ?T4_end_date . ?T3 a dbo:eu_territorial_units . ?T2 dbo:geocode_regions_3 ?T3 . ?T1 dbo:title ?T1_title . ?T2 dbo:city ?T2_city . ?T3 dbo:description ?T3_description . ?T4 dbo:end_date ?T4_end_date . FILTER(?T2_city = 'BOVA' && ?T3_description != 'Vulkaneifel' && ?T4_end_date <= '2014-08-18') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Show the average total cost of projects that started in or after 2019 and have a participant named \"ECP\" from a city different than \"KOSTELEC NAD ORLICI\"",
    "sql_query": "select avg(projects.total_cost) from project_members join projects on project_members.project = projects.unics_id join institutions on institutions.unics_id = project_members.institution_id where project_members.city != 'KOSTELEC NAD ORLICI' and institutions.short_name = 'ECP' and projects.start_year >= '2019'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(3) A(0) Op(0) C(33) T(12) C(33) T(12) V(0) Filter(0) Filter(2) A(0) Op(0) C(21) T(7) C(21) T(7) V(1) Filter(7) A(0) Op(0) C(52) T(16) C(52) T(16) V(2)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_77 ) WHERE { ?T1 a dbo:projects . ?T2 a dbo:project_members . ?T2 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:city ?T2_city . ?T3 dbo:short_name ?T3_short_name . ?T1 dbo:start_year ?T1_start_year . ?T3 a dbo:institutions . ?T2 dbo:institution_id ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:city ?T2_city . ?T3 dbo:short_name ?T3_short_name . ?T1 dbo:start_year ?T1_start_year . FILTER(?T2_city != 'KOSTELEC NAD ORLICI' && ?T3_short_name = 'ECP' && ?T1_start_year >= 2019) . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Show the average total cost of projects that involve the department \"Finance Office / National Archives of Hungary\" from the region \"Vzhodna Slovenija\"",
    "sql_query": "select avg(projects.total_cost) from eu_territorial_units join project_members on eu_territorial_units.geocode_regions = project_members.geocode_regions_3 join projects on project_members.project = projects.unics_id where eu_territorial_units.description = 'Vzhodna Slovenija' and project_members.department_name = 'Finance Office / National Archives of Hungary'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(2) T(5) C(2) T(5) V(0) Filter(2) A(0) Op(0) C(39) T(12) C(39) T(12) V(1)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_47 ) WHERE { ?T1 a dbo:projects . ?T3 a dbo:project_members . ?T3 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:description ?T2_description . ?T3 dbo:department_name ?T3_department_name . ?T2 a dbo:eu_territorial_units . ?T3 dbo:geocode_regions_3 ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:description ?T2_description . ?T3 dbo:department_name ?T3_department_name . FILTER(?T2_description = 'Vzhodna Slovenija' && ?T3_department_name = 'Finance Office / National Archives of Hungary') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Show the number of ERC panels of projects that end after 2018 and have a participant  named \"SYNARC SAS\" from the city of \"NANCY\"",
    "sql_query": "select count(distinct erc_panels.description) from project_members join projects on project_members.project = projects.unics_id join project_erc_panels on projects.unics_id = project_erc_panels.project join institutions on institutions.unics_id = project_members.institution_id join erc_panels on project_erc_panels.panel = erc_panels.code where institutions.institutions_name = 'SYNARC SAS' and project_members.city = 'NANCY' and projects.end_year > '2018'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(2) T(3) C(2) T(3) Filter(0) Filter(2) A(0) Op(0) C(15) T(7) C(15) T(7) V(0) Filter(0) Filter(2) A(0) Op(0) C(33) T(12) C(33) T(12) V(1) Filter(5) A(0) Op(0) C(53) T(16) C(53) T(16) V(2)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_description) as ?aggregation_T1_description_9 ) WHERE { ?T1 a dbo:erc_panels . ?T15 a dbo:project_erc_panels . ?T15 dbo:panel ?T1 . ?T1 dbo:description ?T1_description . ?T2 dbo:institutions_name ?T2_institutions_name . ?T3 dbo:city ?T3_city . ?T4 dbo:end_year ?T4_end_year . ?T4 a dbo:projects . ?T15 dbo:project ?T4 . ?T1 dbo:description ?T1_description . ?T2 dbo:institutions_name ?T2_institutions_name . ?T3 dbo:city ?T3_city . ?T4 dbo:end_year ?T4_end_year . ?T3 a dbo:project_members . ?T3 dbo:project ?T4 . ?T1 dbo:description ?T1_description . ?T2 dbo:institutions_name ?T2_institutions_name . ?T3 dbo:city ?T3_city . ?T4 dbo:end_year ?T4_end_year . ?T2 a dbo:institutions . ?T3 dbo:institution_id ?T2 . ?T1 dbo:description ?T1_description . ?T2 dbo:institutions_name ?T2_institutions_name . ?T3 dbo:city ?T3_city . ?T4 dbo:end_year ?T4_end_year . FILTER(?T2_institutions_name = 'SYNARC SAS' && ?T3_city = 'NANCY' && ?T4_end_year > 2018) . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Show me the description of projects in Earth System Science where the start date is not in 2009",
    "sql_query": "select erc_research_domains.description from projects join project_erc_panels on projects.unics_id = project_erc_panels.project join erc_panels on project_erc_panels.panel = erc_panels.code join erc_research_domains on erc_panels.part_of = erc_research_domains.code where projects.start_year != '2009' and erc_panels.description = 'Earth System Science')",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(0) Op(0) C(2) T(4) C(2) T(4) Filter(0) Filter(3) A(0) Op(0) C(52) T(16) C(52) T(16) V(0) Filter(2) A(0) Op(0) C(2) T(3) C(2) T(3) V(1)",
    "sparql_query": "SELECT ?T1_description WHERE { ?T1 a dbo:erc_research_domains . ?T3 a dbo:erc_panels . ?T3 dbo:part_of ?T1 . ?T1 dbo:description ?T1_description . ?T2 dbo:start_year ?T2_start_year . ?T3 dbo:description ?T3_description . ?T14 a dbo:project_erc_panels . ?T14 dbo:panel ?T3 . ?T1 dbo:description ?T1_description . ?T2 dbo:start_year ?T2_start_year . ?T3 dbo:description ?T3_description . ?T2 a dbo:projects . ?T14 dbo:project ?T2 . ?T1 dbo:description ?T1_description . ?T2 dbo:start_year ?T2_start_year . ?T3 dbo:description ?T3_description . FILTER(?T2_start_year != 2009 && ?T3_description = 'Earth System Science') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Show me the name of project members in Life Science that are not from the Quickborn",
    "sql_query": "select distinct project_members.member_short_name from erc_research_domains join erc_panels on erc_research_domains.code = erc_panels.part_of join project_erc_panels on erc_panels.code = project_erc_panels.panel join projects on project_erc_panels.project = projects.unics_id join project_members on projects.unics_id = project_members.project where erc_research_domains.description = 'Life Sciences' and project_members.city != 'QUICKBORN'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(38) T(12) C(38) T(12) Filter(0) Filter(2) A(0) Op(0) C(2) T(4) C(2) T(4) V(0) Filter(3) A(0) Op(0) C(33) T(12) C(33) T(12) V(1)",
    "sparql_query": "SELECT DISTINCT ?T1_member_short_name WHERE { ?T1 a dbo:project_members . ?T13 a dbo:projects . ?T1 dbo:project ?T13 . ?T1 dbo:member_short_name ?T1_member_short_name . ?T2 dbo:description ?T2_description . ?T1 dbo:city ?T1_city . ?T14 a dbo:project_erc_panels . ?T14 dbo:project ?T13 . ?T1 dbo:member_short_name ?T1_member_short_name . ?T2 dbo:description ?T2_description . ?T1 dbo:city ?T1_city . ?T15 a dbo:erc_panels . ?T14 dbo:panel ?T15 . ?T1 dbo:member_short_name ?T1_member_short_name . ?T2 dbo:description ?T2_description . ?T1 dbo:city ?T1_city . ?T2 a dbo:erc_research_domains . ?T15 dbo:part_of ?T2 . ?T1 dbo:member_short_name ?T1_member_short_name . ?T2 dbo:description ?T2_description . ?T1 dbo:city ?T1_city . FILTER(?T2_description = 'Life Sciences' && ?T1_city != 'QUICKBORN') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Count the number of people that are principle investigators but are not in Social Sciences And Humanities",
    "sql_query": "select count(distinct people.full_name) from erc_panels join project_erc_panels on erc_panels.code = project_erc_panels.panel join erc_research_domains on erc_research_domains.code = erc_panels.part_of join projects on project_erc_panels.project = projects.unics_id join people on projects.principal_investigator = people.unics_id where erc_research_domains.description != 'Social Sciences And Humanities' and erc_panels.description != 'Materials and Synthesis'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(23) T(8) C(23) T(8) Filter(0) Filter(3) A(0) Op(0) C(2) T(4) C(2) T(4) V(0) Filter(3) A(0) Op(0) C(2) T(3) C(2) T(3) V(1)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_full_name) as ?aggregation_T1_full_name_110 ) WHERE { ?T1 a dbo:people . ?T14 a dbo:projects . ?T14 dbo:principal_investigator ?T1 . ?T1 dbo:full_name ?T1_full_name . ?T2 dbo:description ?T2_description . ?T3 dbo:description ?T3_description . ?T15 a dbo:project_erc_panels . ?T15 dbo:project ?T14 . ?T1 dbo:full_name ?T1_full_name . ?T2 dbo:description ?T2_description . ?T3 dbo:description ?T3_description . ?T3 a dbo:erc_panels . ?T15 dbo:panel ?T3 . ?T1 dbo:full_name ?T1_full_name . ?T2 dbo:description ?T2_description . ?T3 dbo:description ?T3_description . ?T2 a dbo:erc_research_domains . ?T3 dbo:part_of ?T2 . ?T1 dbo:full_name ?T1_full_name . ?T2 dbo:description ?T2_description . ?T3 dbo:description ?T3_description . FILTER(?T2_description != 'Social Sciences And Humanities' && ?T3_description != 'Materials && Synthesis') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Count number of territorial units of projects with tite \"Maintenance and disposal\" that ended after 2008 and who are not from \"GROTTAFERRATA RM\"",
    "sql_query": "select count(distinct eu_territorial_units.description) from projects join project_members on projects.unics_id = project_members.project join project_topics on project_topics.project = projects.unics_id join topics on topics.code = project_topics.topic join eu_territorial_units on project_members.geocode_regions_3 = eu_territorial_units.geocode_regions where topics.title = 'Maintenance and disposal' and project_members.city != 'GROTTAFERRATA RM' and projects.end_year > '2008'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(2) T(5) C(2) T(5) Filter(0) Filter(2) A(0) Op(0) C(13) T(18) C(13) T(18) V(0) Filter(0) Filter(3) A(0) Op(0) C(33) T(12) C(33) T(12) V(1) Filter(5) A(0) Op(0) C(53) T(16) C(53) T(16) V(2)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_description) as ?aggregation_T1_description_179 ) WHERE { ?T1 a dbo:eu_territorial_units . ?T3 a dbo:project_members . ?T3 dbo:geocode_regions_3 ?T1 . ?T1 dbo:description ?T1_description . ?T2 dbo:title ?T2_title . ?T3 dbo:city ?T3_city . ?T4 dbo:end_year ?T4_end_year . ?T4 a dbo:projects . ?T3 dbo:project ?T4 . ?T1 dbo:description ?T1_description . ?T2 dbo:title ?T2_title . ?T3 dbo:city ?T3_city . ?T4 dbo:end_year ?T4_end_year . ?T15 a dbo:project_topics . ?T15 dbo:project ?T4 . ?T1 dbo:description ?T1_description . ?T2 dbo:title ?T2_title . ?T3 dbo:city ?T3_city . ?T4 dbo:end_year ?T4_end_year . ?T2 a dbo:topics . ?T15 dbo:topic ?T2 . ?T1 dbo:description ?T1_description . ?T2 dbo:title ?T2_title . ?T3 dbo:city ?T3_city . ?T4 dbo:end_year ?T4_end_year . FILTER(?T2_title = 'Maintenance && disposal' && ?T3_city != 'GROTTAFERRATA RM' && ?T4_end_year > 2008) . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Count the activity types of Highbury Ltd in the country LS",
    "sql_query": "select count(distinct activity_types.description) from eu_territorial_units join project_members on eu_territorial_units.geocode_regions = project_members.geocode_regions_3 join activity_types on project_members.activity_type = activity_types.code join institutions on institutions.geocode_regions_3 = eu_territorial_units.geocode_regions where project_members.country = 'LS' and institutions.institutions_name = 'Highbury Ltd'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(2) T(0) C(2) T(0) Filter(0) Filter(2) A(0) Op(0) C(31) T(12) C(31) T(12) V(0) Filter(2) A(0) Op(0) C(15) T(7) C(15) T(7) V(1)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_description) as ?aggregation_T1_description_95 ) WHERE { ?T1 a dbo:activity_types . ?T4 a dbo:project_members . ?T4 dbo:activity_type ?T1 . ?T1 dbo:description ?T1_description . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T4 dbo:country ?T4_country . ?T2 dbo:institutions_name ?T2_institutions_name . ?T2 a dbo:institutions . ?T4 dbo:institution_id ?T2 . ?T1 dbo:description ?T1_description . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T4 dbo:country ?T4_country . ?T2 dbo:institutions_name ?T2_institutions_name . ?T3 a dbo:eu_territorial_units . ?T2 dbo:geocode_regions_3 ?T3 . ?T1 dbo:description ?T1_description . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T4 dbo:country ?T4_country . ?T2 dbo:institutions_name ?T2_institutions_name . ?T4 a dbo:project_members . ?T4 dbo:geocode_regions_3 ?T3 . ?T1 dbo:description ?T1_description . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T4 dbo:country ?T4_country . ?T2 dbo:institutions_name ?T2_institutions_name . FILTER(?T4_country = 'LS' && ?T2_institutions_name = 'Highbury Ltd') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Show the description of activity types of project members that are not from TOLOCHENAZ",
    "sql_query": "select distinct activity_types.description from project_members join activity_types on project_members.activity_type = activity_types.code where project_members.city != 'TOLOCHENAZ'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(2) T(0) C(2) T(0) Filter(3) A(0) Op(0) C(33) T(12) C(33) T(12) V(0)",
    "sparql_query": "SELECT DISTINCT ?T1_description WHERE { ?T1 a dbo:activity_types . ?T2 a dbo:project_members . ?T2 dbo:activity_type ?T1 . ?T1 dbo:description ?T1_description . ?T2 dbo:city ?T2_city . FILTER(?T2_city != 'TOLOCHENAZ') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the average costs of projects where the country code is not KH that started in 2017",
    "sql_query": "select avg(projects.total_cost) from institutions join eu_territorial_units on institutions.geocode_regions_3 = eu_territorial_units.geocode_regions join project_members on eu_territorial_units.geocode_regions = project_members.geocode_regions_3 join projects on project_members.project = projects.unics_id join countries on countries.unics_id = institutions.country_id where projects.start_year = '2017' and countries.country_code2 != 'KH'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(52) T(16) C(52) T(16) V(0) Filter(3) A(0) Op(0) C(5) T(1) C(5) T(1) V(1)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_197 ) WHERE { ?T1 a dbo:projects . ?T2 a dbo:project_members . ?T2 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T1 dbo:start_year ?T1_start_year . ?T5 dbo:country_code2 ?T5_country_code2 . ?T3 a dbo:eu_territorial_units . ?T2 dbo:geocode_regions_3 ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T1 dbo:start_year ?T1_start_year . ?T5 dbo:country_code2 ?T5_country_code2 . ?T4 a dbo:institutions . ?T4 dbo:geocode_regions_3 ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T1 dbo:start_year ?T1_start_year . ?T5 dbo:country_code2 ?T5_country_code2 . ?T5 a dbo:countries . ?T4 dbo:country_id ?T5 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T1 dbo:start_year ?T1_start_year . ?T5 dbo:country_code2 ?T5_country_code2 . FILTER(?T1_start_year = 2017 && ?T5_country_code2 != 'KH') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Count the title of funding schema of projects that end after 2023",
    "sql_query": "select count(distinct funding_schemes.title) from projects join funding_schemes on projects.ec_fund_scheme = funding_schemes.code where projects.end_year >= '2023'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(13) T(6) C(13) T(6) Filter(7) A(0) Op(0) C(53) T(16) C(53) T(16) V(0)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_22 ) WHERE { ?T1 a dbo:funding_schemes . ?T2 a dbo:projects . ?T2 dbo:ec_fund_scheme ?T1 . ?T1 dbo:title ?T1_title . ?T2 dbo:end_year ?T2_end_year . FILTER(?T2_end_year >= 2023) . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the sum of all project costs of the terriotrial unit Vaucluse of the department PRISMA Lab with the project acronym \"E3Canarias 2017-2018\"",
    "sql_query": "select sum(projects.total_cost) from project_members join projects on project_members.project = projects.unics_id join eu_territorial_units on eu_territorial_units.geocode_regions = project_members.geocode_regions_3 where eu_territorial_units.description = 'Vaucluse' and project_members.department_name = 'PRISMA Lab' and projects.acronym = 'E3Canarias 2017-2018'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(4) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(2) T(5) C(2) T(5) V(0) Filter(0) Filter(2) A(0) Op(0) C(39) T(12) C(39) T(12) V(1) Filter(2) A(0) Op(0) C(20) T(16) C(20) T(16) V(2)",
    "sparql_query": "SELECT (sum( ?T1_total_cost) as ?aggregation_T1_total_cost_33 ) WHERE { ?T1 a dbo:projects . ?T3 a dbo:project_members . ?T3 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:description ?T2_description . ?T3 dbo:department_name ?T3_department_name . ?T1 dbo:acronym ?T1_acronym . ?T2 a dbo:eu_territorial_units . ?T3 dbo:geocode_regions_3 ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:description ?T2_description . ?T3 dbo:department_name ?T3_department_name . ?T1 dbo:acronym ?T1_acronym . FILTER(?T2_description = 'Vaucluse' && ?T3_department_name = 'PRISMA Lab' && ?T1_acronym = 'E3Canarias 2017-2018') . } "
  }
]