[
  {
    "db_id": "cordis_temporary",
    "question": "How many different subject areas have the projects with a total cost of 1918600 and a participant that is different from the institution IFAE but has \"Louth County Development Board Office of Community and Ente\" as participating department?",
    "sql_query": "select count(distinct subject_areas.title) from projects join project_subject_areas on projects.unics_id = project_subject_areas.project join project_members on project_members.project = projects.unics_id join subject_areas on project_subject_areas.subject_area = subject_areas.code join institutions on institutions.unics_id = project_members.institution_id where projects.total_cost = '1918600' and project_members.department_name = 'Louth County Development Board Office of Community and Enter' and institutions.acronym != 'IFAE'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(13) T(17) C(13) T(17) Filter(0) Filter(2) A(0) Op(0) C(55) T(16) C(55) T(16) V(0) Filter(0) Filter(2) A(0) Op(0) C(39) T(12) C(39) T(12) V(1) Filter(3) A(0) Op(0) C(20) T(7) C(20) T(7) V(2)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_14 ) WHERE { ?T1 a dbo:subject_areas . ?T15 a dbo:project_subject_areas . ?T15 dbo:subject_area ?T1 . ?T1 dbo:title ?T1_title . ?T2 dbo:total_cost ?T2_total_cost . ?T3 dbo:department_name ?T3_department_name . ?T4 dbo:acronym ?T4_acronym . ?T2 a dbo:projects . ?T15 dbo:project ?T2 . ?T1 dbo:title ?T1_title . ?T2 dbo:total_cost ?T2_total_cost . ?T3 dbo:department_name ?T3_department_name . ?T4 dbo:acronym ?T4_acronym . ?T3 a dbo:project_members . ?T3 dbo:project ?T2 . ?T1 dbo:title ?T1_title . ?T2 dbo:total_cost ?T2_total_cost . ?T3 dbo:department_name ?T3_department_name . ?T4 dbo:acronym ?T4_acronym . ?T4 a dbo:institutions . ?T3 dbo:institution_id ?T4 . ?T1 dbo:title ?T1_title . ?T2 dbo:total_cost ?T2_total_cost . ?T3 dbo:department_name ?T3_department_name . ?T4 dbo:acronym ?T4_acronym . FILTER(?T2_total_cost = 1918600 && ?T3_department_name = 'Louth County Development Board Office of Community && Enter' && ?T4_acronym != 'IFAE') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Retrieve principal investigators of projects with a title different from \"Skill development and firm upgrading to sustain the competitiveness of the EU manufacturing sector\" and a member whose country is \"French Southern and Antarctic Lands\".",
    "sql_query": "select distinct people.full_name from institutions join project_members on institutions.unics_id = project_members.institution_id join projects on project_members.project = projects.unics_id join people on projects.principal_investigator = people.unics_id join countries on countries.unics_id = institutions.country_id where countries.country_name = 'French Southern and Antarctic Lands' and projects.title != 'Skill development and firm upgrading to sustain the competitiveness of the EU manufacturing sector'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(23) T(8) C(23) T(8) Filter(0) Filter(2) A(0) Op(0) C(4) T(1) C(4) T(1) V(0) Filter(3) A(0) Op(0) C(13) T(16) C(13) T(16) V(1)",
    "sparql_query": "SELECT DISTINCT ?T1_full_name WHERE { ?T1 a dbo:people . ?T3 a dbo:projects . ?T3 dbo:principal_investigator ?T1 . ?T1 dbo:full_name ?T1_full_name . ?T2 dbo:country_name ?T2_country_name . ?T3 dbo:title ?T3_title . ?T14 a dbo:project_members . ?T14 dbo:project ?T3 . ?T1 dbo:full_name ?T1_full_name . ?T2 dbo:country_name ?T2_country_name . ?T3 dbo:title ?T3_title . ?T15 a dbo:institutions . ?T14 dbo:institution_id ?T15 . ?T1 dbo:full_name ?T1_full_name . ?T2 dbo:country_name ?T2_country_name . ?T3 dbo:title ?T3_title . ?T2 a dbo:countries . ?T15 dbo:country_id ?T2 . ?T1 dbo:full_name ?T1_full_name . ?T2 dbo:country_name ?T2_country_name . ?T3 dbo:title ?T3_title . FILTER(?T2_country_name = 'French Southern && Antarctic Lands' && ?T3_title != 'Skill development && firm upgrading to sustain the competitiveness of the EU manufacturing sector') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the total number of distinct ending dates of projects that have a member whose geocode region 3 is not \"R\u00e9gion l\u00e9manique\" but it is the same as that of some institution different from \"FONDAZIONE RI.MED\" whose country is Thailand?",
    "sql_query": "select count(distinct projects.end_date) from institutions join eu_territorial_units on institutions.geocode_regions_3 = eu_territorial_units.geocode_regions join countries on countries.unics_id = institutions.country_id join project_members on eu_territorial_units.geocode_regions = project_members.geocode_regions_3 join projects on project_members.project = projects.unics_id where institutions.institutions_name != 'FONDAZIONE RI.MED' and countries.country_code2 = 'TH' and eu_territorial_units.description != 'R\u00e9gion l\u00e9manique'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(51) T(16) C(51) T(16) Filter(0) Filter(3) A(0) Op(0) C(15) T(7) C(15) T(7) V(0) Filter(0) Filter(2) A(0) Op(0) C(5) T(1) C(5) T(1) V(1) Filter(3) A(0) Op(0) C(2) T(5) C(2) T(5) V(2)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_end_date) as ?aggregation_T1_end_date_161 ) WHERE { ?T1 a dbo:projects . ?T15 a dbo:project_members . ?T15 dbo:project ?T1 . ?T1 dbo:end_date ?T1_end_date . ?T2 dbo:institutions_name ?T2_institutions_name . ?T3 dbo:country_code2 ?T3_country_code2 . ?T4 dbo:description ?T4_description . ?T2 a dbo:institutions . ?T15 dbo:institution_id ?T2 . ?T1 dbo:end_date ?T1_end_date . ?T2 dbo:institutions_name ?T2_institutions_name . ?T3 dbo:country_code2 ?T3_country_code2 . ?T4 dbo:description ?T4_description . ?T3 a dbo:countries . ?T2 dbo:country_id ?T3 . ?T1 dbo:end_date ?T1_end_date . ?T2 dbo:institutions_name ?T2_institutions_name . ?T3 dbo:country_code2 ?T3_country_code2 . ?T4 dbo:description ?T4_description . ?T4 a dbo:eu_territorial_units . ?T2 dbo:geocode_regions_3 ?T4 . ?T1 dbo:end_date ?T1_end_date . ?T2 dbo:institutions_name ?T2_institutions_name . ?T3 dbo:country_code2 ?T3_country_code2 . ?T4 dbo:description ?T4_description . FILTER(?T2_institutions_name != 'FONDAZIONE RI.MED' && ?T3_country_code2 = 'TH' && ?T4_description != 'R\u00e9gion l\u00e9manique') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Show me the short name of the institution with acronym INSERM which is a project member and has an eu territorial unit different from Lichtenfels?",
    "sql_query": "select distinct institutions.short_name from project_members join institutions on project_members.institution_id = institutions.unics_id join eu_territorial_units on eu_territorial_units.geocode_regions = project_members.geocode_regions_3 where institutions.acronym = 'INSERM' and eu_territorial_units.description != 'Lichtenfels'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(21) T(7) C(21) T(7) Filter(0) Filter(2) A(0) Op(0) C(20) T(7) C(20) T(7) V(0) Filter(3) A(0) Op(0) C(2) T(5) C(2) T(5) V(1)",
    "sparql_query": "SELECT DISTINCT ?T1_short_name WHERE { ?T1 a dbo:institutions . ?T2 a dbo:eu_territorial_units . ?T1 dbo:geocode_regions_3 ?T2 . ?T1 dbo:short_name ?T1_short_name . ?T2 dbo:geocode_regions ?T2_geocode_regions . ?T1 dbo:unics_id ?T1_unics_id . ?T1 dbo:acronym ?T1_acronym . ?T2 dbo:description ?T2_description . ?T3 a dbo:project_members . ?T3 dbo:geocode_regions_3 ?T2 . ?T1 dbo:short_name ?T1_short_name . ?T2 dbo:geocode_regions ?T2_geocode_regions . ?T1 dbo:unics_id ?T1_unics_id . ?T1 dbo:acronym ?T1_acronym . ?T2 dbo:description ?T2_description . FILTER(?T1_acronym = 'INSERM' && ?T2_description != 'Lichtenfels') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the average total cost of projects that started on the 25th of February 2018 and have a member whose country is Bahrain?",
    "sql_query": "select avg(projects.total_cost) from project_members join projects on project_members.project = projects.unics_id where project_members.country != 'BH' and projects.start_date = '2018-02-25'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(3) A(0) Op(0) C(31) T(12) C(31) T(12) V(0) Filter(2) A(0) Op(0) C(50) T(16) C(50) T(16) V(1)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_121 ) WHERE { ?T1 a dbo:projects . ?T2 a dbo:project_members . ?T2 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:country ?T2_country . ?T1 dbo:start_date ?T1_start_date . FILTER(?T2_country != 'BH' && ?T1_start_date = '2018-02-25') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the added total cost of projects in the ERC panel \"Systems and communication engineering\" that is part of the research domain \"Physical Sciences And Engineering\"?",
    "sql_query": "select sum(projects.total_cost) from erc_research_domains join erc_panels on erc_research_domains.code = erc_panels.part_of join project_erc_panels on erc_panels.code = project_erc_panels.panel join projects on project_erc_panels.project = projects.unics_id where erc_research_domains.description = 'Physical Sciences And Engineering' and erc_panels.description = 'Systems and communication engineering'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(4) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(2) T(4) C(2) T(4) V(0) Filter(2) A(0) Op(0) C(2) T(3) C(2) T(3) V(1)",
    "sparql_query": "SELECT (sum( ?T1_total_cost) as ?aggregation_T1_total_cost_26 ) WHERE { ?T1 a dbo:projects . ?T14 a dbo:project_erc_panels . ?T14 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:description ?T2_description . ?T3 dbo:description ?T3_description . ?T3 a dbo:erc_panels . ?T14 dbo:panel ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:description ?T2_description . ?T3 dbo:description ?T3_description . ?T2 a dbo:erc_research_domains . ?T3 dbo:part_of ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:description ?T2_description . ?T3 dbo:description ?T3_description . FILTER(?T2_description = 'Physical Sciences And Engineering' && ?T3_description = 'Systems && communication engineering') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "How many different activity types have the members of the project titled \"Neuropsychiatric disorders are a heterogeneous group of mental pathologies that demand prolonged and treatments that are frequently ineffective. Elucidating the cellular and molecular mechanisms under\" that belongs to the subject area \"Healthcare delivery/services\"?",
    "sql_query": "select count(distinct activity_types.description) from projects join project_members on projects.unics_id = project_members.project join activity_types on project_members.activity_type = activity_types.code join project_subject_areas on project_subject_areas.project = projects.unics_id join subject_areas on subject_areas.code = project_subject_areas.subject_area where projects.title = 'Neuropsychiatric disorders are a heterogeneous group of mental pathologies that demand prolonged and treatments that are frequently ineffective. Elucidating the cellular and molecular mechanisms under' and subject_areas.title = 'Healthcare delivery/services'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(2) T(0) C(2) T(0) Filter(0) Filter(2) A(0) Op(0) C(13) T(16) C(13) T(16) V(0) Filter(2) A(0) Op(0) C(13) T(17) C(13) T(17) V(1)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_description) as ?aggregation_T1_description_45 ) WHERE { ?T1 a dbo:activity_types . ?T14 a dbo:project_members . ?T14 dbo:activity_type ?T1 . ?T1 dbo:description ?T1_description . ?T2 dbo:title ?T2_title . ?T3 dbo:title ?T3_title . ?T2 a dbo:projects . ?T14 dbo:project ?T2 . ?T1 dbo:description ?T1_description . ?T2 dbo:title ?T2_title . ?T3 dbo:title ?T3_title . ?T15 a dbo:project_subject_areas . ?T15 dbo:project ?T2 . ?T1 dbo:description ?T1_description . ?T2 dbo:title ?T2_title . ?T3 dbo:title ?T3_title . ?T3 a dbo:subject_areas . ?T15 dbo:subject_area ?T3 . ?T1 dbo:description ?T1_description . ?T2 dbo:title ?T2_title . ?T3 dbo:title ?T3_title . FILTER(?T2_title = 'Neuropsychiatric disorders are a heterogeneous group of mental pathologies that demand prolonged && treatments that are frequently ineffective. Elucidating the cellular && molecular mechanisms under' && ?T3_title = 'Healthcare delivery/services') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Get all principal investigators of projects that started after the 13th of January 2020 and have a member with short name SelFly that is not in the geocode region 3 of Rh\u00f6n-Grabfeld.",
    "sql_query": "select distinct people.full_name from project_members join projects on project_members.project = projects.unics_id join institutions on institutions.unics_id = project_members.institution_id join eu_territorial_units on eu_territorial_units.geocode_regions = institutions.geocode_regions_3 join people on projects.principal_investigator = people.unics_id where eu_territorial_units.description != 'Rh\u00f6n-Grabfeld' and project_members.member_short_name = 'SelFly' and projects.start_date > '2020-01-13'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(23) T(8) C(23) T(8) Filter(0) Filter(3) A(0) Op(0) C(2) T(5) C(2) T(5) V(0) Filter(0) Filter(2) A(0) Op(0) C(38) T(12) C(38) T(12) V(1) Filter(5) A(0) Op(0) C(50) T(16) C(50) T(16) V(2)",
    "sparql_query": "SELECT DISTINCT ?T1_full_name WHERE { ?T1 a dbo:people . ?T5 a dbo:projects . ?T5 dbo:principal_investigator ?T1 . ?T1 dbo:full_name ?T1_full_name . ?T2 dbo:geocode_regions ?T2_geocode_regions . ?T4 dbo:institution_id ?T4_institution_id . ?T2 dbo:description ?T2_description . ?T4 dbo:member_short_name ?T4_member_short_name . ?T5 dbo:start_date ?T5_start_date . ?T4 a dbo:project_members . ?T4 dbo:project ?T5 . ?T1 dbo:full_name ?T1_full_name . ?T2 dbo:geocode_regions ?T2_geocode_regions . ?T4 dbo:institution_id ?T4_institution_id . ?T2 dbo:description ?T2_description . ?T4 dbo:member_short_name ?T4_member_short_name . ?T5 dbo:start_date ?T5_start_date . ?T2 a dbo:eu_territorial_units . ?T4 dbo:geocode_regions_3 ?T2 . ?T1 dbo:full_name ?T1_full_name . ?T2 dbo:geocode_regions ?T2_geocode_regions . ?T4 dbo:institution_id ?T4_institution_id . ?T2 dbo:description ?T2_description . ?T4 dbo:member_short_name ?T4_member_short_name . ?T5 dbo:start_date ?T5_start_date . ?T3 a dbo:institutions . ?T3 dbo:geocode_regions_3 ?T2 . ?T1 dbo:full_name ?T1_full_name . ?T2 dbo:geocode_regions ?T2_geocode_regions . ?T4 dbo:institution_id ?T4_institution_id . ?T2 dbo:description ?T2_description . ?T4 dbo:member_short_name ?T4_member_short_name . ?T5 dbo:start_date ?T5_start_date . ?T4 a dbo:project_members . ?T4 dbo:institution_id ?T3 . ?T1 dbo:full_name ?T1_full_name . ?T2 dbo:geocode_regions ?T2_geocode_regions . ?T4 dbo:institution_id ?T4_institution_id . ?T2 dbo:description ?T2_description . ?T4 dbo:member_short_name ?T4_member_short_name . ?T5 dbo:start_date ?T5_start_date . FILTER(?T2_description != 'Rh\u00f6n-Grabfeld' && ?T4_member_short_name = 'SelFly' && ?T5_start_date > '2020-01-13') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the average total cost of projects that have members whose participating department is \"Comune di Roma\" and are not in the geocode region 3 of \"Arr. Nivelles\"?",
    "sql_query": "select avg(projects.total_cost) from project_members join projects on project_members.project = projects.unics_id join institutions on institutions.unics_id = project_members.institution_id join eu_territorial_units on eu_territorial_units.geocode_regions = institutions.geocode_regions_3 where project_members.department_name = 'Comune di Roma' and eu_territorial_units.description != 'Arr. Nivelles'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(39) T(12) C(39) T(12) V(0) Filter(3) A(0) Op(0) C(2) T(5) C(2) T(5) V(1)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_141 ) WHERE { ?T1 a dbo:projects . ?T4 a dbo:project_members . ?T4 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions ?T2_geocode_regions . ?T4 dbo:institution_id ?T4_institution_id . ?T4 dbo:department_name ?T4_department_name . ?T2 dbo:description ?T2_description . ?T2 a dbo:eu_territorial_units . ?T4 dbo:geocode_regions_3 ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions ?T2_geocode_regions . ?T4 dbo:institution_id ?T4_institution_id . ?T4 dbo:department_name ?T4_department_name . ?T2 dbo:description ?T2_description . ?T3 a dbo:institutions . ?T3 dbo:geocode_regions_3 ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions ?T2_geocode_regions . ?T4 dbo:institution_id ?T4_institution_id . ?T4 dbo:department_name ?T4_department_name . ?T2 dbo:description ?T2_description . ?T4 a dbo:project_members . ?T4 dbo:institution_id ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions ?T2_geocode_regions . ?T4 dbo:institution_id ?T4_institution_id . ?T4 dbo:department_name ?T4_department_name . ?T2 dbo:description ?T2_description . FILTER(?T4_department_name = 'Comune di Roma' && ?T2_description != 'Arr. Nivelles') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "How many members with a participating department different from \"D\u00c3\u00a9l\u00c3\u00a9gation R\u00c3\u00a9gionale Nord-Ouest\" has the project funded by the \"Network of Excellence\" scheme and titled \"Ultrafast spin transport and magnetic order controlled by terahertz electromagnetic pulses\"?",
    "sql_query": "select count(distinct project_members.member_short_name) from funding_schemes join projects on funding_schemes.code = projects.ec_fund_scheme join project_members on projects.unics_id = project_members.project where funding_schemes.title = 'Network of Excellence' and projects.title = 'Ultrafast spin transport and magnetic order controlled by terahertz electromagnetic pulses' and project_members.department_name != 'D\u00c3\u00a9l\u00c3\u00a9gation R\u00c3\u00a9gionale Nord-Ouest'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(38) T(12) C(38) T(12) Filter(0) Filter(2) A(0) Op(0) C(13) T(6) C(13) T(6) V(0) Filter(0) Filter(2) A(0) Op(0) C(13) T(16) C(13) T(16) V(1) Filter(3) A(0) Op(0) C(39) T(12) C(39) T(12) V(2)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_member_short_name) as ?aggregation_T1_member_short_name_89 ) WHERE { ?T1 a dbo:project_members . ?T3 a dbo:projects . ?T1 dbo:project ?T3 . ?T1 dbo:member_short_name ?T1_member_short_name . ?T2 dbo:title ?T2_title . ?T3 dbo:title ?T3_title . ?T1 dbo:department_name ?T1_department_name . ?T2 a dbo:funding_schemes . ?T3 dbo:ec_fund_scheme ?T2 . ?T1 dbo:member_short_name ?T1_member_short_name . ?T2 dbo:title ?T2_title . ?T3 dbo:title ?T3_title . ?T1 dbo:department_name ?T1_department_name . FILTER(?T2_title = 'Network of Excellence' && ?T3_title = 'Ultrafast spin transport && magnetic order controlled by terahertz electromagnetic pulses' && ?T1_department_name != 'D\u00c3\u00a9l\u00c3\u00a9gation R\u00c3\u00a9gionale Nord-Ouest') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Retrieve country code 2 of country \"New Zealand\" having an institution named \"Parc Agrari del Baix Llobregat\" inside.",
    "sql_query": "select distinct countries.country_code2 from institutions join countries on institutions.country_id = countries.unics_id where countries.country_name = 'New Zealand' and institutions.short_name = 'Parc Agrari del Baix Llobregat'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(0) Op(0) C(5) T(1) C(5) T(1) Filter(0) Filter(2) A(0) Op(0) C(4) T(1) C(4) T(1) V(0) Filter(2) A(0) Op(0) C(21) T(7) C(21) T(7) V(1)",
    "sparql_query": "SELECT DISTINCT ?T1_country_code2 WHERE { ?T1 a dbo:countries . ?T2 a dbo:institutions . ?T2 dbo:country_id ?T1 . ?T1 dbo:country_code2 ?T1_country_code2 . ?T1 dbo:country_name ?T1_country_name . ?T2 dbo:short_name ?T2_short_name . FILTER(?T1_country_name = 'New Zealand' && ?T2_short_name = 'Parc Agrari del Baix Llobregat') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the average total cost of projects of members that are not from Outer London East and North East and do not have the acronym Antepigenetics",
    "sql_query": "select avg(projects.total_cost) from eu_territorial_units join institutions on eu_territorial_units.geocode_regions = institutions.geocode_regions_3 join project_members on institutions.unics_id = project_members.institution_id join projects on project_members.project = projects.unics_id where eu_territorial_units.description != 'Outer London \u2013 East and North East' and projects.acronym != 'ANTEPIGENETICS'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(3) A(0) Op(0) C(2) T(5) C(2) T(5) V(0) Filter(3) A(0) Op(0) C(20) T(16) C(20) T(16) V(1)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_55 ) WHERE { ?T1 a dbo:projects . ?T2 a dbo:project_members . ?T2 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:institution_id ?T2_institution_id . ?T4 dbo:geocode_regions ?T4_geocode_regions . ?T4 dbo:description ?T4_description . ?T1 dbo:acronym ?T1_acronym . ?T3 a dbo:institutions . ?T2 dbo:institution_id ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:institution_id ?T2_institution_id . ?T4 dbo:geocode_regions ?T4_geocode_regions . ?T4 dbo:description ?T4_description . ?T1 dbo:acronym ?T1_acronym . ?T4 a dbo:eu_territorial_units . ?T3 dbo:geocode_regions_3 ?T4 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:institution_id ?T2_institution_id . ?T4 dbo:geocode_regions ?T4_geocode_regions . ?T4 dbo:description ?T4_description . ?T1 dbo:acronym ?T1_acronym . FILTER(?T4_description != 'Outer London \u2013 East && North East' && ?T1_acronym != 'ANTEPIGENETICS') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the total cost of the projects that have at least one subject area that is not Aerospace Technology and have the acronym TOFNITW",
    "sql_query": "select sum(projects.total_cost) from project_subject_areas join projects on project_subject_areas.project = projects.unics_id join subject_areas on subject_areas.code = project_subject_areas.subject_area where subject_areas.title != 'Aerospace Technology' and projects.acronym = 'TOFNITW'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(4) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(3) A(0) Op(0) C(13) T(17) C(13) T(17) V(0) Filter(2) A(0) Op(0) C(20) T(16) C(20) T(16) V(1)",
    "sparql_query": "SELECT (sum( ?T1_total_cost) as ?aggregation_T1_total_cost_111 ) WHERE { ?T1 a dbo:projects . ?T13 a dbo:project_subject_areas . ?T13 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:title ?T2_title . ?T1 dbo:acronym ?T1_acronym . ?T2 a dbo:subject_areas . ?T13 dbo:subject_area ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:title ?T2_title . ?T1 dbo:acronym ?T1_acronym . FILTER(?T2_title != 'Aerospace Technology' && ?T1_acronym = 'TOFNITW') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the total cost of all DEMOBASE projects from all institutions except PSL?",
    "sql_query": "select avg(projects.total_cost) from institutions join eu_territorial_units on institutions.geocode_regions_3 = eu_territorial_units.geocode_regions join project_members on eu_territorial_units.geocode_regions = project_members.geocode_regions_3 join projects on project_members.project = projects.unics_id where projects.acronym = 'DEMOBASE' and institutions.short_name != 'PSL'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(5) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(20) T(16) C(20) T(16) V(0) Filter(3) A(0) Op(0) C(21) T(7) C(21) T(7) V(1)",
    "sparql_query": "SELECT (avg( ?T1_total_cost) as ?aggregation_T1_total_cost_85 ) WHERE { ?T1 a dbo:projects . ?T2 a dbo:project_members . ?T2 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T1 dbo:acronym ?T1_acronym . ?T4 dbo:short_name ?T4_short_name . ?T3 a dbo:eu_territorial_units . ?T2 dbo:geocode_regions_3 ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T1 dbo:acronym ?T1_acronym . ?T4 dbo:short_name ?T4_short_name . ?T4 a dbo:institutions . ?T4 dbo:geocode_regions_3 ?T3 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:geocode_regions_3 ?T2_geocode_regions_3 . ?T4 dbo:geocode_regions_3 ?T4_geocode_regions_3 . ?T1 dbo:acronym ?T1_acronym . ?T4 dbo:short_name ?T4_short_name . FILTER(?T1_acronym = 'DEMOBASE' && ?T4_short_name != 'PSL') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the total cost of all projects called INsPiRE in which Fran\u00e7ois Collart Dutilleul is principal investigator?",
    "sql_query": "select sum(projects.total_cost) from people join projects on people.unics_id = projects.principal_investigator where people.full_name = 'Fran\u00e7ois Collart Dutilleul' and projects.acronym = 'INsPiRE'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(4) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(2) A(0) Op(0) C(23) T(8) C(23) T(8) V(0) Filter(2) A(0) Op(0) C(20) T(16) C(20) T(16) V(1)",
    "sparql_query": "SELECT (sum( ?T1_total_cost) as ?aggregation_T1_total_cost_123 ) WHERE { ?T1 a dbo:projects . ?T2 a dbo:people . ?T1 dbo:principal_investigator ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T2 dbo:full_name ?T2_full_name . ?T1 dbo:acronym ?T1_acronym . FILTER(?T2_full_name = 'Fran\u00e7ois Collart Dutilleul' && ?T1_acronym = 'INsPiRE') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the total cost of projects looking into Higher or Secondary Education Establishments ending before 2023-03-31?",
    "sql_query": "select sum(projects.total_cost) from activity_types join project_members on activity_types.code = project_members.activity_type join projects on project_members.project = projects.unics_id where projects.end_date < '2023-03-31' and activity_types.description = 'Higher or Secondary Education Establishments'",
    "semql_query": "Root1(3) Root(3) Sel(0) N(0) A(4) Op(0) C(55) T(16) C(55) T(16) Filter(0) Filter(4) A(0) Op(0) C(51) T(16) C(51) T(16) V(0) Filter(2) A(0) Op(0) C(2) T(0) C(2) T(0) V(1)",
    "sparql_query": "SELECT (sum( ?T1_total_cost) as ?aggregation_T1_total_cost_189 ) WHERE { ?T1 a dbo:projects . ?T13 a dbo:project_members . ?T13 dbo:project ?T1 . ?T1 dbo:total_cost ?T1_total_cost . ?T1 dbo:end_date ?T1_end_date . ?T2 dbo:description ?T2_description . ?T2 a dbo:activity_types . ?T13 dbo:activity_type ?T2 . ?T1 dbo:total_cost ?T1_total_cost . ?T1 dbo:end_date ?T1_end_date . ?T2 dbo:description ?T2_description . FILTER(?T1_end_date < '2023-03-31' && ?T2_description = 'Higher || Secondary Education Establishments') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "How many projects are there outside of Austria that are not called Technology \u201cdemonstrator projects\u201d for exploration?",
    "sql_query": "select count(distinct project_members.city) from project_topics join projects on project_topics.project = projects.unics_id join project_members on projects.unics_id = project_members.project join topics on topics.code = project_topics.topic where project_members.country != 'AU' and topics.title != 'Technology \u201cdemonstrator projects\u201d for exploration'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(33) T(12) C(33) T(12) Filter(0) Filter(3) A(0) Op(0) C(31) T(12) C(31) T(12) V(0) Filter(3) A(0) Op(0) C(13) T(18) C(13) T(18) V(1)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_city) as ?aggregation_T1_city_143 ) WHERE { ?T1 a dbo:project_members . ?T13 a dbo:projects . ?T1 dbo:project ?T13 . ?T1 dbo:city ?T1_city . ?T1 dbo:country ?T1_country . ?T2 dbo:title ?T2_title . ?T14 a dbo:project_topics . ?T14 dbo:project ?T13 . ?T1 dbo:city ?T1_city . ?T1 dbo:country ?T1_country . ?T2 dbo:title ?T2_title . ?T2 a dbo:topics . ?T14 dbo:topic ?T2 . ?T1 dbo:city ?T1_city . ?T1 dbo:country ?T1_country . ?T2 dbo:title ?T2_title . FILTER(?T1_country != 'AU' && ?T2_title != 'Technology \u201cdemonstrator projects\u201d for exploration') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "What is the number of projects that do not have the arconym ENTICE?",
    "sql_query": "select count(distinct topics.title) from projects join project_topics on projects.unics_id = project_topics.project join topics on project_topics.topic = topics.code where projects.acronym != 'ENTICE'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(13) T(18) C(13) T(18) Filter(3) A(0) Op(0) C(20) T(16) C(20) T(16) V(0)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_12 ) WHERE { ?T1 a dbo:topics . ?T13 a dbo:project_topics . ?T13 dbo:topic ?T1 . ?T1 dbo:title ?T1_title . ?T2 dbo:acronym ?T2_acronym . ?T2 a dbo:projects . ?T13 dbo:project ?T2 . ?T1 dbo:title ?T1_title . ?T2 dbo:acronym ?T2_acronym . FILTER(?T2_acronym != 'ENTICE') . } "
  },
  {
    "db_id": "cordis_temporary",
    "question": "Count the number of distinct acronyms for the institutions having a project programme \"Safe and sustainable nanotechnologies\" whose members are all in the city \"Sarno SA\"",
    "sql_query": "select count(distinct institutions.acronym) from project_programmes join projects on project_programmes.project = projects.unics_id join project_members on projects.unics_id = project_members.project join institutions on project_members.institution_id = institutions.unics_id join programmes on programmes.code = project_programmes.programme where programmes.short_name = 'Safe and sustainable nanotechnologies' and projects.start_year >= 'None' and project_members.city = 'SARNO SA'",
    "semql_query": "Root1(3) Root(3) Sel(1) N(0) A(3) Op(0) C(20) T(7) C(20) T(7) Filter(0) Filter(2) A(0) Op(0) C(21) T(9) C(21) T(9) V(0) Filter(0) Filter(7) A(0) Op(0) C(52) T(16) C(52) T(16) V(1) Filter(2) A(0) Op(0) C(33) T(12) C(33) T(12) V(2)",
    "sparql_query": "SELECT DISTINCT (count(DISTINCT ?T1_acronym) as ?aggregation_T1_acronym_48 ) WHERE { ?T1 a dbo:institutions . ?T4 a dbo:project_members . ?T4 dbo:institution_id ?T1 . ?T1 dbo:acronym ?T1_acronym . ?T2 dbo:short_name ?T2_short_name . ?T3 dbo:start_year ?T3_start_year . ?T4 dbo:city ?T4_city . ?T3 a dbo:projects . ?T4 dbo:project ?T3 . ?T1 dbo:acronym ?T1_acronym . ?T2 dbo:short_name ?T2_short_name . ?T3 dbo:start_year ?T3_start_year . ?T4 dbo:city ?T4_city . ?T15 a dbo:project_programmes . ?T15 dbo:project ?T3 . ?T1 dbo:acronym ?T1_acronym . ?T2 dbo:short_name ?T2_short_name . ?T3 dbo:start_year ?T3_start_year . ?T4 dbo:city ?T4_city . ?T2 a dbo:programmes . ?T15 dbo:programme ?T2 . ?T1 dbo:acronym ?T1_acronym . ?T2 dbo:short_name ?T2_short_name . ?T3 dbo:start_year ?T3_start_year . ?T4 dbo:city ?T4_city . FILTER(?T2_short_name = 'Safe && sustainable nanotechnologies' && ?T3_start_year >= None && ?T4_city = 'SARNO SA') . } "
  }
]